{"organizations": [], "uuid": "e67e7b63488a7adfe9d29393528dec5e22d4af80", "thread": {"site_full": "www.washingtonpost.com", "main_image": "https://img.washingtonpost.com/rf/image_1484w/2010-2019/WashingtonPost/2016/11/11/Local-Enterprise/Images/KELLYCOL031415841131-0384.jpg", "site_section": "http://www.washingtonpost.com/local", "section_title": "Local - The Washington Post", "url": "https://www.washingtonpost.com/local/with-a-helping-hand-from-homestretch-she-hit-the-reset-button-on-a-troubled-life/2016/11/29/b54ee272-b644-11e6-a677-b608fbb3aaf6_story.html", "country": "US", "domain_rank": 177, "title": "With a helping hand from Homestretch, she hit the reset button on a troubled life", "performance_score": 0, "site": "washingtonpost.com", "participants_count": 1, "title_full": "With a helping hand from Homestretch, she hit the reset button on a troubled life - The Washington Post", "spam_score": 1.0, "site_type": "news", "published": "2016-11-29T02:00:00.000+02:00", "replies_count": 0, "uuid": "e67e7b63488a7adfe9d29393528dec5e22d4af80"}, "author": "John Kelly", "url": "https://www.washingtonpost.com/local/with-a-helping-hand-from-homestretch-she-hit-the-reset-button-on-a-troubled-life/2016/11/29/b54ee272-b644-11e6-a677-b608fbb3aaf6_story.html", "ord_in_thread": 0, "title": "With a helping hand from Homestretch, she hit the reset button on a troubled life", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "When most of us think of the homeless, we don’t think of someone like Michelle : onetime branch manager of a bank, married with children, someone who doesn’t drink or do drugs.\n“They look at [homelessness] as sort of, ‘You must have lived on the street,” said Michelle, who is in her 30s. “No, I had a beautiful life.”\nA year ago, Michelle was living in Pennsylvania with her husband and their then 14-year-old daughter and 2-year-old son. Her husband, Michelle realizes now, was into some sketchy stuff, stuff that would eventually land him in jail. Things worsened when Michelle lost her job, a consequence of being unable to find affordable child care. Emotional abuse at the hands of her husband turned into physical abuse.\n“You never see those relationships end well,” Michelle said. “When push comes to shove, I have to be alive and well for my children. . . . I didn’t have a plan, per se. I packed up what I could, and we just left.”\nA year earlier, Michelle had attended a church conference where she’d befriended a woman who lived in Northern Virginia. That’s where she headed, to the only sympathetic home she could think of. Her friend could accommodate Michelle and her children for only a short while, so the family found itself homeless.\nMichelle said the 41 days they spent living in a Fairfax County homeless shelter disabused her of the notion that she was in control of her life.\n“I was someone who was like, ‘I’m supermom, and I can do it all,” Michelle said.\nEven in the shelter, she worked. She found a job at a post office 50 miles away. She was homeless, barely treading water, deeply in debt, commuting 100 miles a day. Her daughter was distraught that she’d started high school while living in a shelter.\n“I cried on my way to work every morning and on my way home every night,” Michelle said.\nThen Michelle heard about Homestretch, a charity that works with homeless families in Virginia and is a partner in The Washington Post Helping Hand . More than 90 percent of the families Homestretch serves are headed by single mothers. Sixty percent are homeless because of domestic violence or human trafficking.\n“The interview process was about three hours long,” Michelle said. “If you got accepted, you had to come back for another 2½-hour interview. . . . They talked about how they want to help you and also how they want you to help yourself.”\nHomestretch advisers sat down with Michelle and explained that they would provide an apartment for her family. She would be required to pay 30 percent of her salary in rent and put an additional 10 percent of her salary into a savings account to start paying back the debt she had accrued when her marriage was falling apart.\nShe would also need to participate in financial counseling, employment counseling and life-skills counseling.\n“All of those resources are tied into one another,” Michelle said.\nMichelle was impressed that the Homestretch employment counselor urged her not to jump into the first job she could find close to home. It was important that Michelle find a job that suited her skills, paid well and came with longevity.\n“With longevity comes a better salary,” Michelle said.\nThat’s what Michelle found: an administrative office job that pays $52,000 a year.\nFor the first time ever, Michelle has life insurance, purchased with the help of Homestretch. “I look at my credit report every day,” she said. “That’s something I’ve never done before. Even though I worked in banking, I’ve never done it.”\nMichelle is halfway through the two-year Homestretch program.\n“My hope for a year from now is to be completely debt-free and also to purchase a home in Virginia,” she said. “When you purchase a house, it’s like saying we’re here for the long haul. It’s a safe place. These doors will never be closed. It’s home.”\nYou can help Michelle told me that becoming part of Homestretch was like “hitting the reset button.” It’s given her a safe space in which to get her life in order. (She’s not the only one in the family working. Her teenage daughter is, too.)\nYour tax-deductible gift to Homestretch will help other families in need. To give online, visit posthelpinghand.com . To donate by mail, make a check payable to “Homestretch” and mail it to: Homestretch, 303 S. Maple Ave., Falls Church, Va. 22046, Attn: Nan Monday.\nJoin me Wednesday at 3:30 p.m. as I chat on Facebook Live with Christopher Fay, Homestretch’s executive director. Go to facebook.com/washpostpr to tune in.\nWe’re into the third week of The Post Helping Hand fundraising drive. Our goal is to raise $225,000 by Jan. 6. After two weeks, we’ve raised $24,976.\nTwitter: @johnkelly\nFor previous columns, visit washingtonpost.com/johnkelly.", "external_links": ["https://www.facebook.com/WashPostPR/"], "published": "2016-11-29T02:00:00.000+02:00", "crawled": "2016-11-30T00:58:52.330+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}