{"organizations": [], "uuid": "be2324568e1913518e8f227bdb092a36f738541f", "thread": {"site_full": "uk.reuters.com", "main_image": "http://yospace-cds1.reuters.com/u/resize~ad1~1200/0/f/~image_jpeg~9999-1/1/m/x/9/g/2/ktpo/reuters04?videoId=124180747", "site_section": "http://feeds.reuters.com/reuters/UKVideoWorldNews", "section_title": "Reuters Video: World News", "url": "http://uk.reuters.com/video/2016/11/19/trump-says-romney-meeting-went-great?videoId=370509257", "country": "US", "domain_rank": 408, "title": "Trump says Romney meeting 'went great'", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Trump says Romney meeting 'went great'", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:53:00.000+02:00", "replies_count": 0, "uuid": "be2324568e1913518e8f227bdb092a36f738541f"}, "author": "", "url": "http://uk.reuters.com/video/2016/11/19/trump-says-romney-meeting-went-great?videoId=370509257", "ord_in_thread": 0, "title": "Trump says Romney meeting 'went great'", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "romney", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "bob corker", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "john bolton", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "trump national bedminster", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "bedminster", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}], "organizations": [{"name": "cabinet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump says Romney meeting 'went great' 7:53pm GMT - 01:22 \nU.S. President-elect Donald Trump told reporters his meeting with 2012 Republican presidential nominee Mitt Romney ''went great'' after the old rivals sat down for talks which could include Romney as possible secretary of state. Rough Cut (no reporter narration). ▲ Hide Transcript ▶ View Transcript \nSTORY: President-elect Donald Trump and 2012 Republican presidential nominee Mitt Romney set aside their long-simmering rivalry on Saturday (November 19) and sat down for talks that could include whether Romney should serve as Trump's secretary of state. Romney shook hands with Trump as he left the president-elect's golf resort in Bedminster, New Jersey. When a reporter shouted \"was it a productive meeting?\" Trump replied, \"went great.\" We had \"a very thorough and in-depth discussion in the time we had,\" Romney told reporters. \"I look forward to the coming administration and the things it's going to be doing.\" Romney was the first in a long list of people Trump was meeting on Saturday and Sunday as he seeks to fill out his Cabinet and seek advice ahead of his Jan. 20 move to the White House. As a leader of the establishment Republican \"never Trump\" movement, Romney had sought in vain to derail Trump's march to the Republican presidential nomination. Back in March, he delivered a biting speech saying Trump would be dangerous as president, with policies that could throw the United States into a recession. He had also said, \"I'm afraid that when it comes to foreign policy he is very, very not smart.\" For his part, Trump had denounced Romney as a \"choke artist\" for losing the 2012 election to President Barack Obama. But with Trump now the president-in-waiting, Romney's appearance at Trump National Bedminster on an unseasonably warm November day was symbolic of hard-won party unity. Whether it will lead to Romney joining the Trump administration is unclear. Trump has been considering former New York Mayor Rudy Giuliani, a close adviser, for secretary of state, as well as former U.S. ambassador to the United States John Bolton and U.S. Senator Bob Corker of Tennessee. Trump transition officials said his meeting with Romney was supposed to be a general discussion about the incoming Trump administration. A Romney confidant said of Romney's secretary of state prospects: \"Could it happen? I suppose. But it's unlikely.\" Instead, the source said the meeting gives \"the good housekeeping seal of approval to Republicans who don't know if they should help Trump or not.\" Press CTRL+C (Windows), CMD+C (Mac), or long-press the URL below on your mobile device to copy the code http://reut.rs/2gqMFkU", "external_links": [], "published": "2016-11-20T02:53:00.000+02:00", "crawled": "2016-11-19T22:29:02.046+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}