{"organizations": [], "uuid": "623ba2e2d54ada32d4ded55729b227183ba27686", "thread": {"site_full": "www.ew.com", "main_image": "http://www.ew.com/sites/default/files/styles/tout_image_612x380/public/i/2016/11/18/vd108a_0847b_1.jpg?itok=uD98JoZq", "site_section": "", "section_title": "", "url": "http://www.ew.com/article/2016/11/18/vampire-diaries-sara-canning-aunt-jenna", "country": "US", "domain_rank": 820, "title": "Vampire Diaries: Sara Canning remembers her time as Aunt Jenna | EW.com", "performance_score": 0, "site": "ew.com", "participants_count": 0, "title_full": "Vampire Diaries: Sara Canning remembers her time as Aunt Jenna | EW.com", "spam_score": 0.66, "site_type": "news", "published": "2016-11-18T07:00:00.000+02:00", "replies_count": 0, "uuid": "623ba2e2d54ada32d4ded55729b227183ba27686"}, "author": "Samantha Highfill", "url": "http://www.ew.com/article/2016/11/18/vampire-diaries-sara-canning-aunt-jenna", "ord_in_thread": 0, "title": "Vampire Diaries: Sara Canning remembers her time as Aunt Jenna | EW.com", "locations": [], "entities": {"persons": [{"name": "marguerite macintyre", "sentiment": "negative"}, {"name": "sara canning", "sentiment": "negative"}, {"name": "liz forbes", "sentiment": "negative"}, {"name": "jenna", "sentiment": "none"}, {"name": "jeremy", "sentiment": "none"}, {"name": "elena", "sentiment": "none"}, {"name": "alaric", "sentiment": "none"}, {"name": "salvatore", "sentiment": "none"}, {"name": "mason", "sentiment": "none"}], "locations": [{"name": "u.s.", "sentiment": "none"}, {"name": "atlanta", "sentiment": "none"}, {"name": "mystic falls", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "'Vampire Diaries': Marguerite MacIntyre remembers Liz Forbes \nWith one season left in The Vampire Diaries’ run, we decided it was time to start collecting everyone’s final diary entries. Every week during the final season, EW is asking those involved with the show to look back on one of their favorite moments from the series. So grab your tissues and join us on this trip down a vampire-filled memory lane. \nThis week, Sara Canning remembers the great Aunt Jenna… \nThe very first thing that popped into my mind about the show would be the first episode that we shot after the pilot, because everybody had moved to Atlanta and we were excited. I look back at us as these kids who were so excited about the potential of what the show could be. It was the first pilot I ever worked on and it was the first time I’d ever been a regular on a show. It was pretty incredible to move with this amazing group of people and to get to know a new city. It was the first time I’d ever lived in the U.S. We’d take trips on the weekends and we’d always be going out to the lake. I remember that first season, particularly the first few months and shooting before the show aired, as this really wild, exciting time. It was pretty special. \nI loved the dinner party scene at the Salvatore house or the barbecue we hosted when Mason rolled back into town. I remember those being such fun days, just having a big group of us. I think we were playing Pictionary at the barbecue with Mason. I just remember those days so fondly. The cast is a group who’s so eager to laugh and prank and have a good time. I think I miss that most about the cast as an entirety — they just really want to have a good time. And they do. There’s a lot of darkness in the show so I think it’s really imperative that everybody be able to have that kind of light-hearted relationship as well. \nI also loved when Jenna had no idea about the vampires because it made for a lot of great lines. It was always fun to play that, be one of the only people still in the dark about the goings on in Mystic Falls. \nThe day I found out Jenna was going to die was a really hard day, because I still had two and a half episodes left to shoot. I was really sad. I have such a better perspective on it now than I ever could have then because I understand so much about what makes great TV and how people become invested in characters and story lines, that there needs to be a real weight sometimes in order for a story to progress and for other characters to evolve. I don’t think I could’ve even understood then how important Jenna’s death was for Elena’s character, in particular, but at the time it was really hard. \nI’ve luckily maintained a lot of really close friendships with a lot of people who worked on the show, both the cast and the crew. And the fans of this show are incredible because I still feel like a part of the show even though I haven’t been physically on the show in so long. One of the greatest compliments I’ve gotten from fans of the show is them saying, “I wish I had an aunt like Jenna.” That’s really cool. I thought she was such a great female role model for Elena and Jeremy, even though she was a little bit of a partier and she was trying to figure things out. I just loved how honest and transparent she was about everything. \nI feel very lucky to have played her. It’s really nice to see that, even though she was only really around for two seasons, I think that she had some sort of lasting impact in the sense that her death really did affect particularly Elena and Jeremy and maybe Alaric too … hopefully. It was a great lesson for me near the beginning of my career about television and what makes exciting television. I feel really grateful for the kindness people have shown me and the outrage that people still express to me about her death. I feel really proud of them. Eight seasons is an incredible feat and I’m very happy to be a part of the family. \nThe Vampire Diaries airs Fridays at 8 p.m. ET on The CW. ", "external_links": [], "published": "2016-11-18T07:00:00.000+02:00", "crawled": "2016-11-19T12:17:59.745+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}