{"organizations": [], "uuid": "6ac6beba1fc322b5fd74b9ee9ee12b819231c3da", "thread": {"site_full": "www.nytimes.com", "main_image": "https://static01.nyt.com/images/2016/11/20/business/20STRA/20STRA-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Dealbook.xml", "section_title": "NYT > DealBook", "url": "http://www.nytimes.com/2016/11/20/your-money/its-not-just-the-white-house-change-is-in-the-air-on-wall-st-too.html", "country": "US", "domain_rank": 98, "title": "Strategies: It’s Not Just the White House. Change Is in the Air on Wall St., Too", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Strategies: It’s Not Just the White House. Change Is in the Air on Wall St., Too", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T00:04:00.000+02:00", "replies_count": 0, "uuid": "6ac6beba1fc322b5fd74b9ee9ee12b819231c3da"}, "author": "JEFF SOMMER", "url": "http://www.nytimes.com/2016/11/20/your-money/its-not-just-the-white-house-change-is-in-the-air-on-wall-st-too.html", "ord_in_thread": 0, "title": "Strategies: It’s Not Just the White House. Change Is in the Air on Wall St., Too", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "none"}, {"name": "paulsen", "sentiment": "none"}, {"name": "mazza", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "larry puglia", "sentiment": "none"}, {"name": "janet l. yellen", "sentiment": "none"}, {"name": "puglia", "sentiment": "none"}], "locations": [{"name": "white house", "sentiment": "none"}, {"name": "wall st.", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "goldman sachs", "sentiment": "none"}, {"name": "bank of america", "sentiment": "none"}, {"name": "nextera energy", "sentiment": "none"}, {"name": "fed", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "t. rowe price", "sentiment": "none"}, {"name": "morgan stanley", "sentiment": "none"}, {"name": "e.t.f.", "sentiment": "none"}, {"name": "firstenergy", "sentiment": "none"}, {"name": "jpmorgan chase", "sentiment": "none"}, {"name": "entergy", "sentiment": "none"}, {"name": "federal reserve", "sentiment": "none"}, {"name": "exelon", "sentiment": "none"}, {"name": "spdr fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Continue reading the main story Yet it is possible that the election could be remembered as a pivotal moment in the markets, and in politics — and not just because a new Republican-controlled government is likely to enact some very different policies. It is at least arguable that the election has given the markets the impetus, and the excuse, to solidify deeper trends that were already underway. \nAdvertisement Continue reading the main story “The election shock has accelerated some changes that were already beginning to be evident — in a much smaller way,” Mr. Paulsen said. “I think that some of those trends are likely to stick.” There is no denying that the election’s outcome took the markets by surprise. The overwhelming assumption in financial circles, and in the polls, was that Hillary Clinton would win and that Mr. Trump would lose. The further expectation was that in the unlikely event of a Trump victory, there would be a major stock market decline. But that occurred for only several hours, and then there was a powerful stock market rally, which has slowed but not stopped. That’s only part of the story. A revaluation of a wide range of assets and securities has been taking place. Recent stars have faded, in the market’s transitory judgment. New investments are in vogue. Traders have been voting with their dollars. Using State Street sector exchange-traded funds as a proxy for the broader market, Mr. Mazza reported unusually high inflows into the sector E.T.F.s for financial services, health care and industrials, and lesser inflows into materials and energy stocks. Traders stampeded away from utilities, technology and consumer staples shares. They were neutral or slightly negative about consumer discretionary and real estate shares. Take financial stocks and utilities. Until recently, investors shunned banks while celebrating utilities for their steady-Eddie dividend payouts. That shifted radically. In the five days after the election, JPMorgan Chase, Goldman Sachs, Morgan Stanley and Bank of America gained at least 13 percent. Four leading utilities — Exelon, FirstEnergy, NextEra Energy and Entergy — lost at least 4 percent. Before the election, utility shares were ahead of financials for the year. Five days later, they were trailing. The nearly $5 billion inflow into the Financial Select Sector SPDR Fund, for example, was the biggest of any week since the E.T.F.’s inception in 1998, Mr. Mazza said. Such cash flows generally correlate with market price trends. The biggest weekly outflow was $3.5 billion, and it occurred in the week of Jan. 28, 2008, during the financial crisis. Investors found bank stocks as scary as they now find them attractive. Utilities, on the other hand, moved on election week to the avoidance list, with net outflows of $455 million in the Utilities Select Sector SPDR Fund, Mr. Mazza said. \nAdvertisement Continue reading the main story While traders may have shifted gears hastily, there is at least a rational basis for their movements. The problem lies in the assumptions behind these market shifts. Predictions about politics are risky. Those based on underlying economics may be a bit more reliable. For example, the bond market shift appears at least partly based on a judgment that inflation will rise because of Mr. Trump’s policies, inchoate though they may be. He has called for tax cuts and spending increases in the nation’s infrastructure and military. That could be inflationary if they widen a budget deficit. But conservatives in Congress may not go along with an increase in deficit spending. It’s not clear what the Trump administration will try to accomplish. All of these assumptions may not be borne out in fact. Similarly, technology shares have fallen sharply, at least partly out of concern for the possibly negative effects of some of Mr. Trump’s policies, said Larry Puglia, a portfolio manager for T. Rowe Price. It is possible, he said, that Mr. Trump’s approach to immigration will make it more difficult for highly skilled foreigners to receive visas for work at American tech companies, or that his trade policies will make the logistics of global tech manufacturing more cumbersome and expensive. People “shouldn’t jump to conclusions,” Mr. Puglia said. “We don’t know what will happen.” He said he had made few changes to his investment portfolios, preferring to wait and see. On the other hand, some sea changes may be underway in the economy, Mr. Paulsen said. The election could be giving traders an excuse to act on them. Recent data indicates that economic growth has been accelerating. The election aside, he said, it makes sense that bond yields will rise under these circumstances and that the Federal Reserve will increase short-term interest rates. Janet L. Yellen, the Fed chairwoman, says a rate increase is “relatively likely” to occur soon, perhaps at the central bank’s next meeting in December. Rising interest rates generally help bank stocks and hurt utilities, whose dividends no longer seem as appealing. Furthermore, rising rates support a stronger dollar, justifying a decline in the price of gold, which has been out of favor since the election. In addition, the labor market has been improving for a long time, the American economy is in better shape than it was a year or two ago, and it’s reasonable for investors to be more aggressive, Mr. Paulsen said. Still, the risk of geopolitical or domestic shocks is real, he acknowledged, and traders are only making educated guesses. If they turn out to be wrong, the market could turn upside down again. \nAdvertisement Continue reading the main story For most long-term investors, that is an argument for broad diversification. Despite the turmoil in the markets, simple balanced portfolios of stocks and bonds have barely moved since the election. In a period of extreme swerves and shifts, that may count as an achievement. \nTwitter: @jeffsommer A version of this article appears in print on November 20, 2016, on page BU6 of the New York edition with the headline: It’s Not Just the White House. Change Is in the Air on Wall St., Too. Order Reprints | Today's Paper | Subscribe", "external_links": [], "published": "2016-11-20T00:04:00.000+02:00", "crawled": "2016-11-19T19:13:02.856+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}