{"organizations": [], "uuid": "75ec612bf4f8a07a9aa469d30339a6d261ba5c2c", "thread": {"site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/yBk8m5SmzOdeas6kpsD0eQ--/aD02ODI7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/1208edb13373278eafb9ec0c499549cfc86ca337.jpg", "site_section": "http://news.yahoo.com/rss/world", "section_title": "World News Headlines - Yahoo News", "url": "https://www.yahoo.com/news/maduro-opposition-dont-ultimatums-234029909.html?ref=gs", "country": "US", "domain_rank": 5, "title": "Maduro to opposition: 'Don't give me ultimatums'", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Maduro to opposition: 'Don't give me ultimatums'", "spam_score": 0.0, "site_type": "news", "published": "2016-11-04T02:00:00.000+02:00", "replies_count": 0, "uuid": "75ec612bf4f8a07a9aa469d30339a6d261ba5c2c"}, "author": "", "url": "https://www.yahoo.com/news/maduro-opposition-dont-ultimatums-234029909.html?ref=gs", "ord_in_thread": 0, "title": "Maduro to opposition: 'Don't give me ultimatums'", "locations": [], "entities": {"persons": [{"name": "maduro", "sentiment": "negative"}, {"name": "nicolas maduro", "sentiment": "none"}, {"name": "carlos ocariz", "sentiment": "none"}], "locations": [{"name": "venezuela", "sentiment": "none"}, {"name": "caracas", "sentiment": "none"}], "organizations": [{"name": "afp", "sentiment": "negative"}, {"name": "democratic unity roundtable", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Caracas (AFP) - Tensions fraying a fragile political truce in Venezuela escalated on Thursday, as President Nicolas Maduro warned his opponents not to issue ultimatums on holding elections and accused them of lying. Adding a nail to the coffin of a short-lived detente declared this week, the embattled leftist lashed out at political enemies trying to drive him from power and downplayed expectations for Vatican-mediated talks.\nHe made the comments as thousands of his supporters rallied outside the presidential palace, in what the opposition called a violation of their mutual agreement to tone down their rhetoric and suspend protests and demos.\nMaduro took issue with opposition leaders' statements that their goal for the upcoming talks -- set for November 11 -- was an agreement to hold elections early next year, well ahead of the scheduled end of his term in 2019.\n\"There can be no ultimatums. Nobody can issue an ultimatum. Everything in its time,\" Maduro said in a national address.\n\"I want to alert you all, especially the opposition's supporters: They are lying to you again.\"\nEarlier, top opposition figure Carlos Ocariz had said the opposition wanted new polls \"in the first quarter of 2017.\"\n\"It has to be as soon as possible,\" he said.\nThe strategy of holding talks has deeply divided the main opposition coalition, the Democratic Unity Roundtable (MUD).\nSixteen of its 30-odd parties are refusing to take part.\nSome opposition supporters are disillusioned with the decision, and political analysts have warned it may simply play into Maduro's hands by buying him more time.\nExasperated with a three-year recession, soaring inflation, shortages, looting and violence, three in four Venezuelans are dissatisfied with Maduro, according to polls.\nBut the MUD, a fractious coalition united mainly by shared hatred of the leftist leader, is struggling to deliver on its promise to oust Maduro before his term ends in 2019.\nElectoral authorities have halted the opposition's efforts to call a referendum on removing him from power, alleging fraud -- and ratcheting up the crisis gripping Venezuela to a new level.\nOil giant Venezuela has gone into economic tailspin as crude prices have plunged since mid-2014.\nThe economy is now in its third year of a deep recession.", "external_links": [], "published": "2016-11-04T02:00:00.000+02:00", "crawled": "2016-11-04T02:22:57.465+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}