{"organizations": [], "uuid": "3b3e89431334b0b1d9be827d55eeace8a61c89f9", "thread": {"site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/vLzxgBlfALAOuIMkiSD_3w--/aD02NzM7dz0xMDI0O3NtPTE7YXBwaWQ9eXRhY2h5b24-/http://media.zenfs.com/en_us/News/afp.com/dc5137400eb26b2e90cbac5ead0d323446b8b7a9.jpg", "site_section": "http://news.yahoo.com/rss/world", "section_title": "World News Headlines - Yahoo News", "url": "https://www.yahoo.com/news/safety-pins-pointed-show-solidarity-trump-election-021956385.html?ref=gs", "country": "US", "domain_rank": 5, "title": "Safety pins: a pointed show of solidarity after Trump election", "performance_score": 1, "site": "yahoo.com", "participants_count": 1, "title_full": "Safety pins: a pointed show of solidarity after Trump election", "spam_score": 0.0, "site_type": "news", "published": "2016-11-13T02:00:00.000+02:00", "replies_count": 0, "uuid": "3b3e89431334b0b1d9be827d55eeace8a61c89f9"}, "author": "rian Knowlton", "url": "https://www.yahoo.com/news/safety-pins-pointed-show-solidarity-trump-election-021956385.html?ref=gs", "ord_in_thread": 0, "title": "Safety pins: a pointed show of solidarity after Trump election", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "debra messing", "sentiment": "none"}, {"name": "heather pereira", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}], "locations": [{"name": "washington", "sentiment": "none"}, {"name": "atlantic", "sentiment": "none"}, {"name": "britain", "sentiment": "none"}, {"name": "portugal", "sentiment": "none"}, {"name": "manhattan", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "trump tower", "sentiment": "none"}, {"name": "ukraine", "sentiment": "none"}, {"name": "brexit", "sentiment": "none"}, {"name": "chicago", "sentiment": "none"}], "organizations": [{"name": "splc", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "southern poverty law center", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Washington (AFP) - People have long used ribbons, flowers, colors or badges to symbolize political causes, from the carnations of Portugal's 1974 revolution to the orange ribbons of Ukraine's 2004 revolution to the gel wristbands now worn to promote almost any charity. Enter the lowly safety pin.\nThat humble but practical device is fast gaining a higher profile, as growing numbers of Americans wear the metal fasteners to show solidarity against intolerance after the election of Donald Trump.\nThe safety pin -- invented in 1849 by an American mechanic who needed money to pay off a $15 debt -- uses a cleverly designed clasp to protect users from its fiendishly sharp tip.\nAnd that is the point.\nIn the days since Trump's election, people have begun placing a single pin on their shirts to convey a message of support -- of safety, and protection -- to minorities, women, immigrants and others who may feel threatened by the strident rhetoric that carried the Republican billionaire to the White House.\nThe safety pin social media movement gained prominence in Britain on Twitter as a sign of solidarity with immigrant and minority populations facing a reported surge in hate crimes after the Brexit vote in June, with its strong anti-immigrant undertones.\nSince the US election, the phenomenon has started catching on across the Atlantic, with celebrities including actress Debra Messing as well as ordinary people posting images of their safety pins on social media.\nTrump, during a bitter two-year campaign that tugged at America's democratic fabric, pledged to deport illegal immigrants and ban Muslims, and called Mexicans rapists and drug runners, claims which have created fears of xenophobia -- and potentially of mass deportations -- now that he has been elected to office.\nSince Trump's upset win there has been a reported uptick in reports of racist and xenophobic incidents, fueling fears for the period ahead.\n- 'I stand beside you' -\nActivists were handing out the symbolic pins in Manhattan Saturday as thousands of protesters converged on Trump Tower where the president-elect has been huddled with advisors plotting his next move.\nIn Chicago, too, many among the thousands who marched against Trump this weekend wore a pin on their chest.\n\"I just want people to know, that are in the minorities, that we aren't going to let his hate divide us,\" summed up 23-year-old Heather Pereira, marching with her four-year-old daughter in a stroller.\n\"I don't believe what Trump stands for. He built a platform on hating others. And I won't accept that.\"\nThe Southern Poverty Law Center, which monitors hate groups, tracked more than 200 incidents of election-related harassment and intimidation in the three days following the election.\nOne message on social media suggested wearing a safety pin to \"show that immigrants, refugees and anyone else threatened by the hate and fear mongering of Trump and many of his supporters can know that I care and will do all that I can to combat xenophobia, racism, sexism\" and discrimination against the disabled.\nAnother post simply shows a picture of a safety pin with the words: \"You are safe with me. I stand beside you.\"\nMore than 47,000 people have signed an SPLC petition urging Trump to clearly distance himself from the \"haters\" -- from white nationalists to anti-Muslim and anti-gay extremists -- who are celebrating his victory.\nHe has yet to do so.", "external_links": [], "published": "2016-11-13T02:00:00.000+02:00", "crawled": "2016-11-13T05:04:46.274+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 159, "shares": 159, "comments": 0}, "stumbledupon": {"shares": 0}}}