{"organizations": [], "uuid": "509d3ebce405fde1f861ff0c6d72c1533dc05ecc", "thread": {"site_full": "www.nydailynews.com", "main_image": "http://assets.nydailynews.com/polopoly_fs/1.2880251.1479584771!/img/httpImage/image.jpg_gen/derivatives/landscape_1200/mets-expos.jpg", "site_section": "http://www.nydailynews.com/sports/hockey/devils/index_rss.xml", "section_title": "NYDN Rss Article only", "url": "http://www.nydailynews.com/sports/baseball/tim-raines-steal-spot-hall-final-year-ballot-article-1.2880249", "country": "US", "domain_rank": 811, "title": "Can Tim Raines steal a spot in the Hall in final year on ballot?", "performance_score": 0, "site": "nydailynews.com", "participants_count": 1, "title_full": "Can Tim Raines steal a spot in the Hall in final year on ballot?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:48:00.000+02:00", "replies_count": 0, "uuid": "509d3ebce405fde1f861ff0c6d72c1533dc05ecc"}, "author": "Anthony Mccarron", "url": "http://www.nydailynews.com/sports/baseball/tim-raines-steal-spot-hall-final-year-ballot-article-1.2880249", "ord_in_thread": 0, "title": "Can Tim Raines steal a spot in the Hall in final year on ballot?", "locations": [], "entities": {"persons": [{"name": "tim raines", "sentiment": "positive"}, {"name": "rickey henderson", "sentiment": "none"}, {"name": "bill chastain", "sentiment": "none"}, {"name": "david cone", "sentiment": "none"}, {"name": "timmy", "sentiment": "none"}, {"name": "manny ramirez", "sentiment": "none"}, {"name": "justin verlander", "sentiment": "none"}, {"name": "joe torre", "sentiment": "none"}, {"name": "vladimir guerrero", "sentiment": "none"}, {"name": "mark feinsand", "sentiment": "none"}, {"name": "santiago casilla", "sentiment": "none"}, {"name": "shaun best/reuters", "sentiment": "none"}, {"name": "cone", "sentiment": "none"}, {"name": "jeff bagwell", "sentiment": "none"}, {"name": "casilla", "sentiment": "none"}, {"name": "o’connell", "sentiment": "none"}, {"name": "robb nen", "sentiment": "none"}, {"name": "jack o’connell", "sentiment": "none"}, {"name": "pudge rodriguez", "sentiment": "none"}, {"name": "raines", "sentiment": "none"}, {"name": "rickey", "sentiment": "none"}, {"name": "alan trammell", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "montreal", "sentiment": "none"}, {"name": "cooperstown", "sentiment": "none"}, {"name": "tampa bay", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}], "organizations": [{"name": "hall of fame", "sentiment": "positive"}, {"name": "daily news", "sentiment": "none"}, {"name": "al cy young", "sentiment": "none"}, {"name": "giants", "sentiment": "none"}, {"name": "giant", "sentiment": "none"}, {"name": "mets", "sentiment": "none"}, {"name": "yanks", "sentiment": "none"}, {"name": "yankee", "sentiment": "none"}, {"name": "mlb", "sentiment": "none"}, {"name": "cubs", "sentiment": "none"}, {"name": "yankees", "sentiment": "none"}, {"name": "nl", "sentiment": "none"}, {"name": "baseball writers association of america", "sentiment": "none"}, {"name": "bbwaa", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Can Tim Raines steal a spot in the Hall of Fame in final year on ballot? Can Tim Raines steal a spot in the Hall in final year on ballot? Tim Raines deserves a tip of the cap for being one of MLB’s best leadoff hitters, and he also warrants a spot in the Hall of Fame, though the former Yankee is entering his final year on the ballot. (MARCOS TOWNSEND/AP) NEW YORK DAILY NEWS Updated: Saturday,  48 PM \nIf you thought there was a lot of yelling and a ton of hot takes over writers voting for baseball awards during the past week, well, get ready for Hall of Fame season. That’s when the real carping begins. \nIt will be particularly interesting to track the candidacy of Tim Raines, the leadoff man extraordinaire who is in his 10th and final year on the ballot and is sure to spark spirited dialogue. He has a passionate support base that lauds, among other skills, his ability to get on base. Raines, who starred for the Expos in the 80s and played for 23 seasons, has a career on-base percentage of .385 and is one of the great base stealers of all time. \nHe can count on this voter checking his name. Ballots are slated to be mailed this Tuesday and members of the Baseball Writers Association of America must submit their votes by Dec. 31. The Class of 2017 will be announced Jan. 18. \nHave at it, any of you who think Raines falls short. But it says here that Raines was one of the game’s most destructive forces in his day and him transitioning into part-time play later in his career does not warrant keeping him out of Cooperstown. Nor does his admission of cocaine use. \nSome of the men who had to deal with him during his playing days make a compelling case for Raines, who was successful on 84.7% of his steal attempts, second-best among players with at least 300 attempts. That’s higher even than Rickey Henderson (80.76%), by the way. Probably doesn’t help Raines’ case that he played in the same era as the greatest leadoff hitter ever, but that shouldn’t be held against him, either. Tim Raines waves to the crowd after stealing his 800th career base in 1998. (SHAUN BEST/REUTERS) \n“I’m a big fan of Tim Raines,” says David Cone, who pitched against Raines and then played with him with the Yankees. “I think he got overlooked and I think he should be in.” \nIn terms of leadoff hitters, “There was Rickey Henderson and there was Tim Raines,” Cone adds. “Rickey’s maybe the best leadoff hitter of all time, but Tim Raines was right there.” \nAdds Joe Torre, who managed Raines with the Yanks and managed against him in the National League: “Timmy was it, as far as how many threats he had — he’d hit a home run when you’d least expect it, too…He was quite an imposing figure. He’d scare you.” \nRaines was a seven-time All-Star and got MVP votes in seven different years (he finished fifth in 1983). He has four stolen-base crowns and is fifth all-time with 808 steals. Oh, and he helped the Yankees win the World Series in 1996 and 1998. \nTo get a snapshot of how voters view Raines, the Daily News asked one “Yes” voter and one “No” voter for their thoughts on “Rock,” which they gave on condition of anonymity. \nYes voter: “He was one of the most dynamic, exciting players in the game for the first seven or eight years. His numbers and the ‘eyeball test’ have added up for me and I’ve voted for him starting with his second year (on the ballot).” \nNo voter: “His numbers after age 30 fall below Hall of Fame standard. He was a part-timer though a valuable one, for a large part of his career after 30. Steals were an inflated stat in his era. Excellent career, short of the Hall of Fame. I don’t care about the drug past. Irrelevant.” \nRaines has some late momentum, going from 46.1% of the vote in 2014 to 55% in ’15 to 69.8% last year. A player needs 75% of the ballots cast to gain election. \nThis could be the year for Raines. Many players experience a boost in their final year on the ballot — Alan Trammell did not get in last year, but he jumped from 25.1% to 40.9% last year in his last shot. Jeff Bagwell got 71.6% of the vote last year and ballot newcomers Vladimir Guerrero, Pudge Rodriguez and Manny Ramirez will get plenty of attention. \nBut it’s Raines’ last chance. “It’s hard to say why he’s not already in,” Cone says. “Maybe the years in Montreal, he wasn’t in the limelight so much. By the time he got to the Yankees, he was more of a role player. But his numbers speak for themselves and they are Hall-worthy.” \nEARLY VOTING \nControversy over the awards voting sprang up last week when two Tampa Bay writers did not put Justin Verlander in their top 5 for the AL Cy Young. One, Bill Chastain of MLB.com, told The News’ Mark Feinsand that he had submitted his ballot with about a week left in the season. Since votes are due prior to the first pitch of the first Wild Card game, that seemed odd and it prompted us to ask Jack O’Connell, the secretary-treasurer of the BBWAA, if voters routinely send in their ballots early. “Has it happened? Yes,” O’Connell says. “It’s unusual. The earliest ballots I get are four or five games before the end of the season. It’s usually a handful of Manager of the Year ballots, if it’s not a tight race, though it’s happened less with the two wild-card berths.” One voter said he’d never sent in his ballot early: “Always waited till the last out on the last day.” That sounds like the best policy. Voting procedures often are topics at the BBWAA meeting at baseball winter meetings next month. It’s a good bet to come up again this time. \nWHAT A RELIEF? \nHere’s a name to keep in mind as the Mets hunt for ways to upgrade a bullpen that probably needed help even before there was a possible domestic-violence suspension looming for closer Jeurys Familia: Santiago Casilla. \nA rival baseball executive brought up Casilla when asked about relievers who might beef up one of the Mets’ needy areas. Casilla, a 36-year-old righty, was the Giants’ closer much of last year and had 31 saves but he lost the gig and had a terrible September. His nine blown saves were the most by a Giant since Robb Nen had nine in 1999. He also sat in the bullpen as the Giants used five other pitchers to face seven Cubs in San Francisco’s Game 4 meltdown that knocked them out of their NL division series. Ouch. \nNot a great resume for a job, sure, but, the exec pointed out, “He could be a good setup guy. He could come for a decent value.” A talent evaluator who saw Casilla toward the end of the season said his velocity was around 93, which is what he averaged in 2015-16. “He was the same guy,” the evaluator said. Perhaps Casilla, who averaged 10.1 strikeouts per nine innings and allowed 50 hits in 58 frames last year, is a bounce-back candidate who could help the Mets.  ", "external_links": [], "published": "2016-11-20T02:48:00.000+02:00", "crawled": "2016-11-19T22:11:42.736+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}