{"organizations": [], "uuid": "ad1f482cd378f138bcaf4fb35919e33240dfa31f", "thread": {"site_full": "newsinfo.inquirer.net", "main_image": "http://newsinfo.inquirer.net/files/2016/11/Trump-International-Hotel-facade-sign-620x413.jpg", "site_section": "https://inq-newsinfo.disqus.com/comments.rss", "section_title": "Inquirer News - Latest Comments", "url": "http://newsinfo.inquirer.net/849515/trump-says-hes-stepping-out-of-his-business-empire", "country": "US", "domain_rank": 813, "title": "Re: Trump says he’s stepping out of his business empire", "performance_score": 0, "site": "inquirer.net", "participants_count": 1, "title_full": "Re: Trump says he’s stepping out of his business empire", "spam_score": 0.0, "site_type": "news", "published": "2016-11-30T16:09:00.000+02:00", "replies_count": 0, "uuid": "ad1f482cd378f138bcaf4fb35919e33240dfa31f"}, "author": "David Luna", "url": "http://newsinfo.inquirer.net/849515/trump-says-hes-stepping-out-of-his-business-empire", "ord_in_thread": 0, "title": "Re: Trump says he’s stepping out of his business empire", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ivanka", "sentiment": "none"}, {"name": "joe", "sentiment": "none"}, {"name": "ross", "sentiment": "none"}, {"name": "pablo martinez", "sentiment": "none"}, {"name": "steven mnuchin", "sentiment": "none"}, {"name": "wilbur ross", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "reince priebus", "sentiment": "none"}, {"name": "donald jr.", "sentiment": "none"}, {"name": "priebus", "sentiment": "none"}, {"name": "mnuchin", "sentiment": "none"}], "locations": [{"name": "south america", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "middle east", "sentiment": "none"}, {"name": "india", "sentiment": "none"}], "organizations": [{"name": "associated press", "sentiment": "negative"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "msnbc", "sentiment": "none"}, {"name": "senate", "sentiment": "none"}, {"name": "cnbc", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "trump international hotel", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Trump says he’s stepping out of his business empire Associated Press / 08:57   This file photo (taken on Monday, Sept. 12, 2016) shows the exterior of the Trump International Hotel in downtown Washington. Experts on government ethics are warning President-elect Donald Trump that he’ll never shake suspicions of a clash between his private interests and the public good if he doesn’t sell off his vast holdings, which include roughly 500 companies in more than a dozen countries. They say just the appearance of conflicts is likely to tie up the new administration in investigations, lawsuits and squabbles. Photo by PABLO MARTINEZ MONSIVAIS/AP \nWASHINGTON — President-elect Donald Trump said Wednesday that he’s leaving his business empire to focus on being the nation’s 45th president, bowing to pressure to avoid potential conflicts of interest between governing and profiting in the private sector. \n“I will be leaving my great business in total in order to fully focus on running the country in order to make America great again,” he tweeted in a series of missives sent before dawn. “While I am not mandated to do this under the law, I feel it is visually important, as president, to in no way have a conflict of interest with my various businesses.” \nHe said legal documents are “being crafted which take me completely out of business operations,” he added, saying the presidency is “a far more important task!” ADVERTISEMENT \nMeanwhile, former Goldman Sachs executive Steven Mnuchin, Trump’s former campaign finance director, confirmed that Trump has picked him as treasury secretary and that billionaire investor Wilbur Ross has been chosen for commerce secretary. \nMnuchin, 53, led Trump’s finance operations during the presidential campaign. But he has no government experience, which could prove a political hurdle. If confirmed by the Senate, Mnuchin would play a central role in shaping Trump’s tax policies and infrastructure plans. He would also lead an agency tasked with implementing international economic sanctions. \nTrump has previously said that he’d leave his business operations to his three eldest children — Donald Jr., Eric and Ivanka, though that wasn’t clear from his tweets Wednesday. \nReince Priebus, Trump’s incoming White House chief of staff, said Wednesday “that’ll all be worked out.” \nPriebus told MSNBC’s Morning Joe , that Trump has “got the best people in America working on it.” Priebus demurred when asked if Trump planned to put his businesses in a blind trust — as presidents have traditionally done — or leave them in his children’s hands. \n“I’m not ready to reveal that really,” Priebus said. \nPriebus added that Trump’s business acumen and the many business interests he has as a result of it is “nothing to be ashamed about.” He said Trump is “taking seriously” the issue of possible conflicts of interest. \n“We’re making sure that all those conflicts are taken care of,” Priebus said. He said the applicable rules and regulations “are very vague” and that’s Trump’s people are “doing the best job we can.” \nPriebus said the country hasn’t seen a president of such business acumen before and that the rules and regulations “don’t contemplate this scenario.” \nMnuchin, meanwhile, told CNBC on Wednesday that he and Ross are “thrilled to work for the president-elect and honored to have these positions.” He said “sustained economic growth” is the chief priority of the incoming administration and that “we can absolutely get to sustained 3 to 4 percent” in the gross domestic product. \nHe also outlined what he called “the largest tax change” since President Ronald Reagan — cutting the corporate tax rate to 15 percent, a “big” middle-class income tax cut and simplifying taxes. \n“By cutting corporate taxes, we’re going to create huge economic growth and we’ll have huge personal income,” Mnuchin told CNBC’s Squawk Box . \nNo previous commander in chief has brought with him such a sprawling business empire with so much complexity, opaqueness and opportunity for self-dealing as Trump. \nTrump owns golf clubs, office towers and other properties in several countries. He holds ownership stakes in more than 500 companies. He has struck licensing deals for use of his name on hotels and other buildings around the world and has been landing new business in the Middle East, India and South America.", "external_links": [], "published": "2016-11-30T16:09:00.000+02:00", "crawled": "2016-11-30T16:13:33.175+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}