{"organizations": [], "uuid": "223cec4a386687d8d67556086f018dd23a2cc027", "thread": {"site_full": "memory-alpha.wikia.com", "main_image": "http://vignette4.wikia.nocookie.net/memoryalpha/images/4/44/Neelix%2C_2378.jpg/revision/latest?cb=20070518052022&amp;path-prefix=en", "site_section": "http://en.memory-alpha.org/wiki/Special:RecentChanges?feed=atom", "section_title": "Memory Alpha  - Recent changes [en]", "url": "http://memory-alpha.wikia.com/wiki/Neelix", "country": "US", "domain_rank": 114, "title": "Neelix", "performance_score": 0, "site": "wikia.com", "participants_count": 1, "title_full": "Neelix", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:59:00.000+02:00", "replies_count": 0, "uuid": "223cec4a386687d8d67556086f018dd23a2cc027"}, "author": "Capricorn", "url": "http://memory-alpha.wikia.com/wiki/Neelix", "ord_in_thread": 0, "title": "Neelix", "locations": [], "entities": {"persons": [{"name": "neelix", "sentiment": "negative"}, {"name": "hirogen", "sentiment": "none"}, {"name": "voyager", "sentiment": "none"}, {"name": "trabe", "sentiment": "none"}, {"name": "joleg", "sentiment": "none"}, {"name": "kes", "sentiment": "none"}, {"name": "kazon", "sentiment": "none"}, {"name": "talli", "sentiment": "none"}, {"name": "tuvok", "sentiment": "none"}, {"name": "jetrel", "sentiment": "none"}, {"name": "janeway", "sentiment": "none"}, {"name": "ma'bor jetrel", "sentiment": "none"}, {"name": "tuvix", "sentiment": "none"}, {"name": "alixia", "sentiment": "none"}, {"name": "tomin", "sentiment": "none"}, {"name": "malon", "sentiment": "none"}, {"name": "culluh", "sentiment": "none"}, {"name": "mari", "sentiment": "none"}, {"name": "mabus", "sentiment": "none"}, {"name": "tieran", "sentiment": "none"}, {"name": "michael jonas", "sentiment": "none"}, {"name": "maje culluh", "sentiment": "none"}, {"name": "chakotay", "sentiment": "none"}, {"name": "b'elanna", "sentiment": "none"}, {"name": "borg", "sentiment": "none"}, {"name": "rinax", "sentiment": "none"}, {"name": "gar", "sentiment": "none"}, {"name": "jonas", "sentiment": "none"}, {"name": "nezu", "sentiment": "none"}, {"name": "kathryn janeway", "sentiment": "none"}, {"name": "tom paris", "sentiment": "none"}, {"name": "brax", "sentiment": "none"}, {"name": "wixiban", "sentiment": "none"}, {"name": "ocampa", "sentiment": "none"}, {"name": "harry kim", "sentiment": "none"}], "locations": [{"name": "alpha quadrant", "sentiment": "none"}, {"name": "prixin", "sentiment": "none"}, {"name": "kazon", "sentiment": "none"}, {"name": "delta quadrant", "sentiment": "none"}, {"name": "paris", "sentiment": "none"}, {"name": "ilari", "sentiment": "none"}, {"name": "great forest", "sentiment": "none"}, {"name": "tuvok", "sentiment": "none"}, {"name": "seska", "sentiment": "none"}, {"name": "rinax", "sentiment": "none"}, {"name": "kazon-nistrim", "sentiment": "none"}], "organizations": [{"name": "neelix edit  aboard voyager", "sentiment": "neutral"}, {"name": "kazon edit  neelix", "sentiment": "none"}, {"name": "metreon", "sentiment": "none"}, {"name": "neelix", "sentiment": "none"}, {"name": "seven of nine", "sentiment": "none"}, {"name": "starfleet", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Edit \nAboard Voyager , Neelix served as a chef, \"Special Consultant for the Delta Quadrant\", and occasionally as a self-appointed \" chief morale officer \". Captain Kathryn Janeway gave Neelix the unofficial title of \"ambassador\" when he proved to have a flair for diplomacy. ( VOY : \" Macrocosm \") \nNeelix could be considered a \"renaissance man\" for his many duties and qualities. Although Neelix never officially had a uniform until much later in the series, he did wear clothing that was very specific to him. He wore very colorful suits that often incorporated one, two, or in the case of his chef outfit, all three, of the command colors from Starfleet uniforms . It is unclear who tailored these uniforms (although it seems logical that he would have replicated them to his specifications, or even sewn them himself, given his various other talents), or whether or not it was customary for all Talaxians to wear this style of clothing (there have been others on screen, but none of them wore this style). He also owned a fur trench-coat, which it appears other Talaxian traders did in fact wear. On away missions, Neelix occasionally wore something similar to a Starfleet uniform, but all in shades of red. Neelix on several occasions donned an operations gold Starfleet uniform. \nOn one of his first official away missions , in which he prepared for a week studying dilithium geophysics , Neelix' lungs were removed by a Vidiian weapon. There was no way to replicate new lungs for Neelix since Talaxian lungs were too complex to be replicated, because they were attached to his upper spinal column, so The Doctor was forced to replace Neelix' lungs with holographic replicas. The flaw in this plan was that Neelix would not be able to move, and would thus be forced to stay confined in an isotropic restraint until real replacement lungs were available. When the Vidiians who stole Neelix' lungs were found, they were able to devise a way for The Doctor to transplant one of Kes' lungs into Neelix. The procedure was a success. ( VOY : \" Phage \") \nWhen Commander Chakotay was comatose, he influenced Neelix to use his medicine wheel in order to plot a safe course for Voyager out of a nebula in which aliens wished to steal the crew's neural energy . ( VOY : \" Cathexis \") \nLater that year, Neelix met Ma'Bor Jetrel , the Haakonian scientist who had developed the weapon used to destroy the majority of Neelix' people, including his family. Jetrel informed Neelix that when he had evacuated people from his planet, he had been exposed to the biological weapon and might be dying from metremia . Jetrel claimed that he wanted to help cure Neelix and try to make amends. Jetrel's presence resurrected painful memories for Neelix – not only the horrors of Rinax' destruction, but his shame over dodging the Talaxian draft. Neelix hated Jetrel and questioned him about his ethics and motivations. He told Jetrel about watching Palaxia die and his hope that Jetrel would have to live with his agonizing guilt for a very long time. However, when he discovered Jetrel's experiments in sickbay , Jetrel revealed his true purpose: to try and bring back the victims of the Metreon cascade . Neelix' supposed metrimia had never existed. It was Jetrel who had the disease. His attempt to reconstruct the dead in the Metreon cloud around Rinax ultimately failed and he died of his illness not long after. However, his genuine remorse and efforts to undo his crime earned Neelix' forgiveness. ( VOY : \" Jetrel \") \nNeelix almost became a father in 2371 . Kes was affected by alien creatures that caused her to become fertile which happens just once in an Ocampa's lifetime, and if she was going to have a baby it needed to be then. Neelix was discomfited by the idea, having never given serious thought to fatherhood, but after talking through the matter with Kes and Tuvok he felt that he might like to be a parent. After the aliens were driven away, Kes decided not to have a baby, and The Doctor stated that this may have been a false alarm brought on by the aliens. Later that year, during a surprise birthday Neelix was giving for Kes, Voyager was disrupted by a spatial anomaly that seemed to change the structure of the ship. Neelix tried to find the bridge but was unsuccessful. ( VOY : \" Elogium \", \" Twisted \") The second year (2372) Edit \nNeelix also became jealous of Tom Paris , who he accused of trying to take Kes away from him. He and Paris got into a fight in the mess hall. Later, they were stranded on a hostile planet. They had to work together to save themselves. After being rescued, they returned to Voyager as friends. ( VOY : \" Parturition \") \nDuring the second year, Voyager continued its tumultuous journey through Kazon territory. Additionally, Paris decided to leave the ship after a period of malcontent and friction with Janeway and Chakotay. During this time, Neelix had started a daily broadcast, \" A Briefing with Neelix \", designed to boost morale by highlighting the good things happening on Voyager . Paris' departure upset Neelix greatly and he dedicated part of his next broadcast to defending him. Following the advice of Harry Kim , Neelix began using the program to practice some real journalism and soon found evidence that Paris has been in contact with the Kazon-Nistrim . Janeway hurried to correct him in a closed-door briefing with Tuvok and Chakotay, informing him that Paris' misbehavior was part of an investigation into the suspected espionage. Neelix continued his investigation and discovered that Michael Jonas , one of the former Maquis , was passing information to Seska . Jonas attacked Neelix and was killed when he fell into a plasma fire . Neelix stopped Jonas' sabotage and later interviewed Paris, allowing him to set the record straight for the rest of the crew. ( VOY : \" Investigations \") \nAlso in that year, a bizarre occurrence took place. While on an away mission, Tuvok and Neelix were fused into a new being due to a transporter accident with a symbiotic plant. The combined person called himself \" Tuvix \" and began an independent life. With the skills and personality of both individuals, he became a valuable member of the crew over a period of two weeks, but Tuvok and Neelix's close friends were still upset. The Doctor figured out a way to restore Tuvok and Neelix, but Tuvix refused to consent to the procedure because he enjoyed his existence. In the end, Janeway forced him to undergo the procedure. ( VOY : \" Tuvix \") The third year (2373) Edit Neelix posing as the Grand Proxy \nThe year 2373 brought many adventures to Neelix. When Voyager discovered a planet that two Ferengi , who arrived through an unstable wormhole , were exploiting, Neelix, in disguise as the Grand Proxy , tried to stop them. The plot failed and he was almost burned at the stake with the Ferengi before Voyager beamed them out. Neelix and Kes, while visiting a Nechisti shrine , were struck by an energy bolt that rendered Kes comatose. Janeway, after performing Nechisti rituals, was able to save her. ( VOY : \" False Profits \", \" Sacred Ground \") \nWhen Tieran , a despot ruler of Ilari , transferred his mind into Kes, Neelix helped save her when he attached a synaptic stimulator on her neck that drove Tieran from her mind. The incident also resulted in the end of their romantic relationship. Later, Neelix helped resolve a diplomatic snafu with the Tak Tak , a species that communicated with elaborate displays of body language, when Janeway accidentally offended them by putting her hands on her hips. He tried to help Janeway fight off the giant mutated viruses that had infected Voyager but was soon infected himself. He was cured with the rest of the crew when The Doctor developed an antigen. ( VOY : \" Warlord \", \" Macrocosm \") \nNeelix became worried that he would be dismissed from the crew when Voyager reached the Nekrit Expanse , the boundary of the space he was familiar with. He frantically tried to find a new occupation for himself, from engineering to security. When the ship stopped at a supply depot , Neelix encountered his old friend and partner-in-crime Wixiban . Wixiban claimed that he had also gone straight and asked for Neelix's help in a trade deal. Neelix agreed so that he could get a map of the Expanse as well as to repay Wixiban for going to prison in his place. However, Wixiban was actually dealing in drugs and the deal went bad when the goods were stolen and one of the criminals killed. The rest of the gang demanded more contraband in exchange for Neelix and Wixiban's lives. Neelix argued with Wixiban over digging themselves even deeper, and the situation was further complicated when Chakotay and Paris were arrested for the criminal's murder. Neelix told Janeway and the head of the station about the crime and made a deal to trap the criminals in exchange for dropping the charges. The plan succeeded, mostly, though Neelix was injured. He offered to leave the ship in disgrace, but Janeway angrily replied that he was part of the family and punished him with two weeks of hard labor instead, an outcome Neelix was quite pleased with. ( VOY : \" Fair Trade \") \nNeelix's next adventure brought him into conflict with Tuvok. Tuvok found Neelix annoying, and Neelix felt that Tuvok was condescending. Together, they went on a mission to discover why the planet Nezu was being bombarded with asteroids and to rescue a group of scientists. Their shuttle crashed on the planet. They found out from one of the scientists that the bombardment had been created by an enemy of the Nezu and that there was a traitor among them. Neelix not only rescued Tuvok, but discovered who the traitor was. He fixed the carriage that was tethered to an orbital space station so they could escape. After this, Tuvok had a new-found respect for Neelix. ( VOY : \" Rise \") The fourth year (2374) Edit \nWhile visiting the Mari , Neelix became interested in a Mari woman named Talli . He intended to ask her out and wore an overpowering cologne made of musk. Talli was killed a few days later by a woman infected with violent thoughts. Neelix was very upset and asked Tuvok to bring justice to her killer. ( VOY : \" Random Thoughts \") \nIn 2374 , Neelix was killed in a shuttle accident. Seven of Nine brought him back to life by using her nanoprobes . Although his life was saved, Neelix began to question his very existence and his religious beliefs. When a Talaxian dies, they believe they go to the afterlife in the Great Forest. There they are reunited with their relatives and guided to the afterlife. Neelix experienced none of this. He had a vision quest under the guidance of Chakotay , and met his sister Alixia , who told him the afterlife is a lie and his life is worthless. When he had awakened, he decided to kill himself. Chakotay talked him out of it, explaining that visions can mean many things and that his friends on Voyager needed him. ( VOY : \" Mortal Coil \") \nHe participated in the battle against the Hirogen when the Voyager crew was being used for a training game in the Hirogen holodeck hunts on Voyager . He first was a resistance fighter who was killed by the Nazi Hirogen. Later, as a Klingon , he rallied the holographic Klingon army to attack the Hirogen. ( VOY : \" The Killing Game \") Last year on Voyager (2377-2378) Edit \nIn his last year on Voyager , he helped find The Doctor, who had been kidnapped and sold by an alien named Gar . He put spices in Gar's food that were incompatible with his physiology, and told him only The Doctor could cure him. This persuaded Gar to give them the location of The Doctor. Neelix, however, had only given him an upset stomach. \nHe took pity on prisoners that were aboard a prison transport that was damaged in space. The prisoners were housed in a cargo bay made into a prison on Voyager . One of the prisoners, Joleg , told Neelix he was sentenced to die just because he was in the vicinity of a murder and that his race was discriminated against by the Nyrians whose prison ship he was on. But Joleg was only manipulating Neelix. When the time was right, he tried to escape and tried to kill the guards. \nNeelix helped free most of the crew from the Quarren workforce. They had been captured and brainwashed into believing that they were willing to work for the Quarren. ( VOY : \" Critical Care \", \" Repentance \", \" Workforce \", \" Workforce, Part II \") \nNeelix was part of an away team that was held captive by a race whose world was contaminated by an old Earth probe. During the captivity, he helped Paris deliver and save a newborn's life. After he was rescued, he asked Janeway to help the people. Voyager was able to help stop the radiation poisoning and the planet began to regenerate itself. ( VOY : \" Friendship One \") Leaving Voyager Edit Neelix's new family \nIn 2378 , Voyager discovered a group of Talaxians living inside an asteroid located in the Delta Quadrant . Neelix helped them defend themselves against a group of miners that wanted them to leave the ore-rich asteroid. It was also at this time that Captain Janeway offered him a chance to serve as Starfleet 's permanent ambassador in the Delta Quadrant. He accepted the position and soon left the starship to live with the other Talaxians inside the asteroid. Neelix stayed with Dexa , a widow, and her son, Brax . He kept the combadge he was issued as a souvenir of his time on Voyager . ( VOY : \" Homestead \", \" Endgame \") \nHowever, Neelix also continued to keep in contact with the crew of Voyager . Following his departure, he suggested to Seven of Nine that a picnic might be a suitable option for her third date with Commander Chakotay. Later, Neelix also played a game of kadis-kot with her. During the game, Seven of Nine thanked Neelix for his earlier suggestion. The Talaxian informed Seven of Nine that he was considering making a marriage proposal to Dexa. Their game came to an abrupt end when Seven detected large levels of neutrino emissions on long range sensors and Seven told Neelix that she would contact him at the usual time during the following day. ( VOY : \" Endgame \") It is never revealed if she replied. The game of kadis-kot that they play is the last appearance of Neelix. It can be assumed once Voyager returned to the Alpha Quadrant contact with Neelix was no longer possible and that Voyager never heard from him again. Kazon Edit \nNeelix's knowledge of the Kazon proved invaluable during Voyager 's deals with the various Kazon sects . \nHe took part in contacting Kazon sects and set in motion the plan to form alliances with them. He would also meet Mabus , the leader of the Trabe , who had ruled the Kazon before they rebelled. Voyager would form an alliance with them, which persuaded the Kazon to attend the proposed peace conference. Neelix, alerted by one of his contacts, informed Janeway that the conference might be sabotaged. \nAfter the failure of the peace conference, Neelix helped discover who on Voyager was betraying them to Maje Culluh . It was discovered that it was crewman Michael Jonas . Neelix found him in engineering trying to sabotage the engines, stopped him, and in the ensuing fight, Jonas was killed. \nWhen Voyager was captured by Culluh and the crew was stranded on a primitive planet, Neelix helped them survive until they were able to retake the ship. ( VOY : \" Alliances \", \" Investigations \", \" Basics, Part I \", \" Basics, Part II \") First contacts Edit \nHe did some adult babysitting when he was in charge of showing Tomin , a Kadi ambassador, around Voyager . Tomin became a handful as he got drunk and made a pass at Seven. ( VOY : \" Someone to Watch Over Me \") \nNeelix was part of the away team that tried to shut down a Malon ship whose engines were going to explode and release deadly radiation . ( VOY : \" Juggernaut \") \nIn 2376 , after returning from an away mission, Tuvok was attacked by an invisible alien and suffered brain damage. Neelix helped nurse him back to health. ( VOY : \" Riddles \") \nHe was the first one to become suspicious of the Vaadwaur , a race that Voyager had awakened from stasis . He remembered that their race was a hostile and aggressive one. ( VOY : \" Dragon's Teeth \") \nLater he returned from another away mission with visions of a massacre he participated in. These images were implanted in him from a memorial left behind by the race that had some of its members killed. His memories were that he could not protect the children and they were massacred. He, along with some other crew members, were captured by a Borg ship that was commanded by Borg children. Eventually Voyager rescued him. The children were taken aboard Voyager since they had been severed from the hive. These same children were entertained by him when Voyager encountered an electric being and was transporting it back to its home in a nebula. He did this so they would not be scared. ( VOY : \" Memorial \", \" Collective \", \" The Haunting of Deck Twelve \") Personal interests \nBecause of his varied career, Neelix developed a variety of personal interests that he continued to express on Voyager . Cooking Edit \nNeelix was an enthusiastic cook and ran the ship's mess hall . He was fond of experimenting and often tried to adapt crew members' recipes with the limited ingredients available in the Delta Quadrant, although they often complained about the results. Early on, Tom Paris remarked that Neelix's cooking was \"always interesting\" and the glutinous \" Even better than coffee substitute \" Neelix developed from native plants strongly motivated Janeway to seek new sources of energy for the ship so that she could use the replicator guilt-free. ( VOY : \" The Cloud \") However, he was able to successfully cook a blood pie for B'Elanna. ( VOY : \" Day of Honor \") He enjoyed finding new ingredients to work with, which usually took the form of produce rather than meat. ( VOY : \" Random Thoughts \") Engineering Edit \nNeelix served as an engineering assistant and tried to learn more about the field to be more useful to the crew. He was able to defeat a group of criminals with a canister of leaking warp plasma. ( VOY : \" Fair Trade \"). He also knew how to transport protomatter , a valuable energy resource, although the mission went awry and resulted in his temporary death and subsequent crisis of faith ( VOY : \" Mortal Coil \"). Culture Edit \nAs part of his self-appointed duties as morale officer, Neelix familiarized himself with the various traditions and cultures of crew members. ( VOY : \" Day of Honor \"). He also enjoyed Talaxian holidays and established an annual celebration of Prixin aboard the ship, asking Tuvok to read the traditional salutation one year. ( VOY : \" Mortal Coil \") This article or section is incomplete This page is marked as lacking essential detail, and needs attention . Information regarding expansion requirements may be found on the article's talk page . Feel free to edit this page to assist with this expansion. Personal relationships", "external_links": [], "published": "2016-11-20T02:59:00.000+02:00", "crawled": "2016-11-20T00:32:43.692+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}