{"organizations": [], "uuid": "218028ddb61948558a4f7ea8767a4e6f30597ed5", "thread": {"site_full": "london.backpage.com", "main_image": "", "site_section": "http://uk.backpage.com/online/exports/Rss.xml?keyword=sex&section=517473", "section_title": "backpage.com | sex | united kingdom", "url": "http://london.backpage.com/FemaleEscorts/naughty-cheap-sexy-escorts-02081446746/17865497", "country": "US", "domain_rank": 949, "title": "❤ NAUGHTY CHEAP SEXY ESCORTS 📞02081446746 ❤ - 20", "performance_score": 0, "site": "backpage.com", "participants_count": 0, "title_full": "❤ NAUGHTY CHEAP SEXY ESCORTS 📞02081446746 ❤ - 20", "spam_score": 0.0, "site_type": "news", "published": "2016-11-23T07:26:00.000+02:00", "replies_count": 0, "uuid": "218028ddb61948558a4f7ea8767a4e6f30597ed5"}, "author": "", "url": "http://london.backpage.com/FemaleEscorts/naughty-cheap-sexy-escorts-02081446746/17865497", "ord_in_thread": 0, "title": "❤ NAUGHTY CHEAP SEXY ESCORTS 📞02081446746 ❤ - 20", "locations": [], "entities": {"persons": [{"name": "barbara", "sentiment": "none"}, {"name": "gabrielle", "sentiment": "none"}, {"name": "giselle", "sentiment": "none"}, {"name": "megan", "sentiment": "none"}, {"name": "chloe", "sentiment": "none"}, {"name": "naomi", "sentiment": "none"}, {"name": "paula paula", "sentiment": "none"}, {"name": "maia", "sentiment": "none"}, {"name": "jenifer", "sentiment": "none"}, {"name": "naomi megabusty", "sentiment": "none"}], "locations": [{"name": "melody melody", "sentiment": "none"}, {"name": "uk", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "http://www.123-escorts.co.uk DENISSE Tenderness and Sensuality, Seduce and being seduced! Here we have Denisse a fabulous and aphrodisiac Brazilian escort coming from the hottest country in the world. She has a passion for sex; to satisfy is her passion and her wish. JENIFER If you desire to meet a mature and beautiful brunette girl with whom to enjoy genuine passion, then we doubt that you could find a better escort than Barbara. This startling curvy busty blonde Colombian escort is the perfect companion for all kinds of dates. From tender romantic dinner dates to extravagant nights on the town, jeniffer should be the lady of choice when you are looking for the highest level of looks and personality. GABRIELLE thin and small girl ready to please all your fantasies and be what you want it to be, if you look a delicate girl to fulfill some erotic dream or fantasy Megan’s what you're looking for she is so sweet sensual naughty girl . TAYLOR SHE is outstanding. Not only is she physically beautiful, but her personality, attitude, and service match her beauty. The best. is extremely attractive and sensual. Perfect body, wonderful and natural boobs, with hard nipple. NAOMI Megabusty 36FF Curvy baby, Naomi is a one-off an angel a phenomenon. Truly beautiful and so pretty. She is sweet and intelligent. She smiles and laughs and provides me with oasis. What a girl! MELODY Melody is a perfect combination of playfulness and naughtiness, this busty British lady is waiting for your call, horny as hell she will become reality all your fantasies, she is gonna jack your stick and bring to you the real meaning od sex! Stop pounding your beef and Call melody in order to have the best sexual experience you will never have. Jade To love an ebony girl is important to know that they are as sweets as UK chocolates, the secret is how you remove the wrapper!! Chloe is a little piece of heaven her slim body, shocking curves and sugar skin is ready to love you. STACEY She is a really charming companion – out-going, fun-loving and with a great sense of humor. We know that time spent with Giselle is time well-spent and you two will have an amazing date. No matter how you want to spend your time with Maia, we can safely say it will be a good time . PAULA Paula is MEGUBUSTY 36DD Naughty girl she is very open minded, very entertaining and passionate lady who just loves to get wild and wicked behind closed doors.always will satisfy your every need and ofer sex.aple with a smoot look and amazing figure , this company look unforgotable. CHLOE If you desire to meet a young and beautiful brunette girl with whom to enjoy genuine passion, then we doubt that you could find a better escort than Jade. This startling slim evony escort is the perfect companion for all kinds of dates. From tender romantic dinner dates to extravagant nights on the town, Chloe should be the lady of choice when you are looking for the highest level of looks and personality DON'T FORGET TO CHECK OUR WEBSITE TO FIND MORE BEAUTIES!! CALL NOW!", "external_links": [], "published": "2016-11-23T07:26:00.000+02:00", "crawled": "2016-11-23T08:41:13.552+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}