{"organizations": [], "uuid": "d0fc3c08752093fab531a288aeae1c762b238dca", "thread": {"site_full": "www.wsj.com", "main_image": "https://si.wsj.net/public/resources/images/EN-AB547_RULES__G_20161117161507.jpg", "site_section": "http://www.wsj.com/europe", "section_title": "The Wall Street Journal &amp; Breaking News, Business, Financial and Economic News, World News and Video", "url": "http://www.wsj.com/articles/an-older-golfer-has-a-gripe-with-the-usga-1480302240", "country": "US", "domain_rank": 387, "title": "An Older Golfer Has a Gripe With the USGA", "performance_score": 0, "site": "wsj.com", "participants_count": 2, "title_full": "An Older Golfer Has a Gripe With the USGA - WSJ", "spam_score": 0.266, "site_type": "news", "published": "2016-11-28T06:37:00.000+02:00", "replies_count": 1, "uuid": "d0fc3c08752093fab531a288aeae1c762b238dca"}, "author": "Alfred L. Malabre Jr.", "url": "http://www.wsj.com/articles/an-older-golfer-has-a-gripe-with-the-usga-1480302240", "ord_in_thread": 0, "title": "An Older Golfer Has a Gripe With the USGA", "locations": [], "entities": {"persons": [{"name": "malabre", "sentiment": "none"}, {"name": "jones", "sentiment": "none"}, {"name": "bobby jones", "sentiment": "none"}, {"name": "snead", "sentiment": "none"}, {"name": "sam snead", "sentiment": "none"}], "locations": [{"name": "s.c.", "sentiment": "none"}, {"name": "ecuador", "sentiment": "none"}, {"name": "charleston", "sentiment": "none"}, {"name": "u.s", "sentiment": "none"}, {"name": "wsj.com", "sentiment": "none"}], "organizations": [{"name": "u.s. golf association", "sentiment": "negative"}, {"name": "usga", "sentiment": "negative"}, {"name": "wall street journal", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "1 COMMENTS What is it that the rule makers of the U.S. Golf Association have against golfers, like me, of a certain age?\nPerhaps we should be home, preferably in slippers, watching golf on TV or reading a book. But instead we’ve chosen to be out on the course—to be sure, a rear-guard action—valiantly struggling to keep playing the game.\nUnique in sports, and a wonderful thing it is, the game of golf depends in very large measure on the honesty of its participants. And that honesty, in turn, requires adhering strictly to the various rules set down from time to time by the USGA, the sport’s regulatory body in the U.S. The rules often are complex. But to play the game properly, a golfer—whether a touring professional competing for vast sums or a high-handicap amateur like me—must abide by them.\nI don’t believe for a moment that the USGA has deliberately tried to make the game more difficult just for seniors. The rules are set down impartially for all who choose to play the game—young, old and everyone in between. Nonetheless, a couple of rule changes instituted this year seem to hit those of us with more experience a bit harder than others.\nLet me explain.\nBattle against the yips A widespread problem as golfers grow older is the onset of the putting yips, a nervous flinching of the wrists, especially on shorter putts. This dreaded affliction rarely bothers younger players. But it is common among seniors whose nerves tend often to be more fragile.\nJournal Report Insights from The Experts Read more at WSJ.com/Encore More in Encore: The New Retirement Five Myths About Landing a Good Job Later in Life What Ever Happened to That Old 401(k) You Had? How to Use Technology to Connect to Grandchildren If You’re Thinking of Retiring in Ecuador Best Books of 2016 for People of a Certain Age ‘I Used to Be So Cool. What Happened?’ An antidote had until recently been to acquire a longer, heavier putter and then to anchor the grip against the chest to reduce or even eliminate any flinching. But now, just when at last I had pretty well used this technique to conquer my late-in-life entanglement with the yips, the USGA rules people have declared no more anchoring. They were careful, however, not to ban the long putter itself, no doubt mindful that such a prohibition might trigger lawsuits by its producers. But without anchoring, the long and heavy putters can become unwieldy and far less helpful against the yips.\nThat was rule change No. 1. The second change was even more discouraging for those of us whose partners from the old days grow ever scarcer, forcing us to discover the considerable joys of playing alone. Specifically, the rules people have outlawed submitting scores played solo.\nFor those of us who play most of our rounds alone, that means fewer rounds will count toward calculating a handicap, which very likely will mean a less accurate handicap. That’s no small thing on those rare days when I do compete against friends for a few dollars.\nWriting of the joys of solo golf in The Wall Street Journal in 2013, I noted enthusiastically that a solitary golfer, using however many handicap strokes may be allowed, may compete quite happily “against the course” and “record an accurate score.” This score, in turn, may be submitted, I wrote, so as to maintain an accurate handicap.\nBut no more. Now I am instructed that I must bring along at least one “companion” to verify my score before submission. Would my 10-year-old granddaughter do if she knows the rules? If the purpose of this new ban is to keep me honest, why not let me simply post my score and then agree to a polygraph test at the 19th hole? Or better yet, why not just keep counting on the honesty of golfers?\nAs to the suggestion, which the rules people make, that playing alone somehow may distort one’s performance, I simply don’t buy it. My scores alone pretty much match my scores on the rare occasions when I play with others.\nHow do such rule changes originate?\nThe U.S. Golf Association bears no love for older players of the game, judging by some of its recent rule changes. Photo: iStockphoto/Getty Images The anchoring ban was instituted because, the USGA maintains, the proper golf stroke requires “freely swinging the entire club,” which anchoring makes impossible. And, the USGA reasons, scores for rounds played solo lack “peer review.” Having companions along, in the USGA’s view, will provide “a more accurate view of a golfer’s ability.”\nThe croquet putt The late Sam Snead suggested to me that USGA rulings may occasionally reflect more subjective considerations. In the twilight of his great career, battling the yips, Snead adopted a croquet-style of putting, where he faced the hole with the club positioned between his legs. He was playing in the Masters tournament, Snead recalled, with the revered Bobby Jones looking on. Jones, he said, was “appalled” at the spectacle and told a USGA official next to him that this was no way to play the game of golf. A short while later, the USGA banned a croquet-style putt.\nPreviously in Encore It’s Time to Rethink the Bucket List Retirement (March 2016) How Technology Will Transform Retirement (November 2015) To Age Well, Change How You Feel About Aging (October 2015) Snead resorted to a sidesaddle style where he still faced the hole, but with his putter held awkwardly to the side. Somehow the sidesaddle approach passed muster with the USGA. But how, I ask, is that a less “appalling” way to putt than the outlawed croquet technique? (Remarkably, the rules people neglected to forbid the croquet style for balls hit from just inches just off the green. An oversight? Go figure.)\nAs for me, I plan to continue playing alone much of the time, even occasionally using my long putter anchored to my chest. But because of the new rules, I won’t be able to submit these scores.\nI am no Sam Snead, but I am beginning to think I know how he must have felt.\nMr. Malabre is a retired Wall Street Journal editor who plays most of his golf in Charleston, S.C. Email him at reports@wsj.com .", "external_links": ["https://si.wsj.net/public/resources/images/EN-AB547_RULES__M_20161117161507.jpg", "https://si.wsj.net/public/resources/images/EN-AB547_RULES__P_20161117161507.jpg"], "published": "2016-11-28T06:37:00.000+02:00", "crawled": "2016-11-28T11:31:16.959+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 5, "shares": 5, "comments": 0}, "stumbledupon": {"shares": 0}}}