{"organizations": [], "uuid": "28d32f658f994a499146efdca2e84318fda28d19", "thread": {"site_full": "scifi.stackexchange.com", "main_image": "http://cdn.sstatic.net/Sites/scifi/img/apple-touch-icon@2.png?v=21318a38b766&a", "site_section": "http://scifi.stackexchange.com/feeds", "section_title": "Recent Questions - Science Fiction & Fantasy Stack Exchange", "url": "http://scifi.stackexchange.com/questions/5926/how-does-the-flash-perceive-time", "country": "US", "domain_rank": 179, "title": "How does the Flash perceive time?", "performance_score": 0, "site": "stackexchange.com", "participants_count": 1, "title_full": "How does the Flash perceive time?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:50:00.000+02:00", "replies_count": 0, "uuid": "28d32f658f994a499146efdca2e84318fda28d19"}, "author": "OghmaOsiris", "url": "http://scifi.stackexchange.com/questions/5926/how-does-the-flash-perceive-time", "ord_in_thread": 0, "title": "How does the Flash perceive time?", "locations": [], "entities": {"persons": [{"name": "ethan van sciver", "sentiment": "none"}, {"name": "bart allen", "sentiment": "none"}, {"name": "batman", "sentiment": "none"}, {"name": "barry allen", "sentiment": "none"}, {"name": "johnny quick", "sentiment": "none"}, {"name": "ras al ghul", "sentiment": "none"}, {"name": "jay garrick", "sentiment": "none"}, {"name": "encantadora", "sentiment": "none"}, {"name": "max mercury", "sentiment": "none"}, {"name": "wally west", "sentiment": "none"}, {"name": "superman", "sentiment": "none"}, {"name": "jesse quick/liberty belle", "sentiment": "none"}], "locations": [], "organizations": [{"name": "speed force", "sentiment": "none"}, {"name": "dcu", "sentiment": "none"}, {"name": "max mercury", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "up vote 16 down vote accepted \nJust as with his movement speed, he's able to control how fast he perceives time. So day to day, he spends his civilian time mostly perceiving time at the rate we all do. When fighting crime he'll vary it to keep up with how quickly he needs to be moving. answered Sep 30 '11 at 17:45 user1027 6 Begs the question, can he go slower than that? There are whole sections of days I'd love to perceive at 1% of normal time. – DampeS8N Sep 30 '11 at 18:00 up vote 55 down vote \nThe Short Answer: It is likely the Flash (and other speedsters like him) have complete control of the temporal aspects of their speed powers because it would otherwise be intolerable to be faster than everything around you and having no control of how you were able to perceive it. \nSuch a perceptual state would leave the world, from his point of view, a world of immobile objects, frozen in time. It is hard to imagine not having the ability to alter one's perception to the passage of time, slowing or speeding it up in relationship to yourself. \nThe Flash's perception of space-time is highly fluid, while he is often shown speeding up his perceptions, it should be theoretically possible for him to slow down his perception of any particular moment in the same fashion. \nIt is hard to imagine why he would want to slow down his perception of the flow of time, but it should be within his ability to do so, since he can instantly decide in a split second how he wants to maneuver himself through space-time. Super-speed and perception \nAnyone capable of moving at speeds greater than human reflexes will allow are considered to be utilizing some aspect of super-speed. But the concept of super-speed in comics is a bit more complicated than it would initially appear. \nHighly trained humans can perform feats such as blocking or catching arrows and other feats of hand-eye coordination only with significant practice as they have to overcome their own internal process of actually thinking about the action. \nUnfortunately, this prevents all but the most dedicated such as Batman, Bronze Tiger, Chesire or Ras Al Ghul from being able to appear superhuman in their reflexive responses. To them, most normal humans appear to be moving through molasses. But this is not superhuman, it is merely a highly trained and reflexive combat technique. \nThe concept of no-mind or mushin no shin , is the martial idea that a trained warrior will be able to move as fast as his reflexes allow only when he is no longer required to THINK about the movement and can act as fast as humanly possible. \nBronze Tiger and Batman engaging in combat in a mushin state; both are acting reflexively, moving faster than their conscious minds could would normally. \nIn the case of superspeed users, mushin is either how they live completely, reflexively activating and utilizing their powers, without consciousness of that power use, or that they are in complete control of their awareness and interaction with the flow of time around them. This makes using superspeed an ability with a dazzling array of permutations, physical, mental and temporal. \n\"Fast Reflexes are enough for me\" \nSpeedsters who do not manipulate the flow of time and are only acting within the boundaries of physical limitations, such as superfast martial artist types like Marvel's Quicksilver, the Whizzer or Speed Demon, would be limited to the neural capacities of their brains. Quicksilver stayed irritable by how slowly everyone seemed to move in comparison to his own ability. \nEven then, they would likely have some sort of neural development allowing them to control their body's awareness of itself, their enhanced movement and their ability to alter their perception of the flow of time. \nThis awareness of the flow of time would be a natural adaptation to their high speed movement ability. They would likely have a highly developed sense of their body's position, speed and movement in relation to everything around them. Otherwise any use of their superspeed might result in grievous injury as they slammed their high speed body into something during their use of their powers. \n\"I'm so fast, I don't even have to think about it.\" \nIn the case of super-speed users who are not necessarily speedsters such as Wonder Woman, or Superman, they are likely users of superspeed in a reflexive manner as a subset of their already advanced mental and physical capabilities. Otherwise any use of their superspeed along with their superhuman strength could destroy everything around them. \nIn the rare instance you have people with superspeed and mushin; they can use their speed reflexively in combat. DC Comics Wonder Woman reminds Superman of this fact in a conversation about his combat ability versus hers. Batman agrees with Wonder Woman, that under most circumstances, her reflexive superspeed is still greater than Superman's because she trained until she can utilize it without thought . \nTo be fair to Superman, he rarely uses superspeed in conjunction with his other powers because this makes him a highly destructive force akin to a tornado or hurricane. Lacking the Speed Force Aura of the Flashes, when Superman uses his superspeed, he creates atmospheric effects and can cause environmental damage as he utilizes his powers. \nIt is for this reason Superman holds back in fights against his enemies because the more of his powers he brings to a conflict the more collateral damage he creates, likely requiring a greater expenditure of powers to bring under control. \nFor him, super-speed would only be used if it could bring a conflict to a close faster than any other use of his powers. In a conflict with Encantadora, Superman uses superspeed in tight quarters to defeat her henchmen because it allowed him to take a box filled with Kryptonite in less than the three seconds it would take her to react to his movement. The same would apply to Wonder Woman, since most things like weapons and tools would be destroyed by the stresses of super-speed, unless she was using augmented tools, it is simply easier to keep her speed below the thresholds of super-speed unless necessary. \n\"I'm so fast, I have to move through time to use my powers.\" \nNow beings such as the DCU's Flash, whose abilities allow him to move faster than the material universe allows, would have to have a change in state, because there is no way his mental capacity (his human brain network) would have the ability to keep up with speeds that he sustains in his superspeed state. He would be moving faster than his electrically-charged brain could send messages. \nThought is a process involving neurons in the brain, and is thus subject to the speed at which impulses can travel along nerves. Depending on which nerves are involved, transmission speed can vary; regardless, nerve conduction tops out at around 250 miles per hour. Since the Flash can reach the speed of light, the speed of light is six orders of magnitude faster than the speed of thought! \nTherefore, the Flash is somehow manipulating either his thought process, changing the rate of information transfer in his brain, accelerating it until he is able to think as fast as he can move or manipulating his interaction with the flow of time, appearing to be moving at superhuman speeds. \nIn some unknown fashion, he is manipulating the flow of time around his body, allowing him to appear to be faster and to act at superspeed without becoming an energy-form himself. Such a transition would allow him to move faster, think faster, and act faster without changing him into energy, which would be required for him to move at the speed of light. \nIt would seem though he may be achieving a change in state because he is able to defy gravity, pass through matter like electromagnetic radiation and achieve speeds only achievable by electromagnetic phenomena like light. If he is faster than light he is moving as fast as only a theoretical particle, the tachyon can move. \nI support the concept of the Flash altering temporal physics and his ability to act in a Heisenburg-like fashion with a feat he performed to save the population of a city from a nuke. In 100 picoseconds he saved half a million people, two at a time. This meant he had to be moving many times faster than the speed of light, in atmosphere! The Need for the Speed Force \nThe energy required for him to manipulate the time stream in this fashion would be fantastic, and I believe this was what led to the idea of the Speed Force storylines, because otherwise there could be no way physically for any Flash to move faster than he could think without causing catastrophic damage to the environment. \nThe Speed Force is a vaguely defined extra-dimensional energy force from which most, but not all, superspeed-powered heroes in the DC Comics universe draw their enhanced abilities. For example, the multiple heroes named the Flash (Jay Garrick, Barry Allen, Wally West, and Bart Allen), Johnny Quick, Jesse Quick/Liberty Belle, XS, the Tornado Twins, and Max Mercury all draw their powers from the Speed Force. The Speed Force is also seen as a physical space to which speedsters can travel. \nMax Mercury traveled through time as a result of his efforts to enter the Speed Force and ended up several decades into the future every time he made an attempt.[citation needed] Bart Allen could control the Speed Force and could \"commune\" with the spirits in the Speed Force through meditation. When speedsters die, they become one with the Speed Force, as it is an afterlife for them. Max Mercury's own spirit is trapped inside following his possession by The Rival. \nA physical representation of the Speed Force. Panel from Impulse #66. Artwork by Ethan Van Sciver. \nThis temporal manipulation allows him to move through time in a limited or controlled fashion with the proper practice, skill or technological augmentation such as the cosmic treadmill popular in the 1970s and 1980s Flash stories. Recent Flash tales show him moving through time in a less controlled manner which would be consistent with his ability to manipulate his position in time and space. This theory would also be consistent with the Flash having complete control of his molecular and atomic energy movement, vibrations and states of temporal phase. \n\"I'm so fast, I barely know where I am\" \nThis transformation of the Flash's thinking gives him an expanded consciousness and he takes on a more Heisenburg-like positioning; he simply wills himself through his perception of running to be where he wants to be and he crosses that distance manipulating time between where he starts to where he finishes. \nFor him to do this, he must both speed his perception of time to a point where objects in motion become, to him, relatively immobile, remove himself from many of the physical laws of our universe including inertia, conservation of energy and momentum. And as long as he can maintain his concentration, he is effective at altering these fundamental laws of physics. \nIt is likely the reason his Rogue's Gallery is so effective because many of them use weapons, technology or techniques that distract, distort or alter the Flash's perception of his surroundings. It is that perception that allows him to use his superspeed to alter his position in space-time. If you can distract him, you can reduce his effective use of his abilities.", "external_links": [], "published": "2016-11-20T02:50:00.000+02:00", "crawled": "2016-11-19T22:14:36.880+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}