{"organizations": [], "uuid": "2186246eee63dc10dff0dd74c3e0ed87531b115b", "thread": {"site_full": "www.chron.com", "main_image": "http://ww1.hdnux.com/photos/55/11/75/11837252/3/rawImage.jpg", "site_section": "", "section_title": "", "url": "http://www.chron.com/neighborhood/atascocita/sports/article/Atascocita-leaves-little-for-debate-beats-10626491.php", "country": "US", "domain_rank": 773, "title": "Atascocita leaves little for debate, beats Pearland to advance to regional semifinals - Houston Chronicle", "performance_score": 0, "site": "chron.com", "participants_count": 0, "title_full": "Atascocita leaves little for debate, beats Pearland to advance to regional semifinals - Houston Chronicle", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T19:46:00.000+02:00", "replies_count": 0, "uuid": "2186246eee63dc10dff0dd74c3e0ed87531b115b"}, "author": "Ted Dunnam Ted Dunnam", "url": "http://www.chron.com/neighborhood/atascocita/sports/article/Atascocita-leaves-little-for-debate-beats-10626491.php", "ord_in_thread": 0, "title": "Atascocita leaves little for debate, beats Pearland to advance to regional semifinals - Houston Chronicle", "locations": [], "entities": {"persons": [{"name": "lujuan winningham", "sentiment": "negative"}, {"name": "lamar", "sentiment": "none"}, {"name": "jacob whitehead", "sentiment": "none"}, {"name": "oiler", "sentiment": "none"}, {"name": "tony heath", "sentiment": "none"}, {"name": "joshua escobedo", "sentiment": "none"}, {"name": "atasocita", "sentiment": "none"}, {"name": "eric singleton", "sentiment": "none"}, {"name": "jaylon allen", "sentiment": "none"}, {"name": "decarlos demmerritte", "sentiment": "none"}, {"name": "demmerritte", "sentiment": "none"}, {"name": "craig stump", "sentiment": "none"}, {"name": "jaelin benefield", "sentiment": "none"}, {"name": "alerick soularie", "sentiment": "none"}, {"name": "david heaton", "sentiment": "none"}, {"name": "stump", "sentiment": "none"}, {"name": "daveon boyd", "sentiment": "none"}, {"name": "winningham", "sentiment": "none"}, {"name": "boyd", "sentiment": "none"}, {"name": "whitehead", "sentiment": "none"}], "locations": [{"name": "pearland", "sentiment": "none"}, {"name": "atascocita", "sentiment": "none"}, {"name": "pearl", "sentiment": "none"}, {"name": "atasocita", "sentiment": "none"}, {"name": "lujuan winningham", "sentiment": "none"}, {"name": "demmerritte", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "nrg stadium", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "winningham", "sentiment": "none"}], "organizations": [{"name": "atascocita", "sentiment": "negative"}, {"name": "houston chronicle", "sentiment": "negative"}, {"name": "christian lake", "sentiment": "none"}, {"name": "eagles", "sentiment": "none"}, {"name": "pearland", "sentiment": "none"}, {"name": "kirk sides atascocita", "sentiment": "none"}, {"name": "kirk sides image", "sentiment": "none"}, {"name": "oilers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 11 Atascocita's Lujuan Winningham (11) pulls down a pass for a touchdown over Pearland's Eric Singleton (26) in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Atascocita's Lujuan Winningham (11) pulls down a pass for a touchdown over Pearland's Eric Singleton (26) in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 2 of 11 Atascocita's Daveon Boyd (2) dives for yardage against Pearland at NRG Stadium in Houston, Texas Saturday, Nov. 19. Atascocita's Daveon Boyd (2) dives for yardage against Pearland at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 3 of 11 Pearland's Jacob Whitehead (9) muscles into the end zone from the one yard line for a touchdown against Atascocita in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Pearland's Jacob Whitehead (9) muscles into the end zone from the one yard line for a touchdown against Atascocita in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 4 of 11 Pearland's Jacob Whitehead (9) muscles into the end zone from the one yard line for a touchdown against Atascocita in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Pearland's Jacob Whitehead (9) muscles into the end zone from the one yard line for a touchdown against Atascocita in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 5 of 11 Atascocita's Lujuan Winningham (11) pulls down a pass for a touchdown over Pearland's Eric Singleton (26) in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Atascocita's Lujuan Winningham (11) pulls down a pass for a touchdown over Pearland's Eric Singleton (26) in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 6 of 11 Atascocita's Lujuan Winningham (11) pulls down a pass for a touchdown over Pearland's Eric Singleton (26) in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Atascocita's Lujuan Winningham (11) pulls down a pass for a touchdown over Pearland's Eric Singleton (26) in the second half at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 7 of 11 Atascocita's Daveon Boyd (2) tosses a pass to Decarlos Demmerritte at NRG Stadium in Houston, Texas Saturday, Nov. 19. Atascocita's Daveon Boyd (2) tosses a pass to Decarlos Demmerritte at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 8 of 11 Atascocita's Daveon Boyd (2) dives for yardage against Pearland at NRG Stadium in Houston, Texas Saturday, Nov. 19. Atascocita's Daveon Boyd (2) dives for yardage against Pearland at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 9 of 11 Atascocita sings the school song after defeating Pearland at NRG Stadium in Houston, Texas Saturday, Nov. 19. Atascocita sings the school song after defeating Pearland at NRG Stadium in Houston, Texas Saturday, Nov. 19. Photo: Kirk Sides Image 10 of 11 Atascocita quarterback Daveon Boyd lunges toward the end zone in the Eagles' 35-14 win over Pearland Saturday at NRG Stadium. Atascocita quarterback Daveon Boyd lunges toward the end zone in the Eagles' 35-14 win over Pearland Saturday at NRG Stadium. Photo: Kirk Sides Atascocita leaves little for debate, beats Pearland to advance to regional semifinals 1 / 11 Back to Gallery \nIt doesn't matter to Atascocita coach Craig Stump if quarterback Daveon Boyd is handing off, passing, lateraling or running the ball. \nJust as long as the final result is achieved. \nBoyd left little for Stump to debate Saturday at NRG Stadium as the versatile senior accounted for 374 total yards and four touchdowns in Atascocita's 35-14 win over Pearland in a Class 6A Division I area football matchup. \nThe win sends the Eagles (10-1) into the regional semifinals against Lamar (11-1) at 4 p.m. Friday at NRG Stadium. \nAtascocita led just 14-7 at halftime, but it pulled away with big plays on offense and defense. \n\"Any time you give up seven points in a half, you should be able to give yourself a good chance to win,\" Stump said. \"We scored first in the second half, and then it got a little frustrating when we fumbled down there on the 1. \n\"I didn't think it was a fumble, but who knows? You have to give the ball to the official. There are no replays in high school. But we continued to move the ball and the defense made good stops.\" \nResponded early, often \nBoyd completed 21 of 33 passes for 303 yards and two touchdown passes while rushing for 71 yards and scoring on runs of two and five yards. \nHe threw a 30-yard scoring pass to Lujuan Winningham at 3:24 of the third quarter as Atascocita opened a 21-7 cushion. When Pearland cut the gap to 21-14, Boyd had to go to work again. \nHe responded admirably, guiding Atasocita on two consecutive scoring drives. \nThat 28-14 lead swelled to 35-14 just 1:46 later following an interception by Joshua Escobedo . \nAtasocita needed to travel just 17 yards and did so in four plays, capped by Boyd's 5-yard scoring run with 7:12 left. \nThat TD provided more than enough cushion for the Eagles. \n\"Them making crucial third-down plays and us not making them was the difference,\" Pearland coach Tony Heath said. \"Our defense finally wore out. Our offense just didn't give the defense the opportunity to rest … and give them some life. \n\"We've played with a short stick most of the year, and we've just patched it up every week. We gave a great effort. Atascocita just has a lot of weapons. \n\"This is the class they've been waiting for. They have talent at quarterback, in the slots, at running back and in both lines. They're a good football team.\" \nSpreading the ball \nAtascocita's fumble at the Oilers' 1-yard line came on its first possession in the second half, but it didn't prove fatal in the long run. \nThe Eagles' defense was up to the task, while Boyd kept drives alive by connecting with Winningham (seven catches, 111 yards, two scores) and Alerick Soularie (6-120-0). \n\"The thing is, it was those two guys (Winningham and Soularie) this week, and it was another guy last week,\" Stump said. \"You look at our stats and it's spread around. I call things based on defense, not who's in the game. They're all expected to make it happen.\" \nAtascocita led Pearland (8-4) 14-7 at halftime following a scoreless first quarter. \nPearland (8-4) scored the game's first points on its initial possession of the second period, moving 74 yards in six plays to take a 7-0 advantage at the 10:10 mark. \nA 16-yard completion from Oiler quarterback Whitehead to wide receiver Christian Lake moved Pearland to its 44 yard line. \nThree plays later, Oiler running back Jaelin Benefield broke through the front wall of the Atascocita defense and found open space en route to a 44-yard scoring run. \nTwo possessions later, the Eagles produced the equalizing score after Atasocita's Jaylon Allen pounced on a muffed punt at the Pearland 25 yard line. \nThe Eagles needed five plays to reach the end zone, using a fourth-and-1 run of four yards by Demmerritte to reach the Pearland 12. \nFrom there, Daveon Boyd fired a scoring strike to Winningham on a slant route with 6:43 left in the half, and David Heaton 's PAT kick tied the game at 7. \nAtascocita grabbed the 7-point halftime cushion courtesy of an 8-play, 54-yard march which culminated with Boyd's 2-yard sweep of right end.The biggest installment in that march was a 32-yard third-down pass from Boyd to Demmerritte. ", "external_links": [], "published": "2016-11-20T19:46:00.000+02:00", "crawled": "2016-11-21T15:45:58.712+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 75, "shares": 75, "comments": 0}, "stumbledupon": {"shares": 0}}}