{"organizations": [], "uuid": "0b46d72b1c0149142e1e86383bbf27b9b1fa0a1a", "thread": {"site_full": "www.theatlantic.com", "main_image": "https://cdn.theatlantic.com/assets/media/img/mt/2016/11/RTX1WKP8/facebook.jpg?1479494261", "site_section": "http://www.theatlantic.com/api/1.0/articles/?format=atom&full_content=true&user=atlantic&password=media", "section_title": "The Atlantic", "url": "http://www.theatlantic.com/politics/archive/2016/11/fixing-americas-nearsighted-press-corps/508088/", "country": "US", "domain_rank": 918, "title": "How the Media Became Elitist", "performance_score": 7, "site": "theatlantic.com", "participants_count": 1, "title_full": "How the Media Became Elitist - The Atlantic", "spam_score": 0.0, "site_type": "news", "published": "2016-11-19T14:01:00.000+02:00", "replies_count": 0, "uuid": "0b46d72b1c0149142e1e86383bbf27b9b1fa0a1a"}, "author": "Robinson Meyer Jan 14, 2014 How Casinos Enable Gambling Addicts John Rosengren Nov 15, 2016 Donald Trump's Ford Focus Jeremy Venook Nov 18, 2016 The Knowns and Unknowns of Donald Trump's Foreign Policy James Kitfield 4:50 AM ET China’s Great Leap Backward James Fallows Nov 15, 2016 Andrew McGill", "url": "http://www.theatlantic.com/politics/archive/2016/11/fixing-americas-nearsighted-press-corps/508088/", "ord_in_thread": 0, "title": "How the Media Became Elitist", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "neutral"}, {"name": "clinton", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "stephen colbert", "sentiment": "none"}, {"name": "bernie sanders", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}], "locations": [{"name": "middle america", "sentiment": "none"}], "organizations": [{"name": "university of minnesota", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Of all the parties with egg on their faces after Donald Trump’s surprise election—Democrats, pollsters , political bettors —my colleagues in the media felt especially yolky. Stephen Colbert’s awkward jive on Election Night could have stood in for any number of newsrooms that evening: He didn’t see Trump’s victory coming, he wasn’t well-prepared, and he was very confused.\nFor the record, I contest that it was the media’s responsibility to “call” this election to begin with. The horse race is trivial, people always tell journalists— write about stuff that matters. Reporters did just that, digging into Trump’s charitable giving, Hillary Clinton’s emails, and Bernie Sanders’s economic plan. Still, very few people in the mainstream press expected Trump to win, thereby influencing their coverage—newsrooms drew up plans to cover a Clinton transition, and correspondents penned final-days-of-Trump features .\nLatest from Politics A Deadly Question \nIn the aftermath, many of the immediate post-mortems blamed a coastal bubble: Too many journalists had grown nearsighted in urban Democratic enclaves, the reasoning went, blinding them to what was taking place in Middle America. If more reporters actually spent time in fly-over country, instead of jetting through for a rally, they’d understand why Donald Trump won voters over. And if national newsrooms prioritized hiring folks who didn’t graduate from elite journalism programs—and maybe didn’t graduate from college at all—well, that wouldn’t hurt, either.\nA critique is most devastating when it is true. The American journalistic class has certainly diverged sharply from the country it covers. In 1960, nearly a third of reporters and editors had never attended a single year of college; in 2015, only 8.3 percent could say the same , according to Census figures extracted with the help of the University of Minnesota’s IPUMS project . That year 46 percent of adults 25 and older nationwide had never attended a university.", "external_links": [], "published": "2016-11-19T14:01:00.000+02:00", "crawled": "2016-11-19T14:05:03.555+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 15}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 3}, "facebook": {"likes": 782, "shares": 782, "comments": 0}, "stumbledupon": {"shares": 34}}}