{"organizations": [], "uuid": "dabf96f26f5457784a97641446faf753772e78d3", "thread": {"site_full": "cebudailynews.inquirer.net", "main_image": "http://cebudailynews.inquirer.net/files/2016/11/e1108ent1.jpg", "site_section": "http://cebudailynews.inquirer.net/feed/atom", "section_title": "Cebu Daily News", "url": "http://cebudailynews.inquirer.net/111422/firm-to-cut-into-372b-insurance-protection-gap", "country": "US", "domain_rank": 813, "title": "Firm to cut into $372B insurance protection gap", "performance_score": 0, "site": "inquirer.net", "participants_count": 1, "title_full": "Firm to cut into $372B insurance protection gap", "spam_score": 0.0, "site_type": "news", "published": "2016-11-07T22:09:00.000+02:00", "replies_count": 0, "uuid": "dabf96f26f5457784a97641446faf753772e78d3"}, "author": "mpadayhag", "url": "http://cebudailynews.inquirer.net/111422/firm-to-cut-into-372b-insurance-protection-gap", "ord_in_thread": 0, "title": "Firm to cut into $372B insurance protection gap", "locations": [], "entities": {"persons": [{"name": "dela cruz", "sentiment": "none"}, {"name": "anthony v. silva", "sentiment": "none"}, {"name": "victor anthony v. silva", "sentiment": "none"}, {"name": "maria divina furagganan", "sentiment": "none"}, {"name": "aimee dela cruz", "sentiment": "none"}, {"name": "antonio garces ii", "sentiment": "none"}, {"name": "furagganan", "sentiment": "none"}, {"name": "elaine katindoy", "sentiment": "none"}, {"name": "antonio garces", "sentiment": "none"}], "locations": [{"name": "philippines", "sentiment": "none"}, {"name": "cebu city", "sentiment": "none"}, {"name": "radisson blu hotel cebu", "sentiment": "none"}, {"name": "cebu", "sentiment": "none"}], "organizations": [{"name": "pru life max invest", "sentiment": "none"}, {"name": "prudential", "sentiment": "none"}, {"name": "radisson blu hotel", "sentiment": "none"}, {"name": "pru life uk", "sentiment": "none"}, {"name": "eastspring investments", "sentiment": "none"}, {"name": "variable life rider", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Firm to cut into $372B insurance protection gap SHARES: 11:09 PM November 7th, 2016 Recommended By: Victor Anthony V. Silva  09 PM Pru Life UK executives discuss the insurance market during the Pru Life Max Invest launching at the Radisson Blu Hotel Cebu. The executives are led by Maria Divina Furagganan, senior vice president and CEO, (second from left); Elaine Katindoy (from left) vice president for new agent training and productivity; Aimee dela Cruz, assistant vice president for pricing and product development; and Antonio Garces, vice president for investments (CDN PHOTO/VICTOR ANTHONY V. SILVA). \nPru Life UK eyes lower to middle class sector to grow insurance market \nA life insurance company is aiming to increase the insurance penetration in the country and lessen the $372 billion insurance protection gap through the lower to middle income class market. \nPru Life UK aims to increase the insurance penetration in the country which currently stands at less than two percent of the country’s Gross Domestic Product (GDP), and decrease the insurance protection gap or the value of insurance Filipinos should have but don’t, which is currently at $372 billion, said Pru Life UK Senior Vice President and Chief Agency Officer Maria Divina Furagganan during the product launch at Radisson Blu Hotel in Cebu City. The insurance industry is valued at P100 billion at present, but if the country’s protection gap is met, premiums of around P600 billion may be generated annually. ADVERTISEMENT \nFuragganan said the protection gap exists because the industry is not focused on selling protection products while issues on financial literacy also need to be addressed. \n“We need to educate Filipinos on the need to save and protect their income. Just relying on savings is not enough. The bottomline here is education and financial literacy,” she said. \nFuragganan said they intend to get a share of the lower and middle income class market through their newest product, PRUmax invest, a life insurance product which would meet the needs of the Filipinos, “whatever their stage of life” may be. \nShe said the company’s newest offering integrates the best features of traditional and unit-linked insurance products, providing comprehensive protection coverage at the same time allowing policy holders to accumulate wealth. \n11% market share \nAs of 2015, Pru Life UK holds an 11 percent market share translating to more than 200,000 premium holders across the whole country. \nWith the launch of their newest product, Furagganan said they hope to increase the number of their policy holders by 20 percent each year. \nOne of the company’s biggest districts is in Cebu, with over eight branches and manpower of 1,500, contributing 13 percent to the firm’s total production and increasing year after year. \nPRUmax invest \nAimee dela Cruz, assistant vice president for pricing and product development, said PRUmax invest specifically targets professionals who are just starting their career, business process outsourcing employees, newly weds, and accomplished professionals targeting early retirement. \n“PRUmax invest is a 15-year renewable term plan which provides comprehensive protection coverage through the base traditional plan while also allowing the opportunity for wealth accumulation by investing in various funds through the Variable Life Rider,” she said. \nFor premium as low as P12,000 annually, policy holders can avail of a P1-million coverage and the product’s investment component under the base plan. \nAside from insurance protection, Dela Cruz said product benefits include several rider options, a choice of funds for investment, partial withdrawals, and fund switching, among others. \nIn April this year, Pru Life UK introduced Elite Protector 5 (Elite 5), a similar product but for the upper middle class market. \nAntonio Garces II, vice president for investments, said the Variable Life Rider provides policy holders with the flexibility to choose where to invest their premiums from among the company’s extensive fund portfolio for a minimum annual premium of P5,000. \nHe said that while there are mutual funds and unit investment trust funds, this is another alternative that will cater to small investors. \nPRUlink funds \nPRUlink funds are invested in a diversified portfolio of assets managed by Eastspring Investments, the Asian asset management arm of Prudential plc, Pru Life UK’s mother company. \nEastspring Investments has been managing the underlying funds of Pru Life UK’s unit-linked life insurance products in the Philippines since 2002. \nThe launch of Pru Life UK’s newest product coincides with the company’s 20th anniversary in the Philippines. \nAt present, the company has expanded its reach to over 80 branches in the country, with the biggest life agency force of 14,000 licensed agents, and has emerged as one of the top five life insurers. FOLLOW INQUIRER ON:", "external_links": [], "published": "2016-11-07T22:09:00.000+02:00", "crawled": "2016-11-07T17:30:46.728+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 8, "shares": 8, "comments": 0}, "stumbledupon": {"shares": 0}}}