{"organizations": [], "uuid": "7174e7ae7ac70b0a854aaad3fcf2d62811cfda01", "thread": {"site_full": "indianexpress.com", "main_image": "http://images.indianexpress.com/2016/11/cyrus-small.jpg?w=480", "site_section": "", "section_title": "", "url": "http://indianexpress.com/article/business/companies/cyrus-mistry-caused-enormous-harm-to-the-company-tcs-4387690/", "country": "US", "domain_rank": 598, "title": "Cyrus Mistry caused enormous harm to the company: TCS | The Indian Express", "performance_score": 0, "site": "indianexpress.com", "participants_count": 0, "title_full": "Cyrus Mistry caused enormous harm to the company: TCS | The Indian Express", "spam_score": 0.424, "site_type": "news", "published": "2016-11-21T23:47:00.000+02:00", "replies_count": 0, "uuid": "7174e7ae7ac70b0a854aaad3fcf2d62811cfda01"}, "author": "", "url": "http://indianexpress.com/article/business/companies/cyrus-mistry-caused-enormous-harm-to-the-company-tcs-4387690/", "ord_in_thread": 0, "title": "Cyrus Mistry caused enormous harm to the company: TCS | The Indian Express", "locations": [], "entities": {"persons": [{"name": "cyrus mistry", "sentiment": "none"}, {"name": "cyrus p. mistry", "sentiment": "none"}, {"name": "ishaat hussain", "sentiment": "none"}], "locations": [], "organizations": [{"name": "tcs cyrus mistry", "sentiment": "negative"}, {"name": "tcs", "sentiment": "negative"}, {"name": "tcsl", "sentiment": "none"}, {"name": "tata group", "sentiment": "none"}, {"name": "egm", "sentiment": "none"}, {"name": "mistry", "sentiment": "none"}, {"name": "tata sons", "sentiment": "none"}, {"name": "ratan tata", "sentiment": "none"}, {"name": "ousted tata", "sentiment": "none"}, {"name": "board", "sentiment": "none"}, {"name": "tata", "sentiment": "none"}, {"name": "tata consultancy services limited", "sentiment": "none"}, {"name": "indian hotels", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Cyrus Mistry caused enormous harm to the company: TCS Cyrus Mistry caused enormous harm to the company: TCS The company made the regulatory filing to inform the BSE that an extra ordinary general meeting (EGM) will be held on December 13, 2016. Published:November 21, 2016 4:47 pm Ousted Tata chairman Cyrus Mistry. (File) \nIT major Tata Consultancy Services Limited (TCSL) on Monday pointed out that Tata Sons’ ousted Chairman Cryus Mistry has caused enormous harm to the company and its shareholders. “Mistry’s conduct has caused enormous harm to the Tata group, TCSL and its stakeholders, including employees and shareholders,” the company said in a regulatory filing to the BSE. \nWatch What Else Is making News \n“Subsequent to his replacement as executive chairman of Tata Sons, Mistry has made certain unsubstantiated allegations, which cast aspersions not only on Tata Sons and its board of directors, but also on the Tata group as a whole, of which TCSL is an integral part,” the regulatory filing said under the “explanatory statement” note. \nThe company made the regulatory filing to inform the BSE that an extra ordinary general meeting (EGM) will be held on December 13, 2016. \nOn November 17, the board of directors of the IT major decided to convene an EGM to remove Mistry as a director of the company. \nEarlier, TCS issued a special notice under Section 169 (read with Section 115) of the Companies Act, 2013, and made a requisition for an EGM of shareholders to consider Mistry’s removal as a director of TCS. \nTCS has already replaced Mistry as its Chairman and appointed Ishaat Hussain as the new Chairman of the board of directors of the company with immediate effect. \n“It may be noted that the board of directors of Tata Sons has lost confidence in Cyrus P. Mistry to lead Tata Sons for a combination of several factors,” the company’s regulatory filing elaborated. \n“The Tata Sons’ board, in its collective wisdom, took the decision to replace Mistry. The Board had felt that the removal of Mistry as Chairman was absolutely necessary for the future success of the Tata group.” \nTata Sons, the holding company of the Tata Group companies, removed Mistry, 48, as its Chairman last month and reinstated Ratan Tata in an interim capacity. \nTata Sons in an earlier statement has said that ousted Chairman should resign from all group companies and deplored the manner in which Mistry has sought the support of independent directors of Indian Hotels to continue as its Chairman. Best of Express ", "external_links": [], "published": "2016-11-21T23:47:00.000+02:00", "crawled": "2016-11-21T13:44:40.636+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 39, "shares": 39, "comments": 0}, "stumbledupon": {"shares": 0}}}