{"organizations": [], "uuid": "59385e2124ebdaa7e27a41abedf3188b0eb55867", "thread": {"site_full": "www.ndtv.com", "main_image": "http://i.ndtvimg.com/i/2016-11/donald-trump_650x400_61479801557.jpg", "site_section": "http://feeds.feedburner.com/NDTV-LatestNews", "section_title": "NDTV News  -  Special", "url": "http://www.ndtv.com/world-news/white-house-warns-donald-trump-over-reversing-detente-policy-with-cuba-1631597", "country": "US", "domain_rank": 306, "title": "White House Warns Donald Trump Over Reversing Detente Policy With Cuba", "performance_score": 0, "site": "ndtv.com", "participants_count": 0, "title_full": "White House Warns Donald Trump Over Reversing Detente Policy With Cuba", "spam_score": 0.0, "site_type": "news", "published": "2016-11-29T15:02:00.000+02:00", "replies_count": 0, "uuid": "59385e2124ebdaa7e27a41abedf3188b0eb55867"}, "author": "", "url": "http://www.ndtv.com/world-news/white-house-warns-donald-trump-over-reversing-detente-policy-with-cuba-1631597", "ord_in_thread": 0, "title": "White House Warns Donald Trump Over Reversing Detente Policy With Cuba", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "negative"}, {"name": "donald t", "sentiment": "negative"}, {"name": "castro", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "barack obama.trump", "sentiment": "none"}, {"name": "josh earnest", "sentiment": "none"}, {"name": "miller", "sentiment": "none"}, {"name": "jason miller", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "fidel castro.the", "sentiment": "none"}], "locations": [{"name": "cuba", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "ireland", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}], "organizations": [{"name": "white house", "sentiment": "negative"}, {"name": "trump transition team", "sentiment": "none"}, {"name": "trump administration", "sentiment": "none"}, {"name": "white house press", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "World | Indo-Asian News Service | Updated: November 29, 2016 13:32 IST EMAIL PRINT COMMENTS Donald Trump yesterday threatened in a tweet to put an end to the detente policy with Cuba. Washington: As President-elect Donald Trump threatened to \"terminate\" the detente policy with Cuba, the White House today warned that reversing historic rapprochement would have \"significant\" diplomatic, economic and cultural costs.The policy is considered as one of the foreign policy legacies of outgoing President Barack Obama.Trump yesterday threatened in a tweet to put an end to the detente policy.\"If Cuba is unwilling to make a better deal for the Cuban people, the Cuban/American people and the US as a whole, I will terminate deal,\" Trump said in a tweet.Trump's tweet landed just as Cuba began its week-long farewell to its former leader Fidel Castro.The White House, however, was quick to warn that there are costs involved for cancelling such an agreement with Cuba, under which the two countries not only reestablished their diplomatic relationship after decades, but also resumed flights and lifted several sanctions.\"I don't think I'm gonna be in a position of predicting the future. I think what I'm merely highlighting and trying to underscore here in as much detail as possible, is that it's just not as simple as one tweet might make it seem,\" the White House Press Secretary Josh Earnest told reporters at his daily news conference.Earnest said that reversing the policy would be \"a significant economic blow\" to Cubans and was \"not as easy as a stroke of a pen\".\"That's just an objective fact when you consider how the American people and US businesses have implemented this deal in a way that has provided significant benefits to the American people and provided significant benefits to the Cuban people,\" he said.\"All of that would be undone by the reinstitution of a policy that has failed after having been in place for more than five decades. There are significant diplomatic, economic, cultural costs that will have to be accounted for if this policy is rolled back. This is among the many significant challenges that the incoming administration will have to carefully consider,\" Earnest said.After realising that the five decades old policy was not working, Obama two years ago announced to begin normalising relations between the two countries.\"This was rooted in the President's conclusion that a policy of isolation that the US had pursued for more than five decades had failed to bring about the improved human rights climate that I think just about every American citizen would like to see in Cuba. And after five decades of trying the same policy of isolation without seeing many results, the president believed it was time to try something different,\" he said.The new Cuba policy has benefited the American people in a tangible way and it continues to be strongly supported by an overwhelming majority of Cubans when they're asked about their opinion of this change in our policy.\"It's something that was very warmly welcomed by the Cuban people and I think that should be a pretty good indication of the kind of success that this policy is already having,\" Earnest said.Earlier in the morning, the Trump Transition Team communications director Jason Miller said though the tragedies, deaths and pain caused by Castro cannot be erased, the Trump Administration will do all it can to ensure the Cuban people can finally begin their journey toward prosperity and liberty.Miller said Cuba is a very complex topic and the president-elect is aware of the nuances and complexities regarding the challenges that Ireland and the Cuban people face.\"So this will be an issue that he addresses once he becomes president, but I wouldn't qualify it as far as changing up or down. I'd say this has been an important issue, it will continue to be one, and to be clear, the president-elect wants to see freedom in Cuba for the Cubans and a good deal for Americans where we aren't played for fools,\" he said.\"Our priorities are the release of political prisoners, return of fugitives from American law, and also political and religious freedoms for all Cubans living in oppression,\" Miller told reporters during a conference call. Trending", "external_links": [], "published": "2016-11-29T15:02:00.000+02:00", "crawled": "2016-11-29T10:28:21.647+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}