{"organizations": [], "uuid": "730dbf40b41ce4e0d51a5208dd5f5a0028abf92d", "thread": {"site_full": "news.yahoo.com", "main_image": "http://www.rocketnews.com/wp-content/uploads/2016/11/s.yimg_.comosmitmediamsocialimagessocial_default_logo-1481777-761a8f517ee2bbfb6dadb4f7c9a31f60ad069c9e-942.png", "site_section": "http://www.rocketnews.com/category/religion/feed/", "section_title": "Religion – RocketNews |Top News Stories From Around the Globe", "url": "http://news.yahoo.com/venezuela-opposition-says-vatican-brokered-talks-frozen-162302992.html", "country": "US", "domain_rank": 5, "title": "Venezuela opposition says Vatican-brokered talks 'frozen'", "performance_score": 0, "site": "yahoo.com", "participants_count": 1, "title_full": "Venezuela opposition says Vatican-brokered talks 'frozen'", "spam_score": 0.0, "site_type": "news", "published": "2016-11-23T23:59:00.000+02:00", "replies_count": 0, "uuid": "730dbf40b41ce4e0d51a5208dd5f5a0028abf92d"}, "author": "Editor - Religion News", "url": "http://news.yahoo.com/venezuela-opposition-says-vatican-brokered-talks-frozen-162302992.html", "ord_in_thread": 0, "title": "Venezuela opposition says Vatican-brokered talks 'frozen'", "locations": [], "entities": {"persons": [{"name": "corina pons", "sentiment": "negative"}, {"name": "alexandra ulmer", "sentiment": "negative"}, {"name": "jesus torrealba", "sentiment": "none"}, {"name": "jonathan oatis", "sentiment": "none"}, {"name": "maduro", "sentiment": "none"}, {"name": "lisa von ahn", "sentiment": "none"}, {"name": "cilia flores", "sentiment": "none"}, {"name": "nicolas maduro", "sentiment": "none"}], "locations": [{"name": "caracas", "sentiment": "none"}, {"name": "venezuela", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}], "organizations": [{"name": "reuters", "sentiment": "negative"}, {"name": "national assembly", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  By Corina Pons and Alexandra Ulmer CARACAS (Reuters) – Venezuela’s opposition said on Wednesday that talks with the government were “frozen” after officials failed to attend meetings the previous day, throwing cold water on Vatican-brokered attempts to bridge the country’s deep political crisis. Though the formal talks started last month appeared linked to the release of a handful of detained activists in past weeks, hopes for real rapprochement were always slim. The two sides are fundamentally at loggerheads, with the opposition seeking the ouster of Socialist President Nicolas Maduro, while authorities vow he will not leave office before his term ends in 2019. Opposition activists suggested Maduro backed away from the talks after the National Assembly on Tuesday held a heated session in which they slammed him over a drug scandal involving his family. Two nephews of Cilia Flores, Maduro’s wife and a ruling party lawmaker, were found guilty this month on U.S. charges that they tried to carry out a multimillion-dollar drug deal to obtain a large amount of cash to help their family stay in power. “The government, in an irresponsible manner, froze the dialogue process by not showing up to two technical meetings last night,” the leader of the opposition coalition, Jesus Torrealba, told Reuters. The government did not immediately respond to a request for comment about the state of dialogue with the opposition. It was not clear if the talks could be revived, or if the opposition would resume a more militant agenda, which before the talks included street protests and a plan to put Maduro on trial before the National Assembly. Dialogue had divided parts of the diverse opposition coalition, with some activists feeling the government was using them to buy time without making any real concessions. Previous sit-downs in recent years eased some tensions in the streets, but also showed little progress on core issues. The situation in oil-rich Venezuela has worsened in the past few months, with a recession leaving millions unable to find or afford food amid shortages and spiraling inflation. The opposition blames Maduro, who is unpopular, for the crisis, and has been vying to remove him via a recall referendum. The former bus driver and union leader, however, has said the opposition is actually seeking to foment a veiled coup against him and has vowed to see out his term through 2019. (Writing by Alexandra Ulmer; Editing by Lisa Von Ahn and Jonathan Oatis) Share This:", "external_links": [], "published": "2016-11-23T23:59:00.000+02:00", "crawled": "2016-11-24T13:59:07.480+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}