{"organizations": [], "uuid": "74cb2d3d0e1001528f3538ac2d3c19a30b0f28ad", "thread": {"site_full": "lifestyle.inquirer.net", "main_image": "https://www.inquirer.net/wp-content/uploads/2016/10/new-inq-fb-def.jpg", "site_section": "http://lifestyle.inquirer.net/feed/", "section_title": "Inquirer lifestyle", "url": "http://lifestyle.inquirer.net/244616/not-newborn-babies/", "country": "US", "domain_rank": 813, "title": "Not all newborn babies are the same", "performance_score": 0, "site": "inquirer.net", "participants_count": 1, "title_full": "Not all newborn babies are the same", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:28:00.000+02:00", "replies_count": 0, "uuid": "74cb2d3d0e1001528f3538ac2d3c19a30b0f28ad"}, "author": "lalos", "url": "http://lifestyle.inquirer.net/244616/not-newborn-babies/", "ord_in_thread": 0, "title": "Not all newborn babies are the same", "locations": [], "entities": {"persons": [{"name": "erma bombeck", "sentiment": "none"}, {"name": "bombeck", "sentiment": "none"}, {"name": "leia", "sentiment": "none"}, {"name": "anna", "sentiment": "none"}], "locations": [{"name": "san francisco", "sentiment": "none"}, {"name": "2nd avenue", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "manila nostalgia", "sentiment": "none"}], "organizations": [{"name": "facebook", "sentiment": "none"}, {"name": "google", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  03:28   \nI got an e-mail from a friend in San Francisco, congratulating me on the birth of my sixth great grandchild. She also happily announced that soon she, too, would see the start of her own fourth generation. \nMany years ago she had described in full detail the birth of Anna, her only granddaughter; and now Anna will be a mommy herself. Truly time flies. \nShe asked me if I thought it was possible to send a yaya to the United States. “Anna is having a difficult pregnancy. She works and will never manage without one,” she said. I told her my guess was that the chances of getting a visa are “next to none.” She was crushed. ADVERTISEMENT \nI thought of my daughters who have “been there, done that” in the land of no yayas. I remember worrying and wishing I could be there to help them. But they did extremely well. Here at home, with extended family and live-in nannies, we have an enviable situation. \nHaving babies anywhere is not easy. They are not born with a book of instructions. But today, there is enough “how to” information available on the Internet to make it better for new parents. You can actually Google colic, the hiccups, and rashes. \nStill, a new mother feels anxious, insecure and a bit overwhelmed. Still sore from childbirth and painfully sleep-deprived, she has to be ready to feed on demand, has many new responsibilities and little or no “me time.” Strange hormones make her emotional; she gets the baby blues, and her tears are hard to explain. \nPerfect remedy \nNot all newborn babies are the same. Ours is almost three weeks old. She loves to be rocked and carried but is unhappy on a road trip, however short. \nMost infants are lulled to sleep by a car ride. I remember my neighbor on 2nd Avenue had the perfect remedy for her fussy baby. When everything else failed, she would put her tiny son in a baby carrier on top of the clothes dryer set on tumble dry. Almost immediately the crying became a whimper, and soon he was fast asleep. \nI guess our little Leia needs a few more car rides to get used to the motion. \nA mother, at any age, can look back and remember the tears and fears of childbearing. But she will also tell you of the unspeakable joy that made it all worthwhile. \nOne of my favorite authors is American humorist Erma Bombeck, who wrote funny and poignant articles and best-selling books about living. She is especially known for her views on motherhood. Shortly before she died, Bombeck wrote “If I Had My Life to Live Over.” And she had this to say about expecting a child: \n“Instead of wishing away nine months of pregnancy and complaining about the shadow over my feet, I’d have cherished every minute of it and realized that the wonderment growing inside me was to be my only chance in life to assist God in a miracle.” \nThe present darkness \nThe US election results seem to have turned the world upside down. We have seen the “not so nice” side of people. From Day 1, haters and bashers from both sides came out swinging. After the count, it got vicious. \nThe scene brought to mind my father’s favorite mantra. It was about winning and losing: “Peor que el mal perdedor es el que no sabe ser noble cuando gana.” (Worse than a bad loser is he who does not know how to be noble when he wins.) \nIn the last week or so, the fury has not abated. Well, maybe it has toned down a bit. While it is encouraging to know that so many can be genuinely passionate about their cause, it is also disheartening to see their lack of grace. Whatever happened to kindness? \nFacebook has become a battleground. Sometimes it smells like a sewer. I am tired of having to wade through garbage just to read my Manila Nostalgia. \nWe made this mess. Let’s clean it up. Will we continue to be agents of ugliness? There is enough bitterness out there that we can’t do anything about. \nTurn it around. Post positive. Share hope. Help! It is dark here. Can anyone bring some light? \nWhen God created the world it was all good. How did it get to this? \nIf I had bet money on the elections, both here and in the US, I would have lost my shirt. I spent some time licking my wounds. I felt shortchanged. Disappointed. Disgusted. Scared. I still am. \nBut I believe my God is in control. Yes, His eyes are on the sparrow. He makes the sun rise in the morning. And I trust Him. \n\nSupermoon \nWasn’t it spectacular? I went out to the backyard Monday night holding my phone, hoping to take pictures, maybe a video. I didn’t do either. \nThe house and garden lights were on. They distracted me. I turned everything off including the Christmas tree—and my phone. \nThen I looked up at the heavens and gazed at the most awesome full moon I have seen in all my years. There it was, shining bright and serene, soaring, sailing across the cloudless night sky. \nAnd I thought—so it must be with God. \nWe need to turn the world off. Its sights and sounds are here only to confound and confuse us. \nBut in the stillness, when He calls, we will hear His voice. In the darkest night, we can seek His face.", "external_links": [], "published": "2016-11-20T02:28:00.000+02:00", "crawled": "2016-11-19T21:35:11.093+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}