{"organizations": [], "uuid": "2a62ac27af0160fa4aeaa32ff0491d8283cad8ab", "thread": {"site_full": "www.reddit.com", "main_image": "http://i.imgur.com/DUX7c3Z.jpg", "site_section": "", "section_title": "", "url": "https://www.reddit.com/r/mildlyinteresting/comments/5fdxkk/the_cars_in_my_apartment_carport_are_grouped_by/", "country": "US", "domain_rank": 33, "title": "The cars in my apartment carport are grouped by color : mildlyinteresting", "performance_score": 0, "site": "reddit.com", "participants_count": 0, "title_full": "The cars in my apartment carport are grouped by color : mildlyinteresting", "spam_score": 0.762, "site_type": "news", "published": "2016-11-29T03:13:00.000+02:00", "replies_count": 0, "uuid": "2a62ac27af0160fa4aeaa32ff0491d8283cad8ab"}, "author": "", "url": "https://www.reddit.com/r/mildlyinteresting/comments/5fdxkk/the_cars_in_my_apartment_carport_are_grouped_by/", "ord_in_thread": 0, "title": "The cars in my apartment carport are grouped by color : mildlyinteresting", "locations": [], "entities": {"persons": [], "locations": [], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "unsubscribe subscribe 9,518,480 readers 2,522 users here now \nAww, cripes. I didn't know I'd have to write a description. How many words is that so far, like a hundred? Soooo, yeah. Mildly interesting stuff. Stuff that interests you. Mildly. It's in the name, ffs. \nDoes your post qualify for /r/MildlyInteresting? Hover below for more info. 1. No memes \nThis includes references in titles of your post (e.g. \"banana for scale,\"\"potato quality\"). 2. Related posts must be in the comments of the original \nPosts that acknowledge, \"one-up,\" or relate specifically to another post are not allowed (e.g. \"I see your X and raise you Y\") 3. No x-posts or reposts \nDo not post something that has been submitted to reddit before, even if you were the one who posted it. 4. Original [OC] photographs only \na. All submissions must be non-animated photographs. \nb. All submissions must be original content. If you didn't take the picture, don't post it. \nc. Overlaid text, arrows, scribbles, and other substantive edits are not allowed. You may censor personal information per Reddit-wide rules. \nd. Side by side images are okay if they adhere to the rest of the rules. 5. No screenshots \nWe define a screenshot as a screen grab (including a picture) of a television, phone, or computer screen. Try /r/screenshots ! 6. Titles must be an exact but concise description of the content \na. Titles must not contain jokes, backstory, or other fluff. That information belongs in a follow-up comment. \nb. Titles must exactly describe the content. It should act as a \"spoiler\" for the image. If your title leaves people surprised at the content within, it breaks the rule! \nc. Titles must not contain emoticons, emojis, or special characters unless they are absolutely necessary in describing the image. \nE.g. ( ͡° ͜ʖ ͡°), :P, 😜, 💯, ❤, ★, ✿ \nStill confused? For more elaboration and examples, see here first and then message the mods if you still have questions. \nIf unsure, please message the mods and we will help determine if your post is acceptable. \nPosts which break the rules will be removed on sight. This subreddit operates a three-strikes rule on submission bans, and instant bans on troll gimmick accounts, shock links, etc. at moderator discretion. createdbydoginabathtub a community for 4 years ", "external_links": [], "published": "2016-11-29T03:13:00.000+02:00", "crawled": "2016-11-28T22:50:46.906+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}