{"organizations": [], "uuid": "6093a33800bee01c8a45d2d6965a66314ad13305", "thread": {"site_full": "www.nytimes.com", "main_image": "https://static01.nyt.com/images/2014/11/01/opinion/douthat-circular/douthat-circular-facebookJumbo-v2.jpg", "site_section": "http://topics.nytimes.com/top/opinion/editorialsandoped/oped/columnists/rossdouthat/index.html?rss=1", "section_title": "Ross Douthat", "url": "http://www.nytimes.com/2016/11/20/opinion/sunday/the-crisis-for-liberalism.html", "country": "US", "domain_rank": 98, "title": "The Crisis for Liberalism", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "The Crisis for Liberalism", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:30:00.000+02:00", "replies_count": 0, "uuid": "6093a33800bee01c8a45d2d6965a66314ad13305"}, "author": "ROSS DOUTHAT", "url": "http://www.nytimes.com/2016/11/20/opinion/sunday/the-crisis-for-liberalism.html", "ord_in_thread": 0, "title": "The Crisis for Liberalism", "locations": [], "entities": {"persons": [{"name": "john lennon", "sentiment": "none"}, {"name": "karl marx", "sentiment": "none"}, {"name": "john stuart mill", "sentiment": "none"}, {"name": "maureen dowd", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}], "organizations": [{"name": "new york times opinion", "sentiment": "none"}, {"name": "facebook", "sentiment": "none"}, {"name": "social gospellers", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Privacy Policy But liberal societies have always depended on an illiberal or pre-liberal substructure to answer the varied human needs — meaning, belonging, a vertical dimension to human life, a hope against mortality — that neither John Stuart Mill nor Karl Marx adequately addressed. In American history, that substructure took various forms: The bonds of family life, the power of (usually Protestant) religion, a flag-waving patriotism, and an Anglo-Saxon culture to which immigrants were expected to assimilate. Each of these foundations often manifested illiberalism’s evils: religious intolerance, racism and chauvinism, the oppressions of private and domestic power. But they also provided the moral, cultural and metaphysical common ground that political reformers — abolitionists, Social Gospellers, New Dealers, civil rights marchers — relied upon to expand liberalism’s promise. Much of post-1960s liberal politics, by contrast, has been an experiment in cutting Western societies loose from those foundations, set to the tune of John Lennon’s “Imagine.” No heaven or religion, no countries or borders or parochial loyalties of any kind — these are often the values of the center-left and the far left alike, of neoliberals hoping to manage global capitalism and neo-Marxists hoping to transcend it. Unfortunately the values of “Imagine” are simply not sufficient to the needs of human life. People have a desire for solidarity that cosmopolitanism does not satisfy, immaterial interests that redistribution cannot meet, a yearning for the sacred that secularism cannot answer. So where religion atrophies, family weakens and patriotism ebbs, other forms of group identity inevitably assert themselves. It is not a coincidence that identity politics are particularly potent on elite college campuses, the most self-consciously post-religious and post-nationalist of institutions; nor is it a coincidence that recent outpourings of campus protest and activism and speech policing and sexual moralizing so often resemble religious revivalism . The contemporary college student lives most fully in the Lennonist utopia that post-’60s liberalism sought to build, and often finds it unconsoling: She wants a sense of belonging, a ground for personal morality, and a higher horizon of justice than either a purely procedural or a strictly material politics supplies. Thus it may not be enough for today’s liberalism, confronting both a right-wing nationalism and its own internal contradictions, to deal with identity politics’ political weaknesses by becoming more populist and less politically correct. Both of these would be desirable changes, but they would leave many human needs unmet. For those, a deeper vision than mere liberalism is still required — something like “for God and home and country,” as reactionary as that phrase may sound. \nAdvertisement It is reactionary, but then it is precisely older, foundational things that today’s liberalism has lost. Until it finds them again, it will face tribalism within its coalition and Trumpism from without, and it will struggle to tame either. \nMaureen Dowd is off today. \nI invite you to follow me on Twitter (@DouthatNYT) . \nFollow The New York Times Opinion section on Facebook and Twitter (@NYTopinion) , and sign up for the Opinion Today newsletter . A version of this op-ed appears in print on November 20, 2016, on page SR11 of the New York edition with the headline: The Crisis for Liberalism. Today's Paper | Subscribe", "external_links": [], "published": "2016-11-20T02:30:00.000+02:00", "crawled": "2016-11-19T22:23:34.009+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}