{"organizations": [], "uuid": "74c5d46d9c0a2d6bd080cf3536b66703fee4d2c8", "thread": {"site_full": "www.marketwatch.com", "main_image": "http://s.marketwatch.com/public/resources/MWimages/MW-EH836_money__MG_20160314131032.jpg", "site_section": "http://www.marketwatch.com/subjects/united-states-attorneys?prop=location&propval=asia%20pacific", "section_title": "United States Attorneys - MarketWatch.com Topics", "url": "http://www.marketwatch.com/story/my-husband-asked-me-to-give-up-rights-to-our-home-a-decade-ago-and-now-were-divorcing-2016-11-02", "country": "US", "domain_rank": 900, "title": "My husband asked me to give up rights to our home a decade ago — and now we’re divorcing - MarketWatch", "performance_score": 0, "site": "marketwatch.com", "participants_count": 1, "title_full": "My husband asked me to give up rights to our home a decade ago — and now we’re divorcing - MarketWatch", "spam_score": 0.012, "site_type": "news", "published": "2016-11-02T02:00:00.000+02:00", "replies_count": 0, "uuid": "74c5d46d9c0a2d6bd080cf3536b66703fee4d2c8"}, "author": "Quentin Fottrell", "url": "http://www.marketwatch.com/story/my-husband-asked-me-to-give-up-rights-to-our-home-a-decade-ago-and-now-were-divorcing-2016-11-02", "ord_in_thread": 0, "title": "My husband asked me to give up rights to our home a decade ago — and now we’re divorcing - MarketWatch", "locations": [], "entities": {"persons": [{"name": "marketwatch dear moneyologist", "sentiment": "negative"}, {"name": "richard denner", "sentiment": "none"}], "locations": [{"name": "california", "sentiment": "none"}, {"name": "california dear beverly", "sentiment": "none"}, {"name": "idaho", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "arizona", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "new mexico", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "beverly", "sentiment": "none"}], "organizations": []}, "highlightText": "", "language": "english", "persons": [], "text": "Dear Moneyologist,\nMy husband and I have been married 14 years. We live in California and I am contemplating divorce. I am 62 and he is 65. When we married, he owned a home (with a mortgage) purchased five years prior. A few years into our marriage, when interest rates fell, he refinanced the home. A couple of days before submitting the application, he asked me to sign an inter-spousal transfer of ownership (known as a quitclaim).\nThe reason: He said I had a student loan which had at one time been in default and we would not be able to receive a good interest rate, or that the loan might be altogether denied. He promised that as soon as the loan was approved, he would follow up by putting me back on title.\nDon’t miss: My wife gives our wayward son $25,000 a year — what should I do?\nA few weeks later, we purchased a second home (cabin). Just a few minutes before going in to finalize the purchase, he asked to sign another quitclaim, citing the same circumstances. The mortgage on the cabin is underwater at this time.\nIt has been 14 years since this happened, and he refuses to add me to the title. He finally admitted that he indeed had an ulterior motive, as he witnessed a friend who underwent a divorce and lost a house to his former spouse and that he was not going to be “taken advantage of” if we divorced.\nWhat are my options? I feel that I was deceived and that this constitutes fraud. About 90% of his investments were made before we were married, and I am also aware that he has made no provisions for me in his will nor named me as a beneficiary to his life insurance.\nBeverly in California\nDear Beverly,\nThe investments he had prior to your marriage belong to your husband and he is free to name anyone from the next-door neighbor to the window cleaner on his life insurance. Now, the good news:\nCalifornia — in addition to Arizona, Idaho, Louisiana, Texas, Nevada, New Mexico and Washington — treat all marital assets as community property. That means that assets acquired during the marriage are divided equally between the two spouses. “Notwithstanding an agreement otherwise, upon the death of a married person, one-half of the community property belongs to the surviving spouse and the other half belongs to the decedent,” according to California Probate Code Section 100(a). Why is that important to you? Because the refinancing of this home and the purchase of the cabin were made during your marriage, so it’s irrelevant whether your husband had you sign a quitclaim or not.\nRead: I will disinherit my daughter if she marries this man\nWell, not quite. A judge could look unfavorably on your husband’s behavior and your testimony (if you don’t have it in an email) that your husband did this because he wanted to prevent you from even owning the property you both bought during your marriage. There is a precedent for this: In 1996, a California woman won $1.3 million in the lottery and filed for divorce 11 days later without even telling her husband or anyone else about her windfall. A couple of years later her husband discovered her deception and sued. Superior Court Judge Richard Denner ruled that she acted out of fraud or malice and awarded her husband all of her winnings. A judge could, in theory, take a similar view and punish your husband.\nYour husband’s shady behavior could end up doing him more harm than good in any divorce settlement. There are a lot of good, honest people out there waiting for you post-divorce.\nDo you have questions about inheritance, tipping, weddings, family feuds, friends or any tricky issues relating to manners and money? Send them to The Moneyologist and please include the state where you live (no full names will be used).\nWould you like to sign up to an email alert when a new Moneyologist column has been published? If so, click on this link.\nMore from the Moneyologist My dad didn’t love me! He only left me $10,000 My elderly mother gives my sister more money than me My sister hid my mom in a nursing home and cheated me out of my inheritance", "external_links": [], "published": "2016-11-02T02:00:00.000+02:00", "crawled": "2016-11-02T11:35:47.681+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 10, "shares": 10, "comments": 0}, "stumbledupon": {"shares": 0}}}