{"organizations": [], "uuid": "ba50f2416c4cb3e2c3c6e21efe0d79ae33d55a0c", "thread": {"site_full": "www.reuters.com", "main_image": "http://s4.reutersmedia.net/resources_v2/images/rcom-default.png", "site_section": "", "section_title": "", "url": "http://www.reuters.com/article/time-warner-ma-att-trump-idUSL1N1DA234", "country": "US", "domain_rank": 408, "title": "Trump victory clouds outlook for Time Warner-AT&T, other mergers | Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Trump victory clouds outlook for Time Warner-AT&T, other mergers | Reuters", "spam_score": 0.005, "site_type": "news", "published": "2016-11-10T06:09:00.000+02:00", "replies_count": 0, "uuid": "ba50f2416c4cb3e2c3c6e21efe0d79ae33d55a0c"}, "author": "Diane Bartz", "url": "http://www.reuters.com/article/time-warner-ma-att-trump-idUSL1N1DA234", "ord_in_thread": 0, "title": "Trump victory clouds outlook for Time Warner-AT&T, other mergers | Reuters", "locations": [], "entities": {"persons": [{"name": "trump", "sentiment": "negative"}, {"name": "richard kleindienst", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "nixon", "sentiment": "none"}, {"name": "richard nixon", "sentiment": "none"}, {"name": "john stephens", "sentiment": "none"}, {"name": "bloom", "sentiment": "none"}, {"name": "roy behren", "sentiment": "none"}, {"name": "johs worsoe", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "chaplin", "sentiment": "none"}, {"name": "jonathan chaplin", "sentiment": "none"}, {"name": "seth bloom", "sentiment": "none"}, {"name": "diane bartz", "sentiment": "none"}, {"name": "kleindienst", "sentiment": "none"}], "locations": [{"name": "hong kong", "sentiment": "none"}, {"name": "shanghai", "sentiment": "none"}, {"name": "americas", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "olivia oran", "sentiment": "none"}, {"name": "china", "sentiment": "none"}], "organizations": [{"name": "est trump", "sentiment": "negative"}, {"name": "reuters credit", "sentiment": "negative"}, {"name": "time warner-at&t", "sentiment": "neutral"}, {"name": "verizon", "sentiment": "none"}, {"name": "goldman sachs", "sentiment": "none"}, {"name": "hbo", "sentiment": "none"}, {"name": "warner bros", "sentiment": "none"}, {"name": "justice department", "sentiment": "none"}, {"name": "bayer", "sentiment": "none"}, {"name": "federal trade commission", "sentiment": "none"}, {"name": "pllc", "sentiment": "none"}, {"name": "at&t inc", "sentiment": "none"}, {"name": "monsanto", "sentiment": "none"}, {"name": "time warner inc", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "anthem", "sentiment": "none"}, {"name": "at&t", "sentiment": "none"}, {"name": "s&p", "sentiment": "none"}, {"name": "ftc", "sentiment": "none"}, {"name": "dupont", "sentiment": "none"}, {"name": "dow chemical", "sentiment": "none"}, {"name": "time warner", "sentiment": "none"}, {"name": "mufg", "sentiment": "none"}, {"name": "u.s. justice department", "sentiment": "none"}, {"name": "international telephone and telegraph corp", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "cigna", "sentiment": "none"}, {"name": "humana", "sentiment": "none"}, {"name": "walgreens", "sentiment": "none"}, {"name": "jefferies", "sentiment": "none"}, {"name": "new york times", "sentiment": "none"}, {"name": "comcast", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "washington post", "sentiment": "none"}, {"name": "amazon", "sentiment": "none"}, {"name": "nbc universal", "sentiment": "none"}, {"name": "westchester capital management", "sentiment": "none"}, {"name": "aetna", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Credit RSS | Wed Nov 9, 2016 | 6:09pm EST Trump victory clouds outlook for Time Warner-AT&T, other mergers By Diane Bartz and Olivia Oran | WASHINGTON/NEW YORK \nWASHINGTON/NEW YORK U.S. corporate dealmakers were likely to put major merger plans on hold as they assess whether President-elect Donald Trump will follow through on his populist promises and a threat to block AT&T Inc's purchase of Time Warner Inc, or act more like traditional business-friendly Republicans. \nTrump's rhetoric and the personal nature of the campaign, which included little discussion of policy, left many uncertain about the new U.S. leader's plans, including how his administration will handle mega-mergers. \nWall Street braced for a drop in deals, with Goldman Sachs on Wednesday projecting a 20 to 30 percent downside for earnings of banks that focus on merger and acquisition advice, and Jefferies saying uncertainty about Trump's policy on trade, healthcare, taxes and energy could hamper underwriting activity and M&A globally. \n\"I think a lot of deals will hit the pause button for a bit until we get some clarity on whether President Trump will moderate or be as disruptive as some expect,\" said a senior Wall Street banker who asked not to be named because he was not authorized to speak with the media. \n\"It's going to be a tough environment for everything until we see how (Trump) behaves as a leader,\" the banker added. \nTrump said in October that AT&T's proposed $85 billion acquisition of the owner of HBO, CNN and the Warner Bros film studio would put too much power in the hands of one company, and that he would block a deal. \nThe gap between Time Warner shares and the implied value of AT&T's cash and stock bid was over 23 percent in afternoon trading on Wednesday, compared with around 22 percent at Tuesday's close, indicating greater investor skepticism that the companies will be able to complete the transaction. \nIn addition to criticizing AT&T's deal with Time Warner, owner of CNN, Trump has said he would look to break up Comcast's deal to buy NBC Universal, which closed in 2013. He has also threatened antitrust action against Amazon, which owns the Washington Post. \nAll three news organizations have had spats with the president-elect, raising concern in Washington that Trump may use antitrust law to avenge personal slights, said an antitrust expert who asked not to be named to protect business relationships. \n\"That's a fear. That's a legitimate fear,\" added Seth Bloom of Bloom Strategic Counsel, PLLC, who said presidents tended not to weigh in on specific decisions by antitrust enforcers. \n\"The last president to try to do that was Richard Nixon,\" said Bloom, referring to a Nixon attorney general, Richard Kleindienst, who was convicted of falsely testifying to Congress that the White House had not meddled with an antitrust probe of International Telephone and Telegraph Corp, according to Kleindienst's obituary in the New York Times. \nPOPULIST OR PRO-BUSINESS REPUBLICAN? \nStill, some investors believed the man who considers himself business friendly would take a more moderate tone once he assumes office in January. \n\"We think Trump will be pretty good for merger and acquisition activity. As a general proposition, he is pro-business and pro-free market,\" said Roy Behren, portfolio manager at Westchester Capital Management. \nOther big pending U.S. deals also did not see sharp changes in prices on Wednesday, and the spreads of three healthcare deals that have encountered antitrust troubles, Aetna -Humana, Anthem -Cigna and Walgreens -Rite Aid, actually narrowed, signaling investors may think they are more likely to close under a Trump administration. \nThe president does not directly decide if a merger is illegal under antitrust law. That is done by the U.S. Justice Department or Federal Trade Commission, which divide up the work of assessing mergers. If one of the agencies decides to stop a deal, it must convince a judge to agree. \nAT&T Chief Financial Officer John Stephens said on Wednesday his company was looking forward to working with Trump and was \"optimistic\" regulators would approve the deal. \nTime Warner's shares were last down 1 percent to $86.71, after trading as low as $85.60, while AT&T shares were up just under 1 percent at $37.24. The Dow and S&P 500 were both over 1 percent higher in late afternoon trading. \nMEDIA CONSOLIDATION IN FOCUS \nThe fate of the AT&T deal as well as several other large mergers, including the proposed combinations of Dow Chemical and DuPont, and Bayer and Monsanto , will ultimately be decided by Trump's nominees to lead antitrust enforcement at the Justice Department and the FTC. \n\"The deal is now more likely than not to be blocked. After all, it is rare for a presidential candidate to comment on such things during a campaign, but when that happens, the team he assembles generally take such statements as commands,\" New Street analyst Jonathan Chaplin said of the AT&T-Time Warner deal. \nChaplin said Trump's concerns appeared to be focused on media consolidation rather than on other sectors, and a failure of the AT&T deal would likely discourage other distribution companies from pursuing takeovers of a media company. \n\"We also believe that Trump may look at antitrust options for addressing consolidation in the tech community. Tech was overwhelming in its support of Clinton, something we suspect Trump knows and will remember,\" Chaplin wrote in a note, referring to Democratic candidate Hillary Clinton. \nTelecom companies, such as AT&T and Verizon, are seeing their core businesses shrink. That has increased the appetite of telecom companies to buy media firms as they try to get hold of valuable content and diversify their revenue streams. \nAT&T's plan to buy Time Warner was expected to spark a new round of industry consolidation and give rise to deals that combine digital distribution and content. \nTrump's protectionist stance also raises the risk that some foreign corporations, including from China, may face higher hurdles in trying to take over American companies, dealmakers said. \n\"If you were thinking about doing a cross-border deal six months ago you weren't considering things like potential trade barriers, protectionism and tariffs. These are things you have to at least develop a view on and factor into the risk assessment of doing an overseas deal now,\" said Johs Worsoe, MUFG's head of investment banking & markets in the Americas. Next In Credit RSS Hong Kong stocks jump as Trump fears ebb; China also up \nSHANGHAI, Nov 10 Hong Kong stocks rebounded on Thursday morning from a 3-month low hit in the previous day, as they joined a surprise turnaround in global markets in the wake of a shock win for Republican Donald Trump in the U.S. presidential election. ", "external_links": [], "published": "2016-11-10T06:09:00.000+02:00", "crawled": "2016-11-10T07:34:49.804+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 11}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 1}, "facebook": {"likes": 6, "shares": 6, "comments": 0}, "stumbledupon": {"shares": 0}}}