{"organizations": [], "uuid": "b8b0ae8ea5162167dd453248b1dcf8d97882366a", "thread": {"site_full": "lifestyle.inquirer.net", "main_image": "http://lifestyle.inquirer.net/files/2016/11/t1120sm-marikina_1-660x441.jpg", "site_section": "http://lifestyle.inquirer.net/feed/", "section_title": "Inquirer lifestyle", "url": "http://lifestyle.inquirer.net/244625/sm-city-marikina-sm-city-san-mateo-bring-shopping-fun-east-metro/", "country": "US", "domain_rank": 813, "title": "SM City Marikina and SM City San Mateo bring shopping fun east of metro", "performance_score": 0, "site": "inquirer.net", "participants_count": 1, "title_full": "SM City Marikina and SM City San Mateo bring shopping fun east of metro", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:37:00.000+02:00", "replies_count": 0, "uuid": "b8b0ae8ea5162167dd453248b1dcf8d97882366a"}, "author": "lalos", "url": "http://lifestyle.inquirer.net/244625/sm-city-marikina-sm-city-san-mateo-bring-shopping-fun-east-metro/", "ord_in_thread": 0, "title": "SM City Marikina and SM City San Mateo bring shopping fun east of metro", "locations": [], "entities": {"persons": [{"name": "giordano", "sentiment": "none"}, {"name": "auntie anne", "sentiment": "none"}], "locations": [{"name": "marikina", "sentiment": "none"}, {"name": "sm city san mateo", "sentiment": "none"}, {"name": "philippines", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "marcos highway", "sentiment": "none"}, {"name": "marikina city", "sentiment": "none"}, {"name": "sm city marikina", "sentiment": "none"}, {"name": "metro", "sentiment": "none"}, {"name": "manila", "sentiment": "none"}, {"name": "barangay calumpang", "sentiment": "none"}, {"name": "atrium", "sentiment": "none"}], "organizations": [{"name": "starbucks", "sentiment": "none"}, {"name": "crocs", "sentiment": "none"}, {"name": "payless shoe store", "sentiment": "none"}, {"name": "sm foodcourt", "sentiment": "none"}, {"name": "sm city marikina", "sentiment": "none"}, {"name": "burgoo", "sentiment": "none"}, {"name": "kfc", "sentiment": "none"}, {"name": "coffee beanery", "sentiment": "none"}, {"name": "sm store", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "  03:37   SM City Marikina was designed with a modern Asian touch; the grand entrance features an interplay of glass and steel. \nTwo malls in the east Metro area—SM City Marikina and SM City San Mateo—show how SM has become part of the lives of residents in rapidly developing urban areas. \nNot only have these malls become destinations for world-class shopping, leisure and entertainment, they have also become catalysts for growth, employment and business opportunities in these communities. \nSM’s presence in Marikina is significant because the company started out as a shoe store in downtown Manila. And Marikina is known as the shoe capital of the Philippines, with skilled artisans who gave rise to a vibrant shoe industry in the 20th century. ADVERTISEMENT \nA lush valley surrounded by scenic mountain ranges and a flowing river, Marikina is today a multi-awarded metropolitan city, often cited for its dynamic economy, as well as for its government’s efforts toward sustainable urban development and effective public service. SM City Marikina’s interior highlights a spacious area with colorful high ceilings and circle accents. For the holidays, the mall’s Atrium area features the Magical Shopkins World of Christmas. \nWith its grand elevated entrance, high ceilings, interplay of glass, steel, and Modern Asian touches, SM City Marikina has become a landmark since it opened in 2008. \nRecently renovated and updated, the 125,000-square meter mall is located at a 59,000-sq m site on Marcos Highway, Barangay Calumpang in Marikina City. Shopping is fun at the mall’s major anchors—the SM Store and Supermarket, as well as its mainstays among an exciting mix of global and homegrown tenants. \nTop global brands Uniqlo, All Flip Flops, Giordano, Payless Shoe Store and Timberland can be found in the mall, alongside homegrown tenants such as Suy’s Bags. Tech lovers will also have fun at the mall’s Cyberzone featuring the latest computers, gadgets and telco innovations. \nSM City Marikina has great food choices. At the SM Foodcourt, local and international fast-food chains like American chain of pretzel shop Auntie Anne’s, Singaporean bakery BreadTalk, and US brands like Burgoo, KFC, Coffee Beanery Mrs. Fields and Starbucks. \nIt also has eight SM cinemas, including four digital theaters, each with a seating capacity of 360. More than a thousand parking slots, including provision for motorcycles and jeepney terminals for commuters will likewise provide utmost convenience for the costumers. Deeply rooted in its Japanese origins, Uniqlo in SM City Marikina offers simple,well-designed clothes that go beyond age, gender, occupation, ethnicity. Crocs footwear in SM Marikina provides great foot comfort and support for any occasion and every season.", "external_links": [], "published": "2016-11-20T02:37:00.000+02:00", "crawled": "2016-11-19T22:26:29.608+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}