{"organizations": [], "uuid": "acc52ccbf1ad696c7cce62443969b95872396fdb", "thread": {"site_full": "indianexpress.com", "main_image": "http://images.indianexpress.com/2016/11/mideast-syria_kuma480.jpg?w=480", "site_section": "http://indianexpress.com/section/world/feed/", "section_title": "World – The Indian Express", "url": "http://indianexpress.com/article/world/world-news/un-appalled-by-syria-violence-urges-aleppo-access-4385009/", "country": "US", "domain_rank": 598, "title": "UN ‘appalled’ by Syria violence, urges Aleppo access", "performance_score": 0, "site": "indianexpress.com", "participants_count": 0, "title_full": "UN ‘appalled’ by Syria violence, urges Aleppo access", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T03:03:00.000+02:00", "replies_count": 0, "uuid": "acc52ccbf1ad696c7cce62443969b95872396fdb"}, "author": "", "url": "http://indianexpress.com/article/world/world-news/un-appalled-by-syria-violence-urges-aleppo-access-4385009/", "ord_in_thread": 0, "title": "UN ‘appalled’ by Syria violence, urges Aleppo access", "locations": [], "entities": {"persons": [{"name": "kevin kennedy", "sentiment": "none"}, {"name": "bashar al-assad", "sentiment": "none"}, {"name": "kennedy", "sentiment": "none"}], "locations": [{"name": "syria", "sentiment": "none"}, {"name": "aleppo", "sentiment": "none"}, {"name": "idlib", "sentiment": "none"}, {"name": "moscow", "sentiment": "none"}, {"name": "damascus", "sentiment": "none"}, {"name": "russia", "sentiment": "none"}], "organizations": [{"name": "un", "sentiment": "negative"}, {"name": "afp", "sentiment": "none"}, {"name": "united nations", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "UN ‘appalled’ by Syria violence, urges Aleppo access UN ‘appalled’ by Syria violence, urges Aleppo access The bombardment, which began on Tuesday, has killed nearly 100 people, according to a monitor, and forced hospitals and schools to close. By: AFP | Damascus | Published:November 20, 2016 1:33 am The comments came as government bombardment rocked rebel-held east Aleppo, where more than 250,000 people are living under regime siege. (Thiqa News via AP) \nTop UN officials on Saturday said they were “appalled” by escalating violence in Syria, and urged immediate access to Aleppo, where government forces are waging a ferocious assault to retake rebel-held districts. “The United Nations is extremely saddened and appalled by the recent escalation in fighting in several parts of Syria,”the UN’s humanitarian coordinator for Syria Ali al-Za’atari and regional humanitarian coordinator Kevin Kennedy said. \nWatch what else is making news: \nIn a statement, they called on “all parties to cease indiscriminate attacks on civilians and civilian infrastructure”. The comments came as government bombardment rocked rebel-held east Aleppo, where more than 250,000 people are living under regime siege. \nThe bombardment, which began on Tuesday, has killed nearly 100 people, according to a monitor, and forced hospitals and schools to close. Za’atari, the most senior UN official based in Damascus, and Kennedy said the organisation had a plan to provide east Aleppo with assistance. \n“The UN has shared with all parties to the conflict in Aleppo and member states concerned a detailed humanitarian plan to provide urgently needed assistance to the inhabitants of east Aleppo, and conduct medical evacuations for the ill and injured,” they said. “It is imperative all parties agree to the plan and allow us to secure immediate, safe and unimpeded access to provide relief to those most in need in east Aleppo, but equally in all other parts of Syria where there are people in need.” \nThe UN has not accessed east Aleppo since government forces surrounded the rebel-held side of the city in mid-July. Moscow has organised several brief truces intended to encourage civilians and surrendering rebels to leave east Aleppo, but few have done so, and the UN has said it was unable to organise secure aid deliveries or evacuations within such short windows. \nRussia is a key ally of the government in Damascus and has waged a military campaign to bolster President Bashar al-Assad’s government against rebels. Moscow says it is not currently bombing Aleppo, though earlier this week it announced a “major operation” in neighbouring Idlib province, as well as in central Homs province. \nMore than 300,000 people have been killed since Syria’s conflict began in March 2011, with anti-government protests. Best of Express", "external_links": [], "published": "2016-11-20T03:03:00.000+02:00", "crawled": "2016-11-19T22:21:37.405+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}