{"organizations": [], "uuid": "beb2c81468580d93b62f847d0cbdd1e69a5e030b", "thread": {"site_full": "space.about.com", "main_image": "http://f.tqn.com/y/space/1/S/I/R/1/Oort_Cloud.jpg", "site_section": "http://z.about.com/6/o/m/space_p2.xml", "section_title": "About.com Space/Astronomy: Most Popular Articles", "url": "http://space.about.com/od/Space-and-Astronomy-Research/fl/Explore-the-Oort-Cloud.htm", "country": "US", "domain_rank": 238, "title": "The Oort Cloud is WAY Out There!", "performance_score": 0, "site": "about.com", "participants_count": 0, "title_full": "The Oort Cloud is WAY Out There!", "spam_score": 0.0, "site_type": "news", "published": "2016-11-13T18:44:00.000+02:00", "replies_count": 0, "uuid": "beb2c81468580d93b62f847d0cbdd1e69a5e030b"}, "author": "", "url": "http://space.about.com/od/Space-and-Astronomy-Research/fl/Explore-the-Oort-Cloud.htm", "ord_in_thread": 0, "title": "The Oort Cloud is WAY Out There!", "locations": [], "entities": {"persons": [{"name": "carolyn collins petersen", "sentiment": "neutral"}, {"name": "eris", "sentiment": "none"}, {"name": "charon", "sentiment": "none"}, {"name": "makemake", "sentiment": "none"}, {"name": "jaan oört", "sentiment": "none"}], "locations": [{"name": "united states", "sentiment": "none"}, {"name": "kuiper belt", "sentiment": "none"}, {"name": "jupiter", "sentiment": "none"}, {"name": "sedna", "sentiment": "none"}, {"name": "haumea", "sentiment": "none"}, {"name": "neptune", "sentiment": "none"}, {"name": "pluto", "sentiment": "none"}], "organizations": [{"name": "saturn", "sentiment": "none"}, {"name": "treasury", "sentiment": "none"}, {"name": "best universities", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "By Carolyn Collins Petersen Updated August 16, 2016 . \nThink you know the most distant worlds in the solar system? The planets are easy, and if you know where the asteroids exist, you've got a good handle on a good portion of the solar system. However, what about comets? Do you know about their ancient home? \nIf you can say where comets come from, then give yourself a pat on the back! These objects \"live\" in the outermost part of our solar system called the Oört Cloud ( named after the man who suggested its existence, Jan Oör t) — a spherical collection of icy bodies at a distance of between 5,000 and 100,000 astronomical units (AU). Some astronomers think it might stretch out as far as 3 light-years and it's a deep-freeze containing evidence of the early history of the solar system. What's Out in the Oört Cloud? \nThe Oört Cloud' is named for astronomer Jaan Oört, who first hypothesized its existence in 1950. It's populated by icy objects made mostly of mixtures of frozen water, methane , ethane , carbon monoxide , and hydrogen cyanide , mixed with rock and dust grains. \ncontinue reading below our video 10 Best Universities in the United States Planetary scientists estimate the Oort Cloud has up to 2 trillion icy of these objects orbiting the Sun, many of which make their way into solar orbit and become comets. \nIf these icy objects exist so far out in space, how do they become comets that go hurtling in orbit around the Sun? There are several ideas about that. It's possible that stars passing nearby, or tidal interactions within the disk of the Milky Way Galaxy , or interactions with gas and dust clouds give these icy bodies a kind of \"push\" out of their orbits in the Oort Cloud. With their motions changed, they're more likely to \"fall\" in toward the Sun on new orbits that take thousands of years for one trip around the Sun. These are called \"long-period\" comets. Comets and the Kuiper Belt \nThere are other comets, called \"short-period\" comets that travel around the Sun in much shorter times, usually less than 200 years. They come from the Kuiper Belt , which is a roughly disk-shaped region that spans out from the orbit of Neptune . The Kuiper Belt has been in the news for the past couple of decades as astronomers discover new worlds within its boundaries. Dwarf planet Pluto is a denizen of the Kuiper Belt, joined by Charon (its largest satellite), and the dwarf planets Eris, Haumea, Makemake, and Sedna. The Kuiper Belt extends from about 30 to 55 AU and astronomers estimate it has hundreds of thousands of icy bodies larger than 62 miles across. It might also have about a trillion comets. Exploring the Parts of the Oört Cloud \nThe Oört Cloud is divided into two parts. The first is the source of what are called \"long-period\" comets (those that take many centuries to orbit the Sun). It may have trillions of cometary nuclei. The second is an inner Cloud shaped roughly like a doughnut. It, too, is very rich in cometary nuclei and other dwarf-planet-sized objects. Astronomers recently found one small world that has part of its orbit in the inner Oört Cloud. As they find more, they will be able to refine their ideas about where those objects originated back in the solar system's early history. A Treasury of Solar System History \nThe Oört Cloud's cometary nuclei and Kuiper Belt objects (KBOs) are likely remnants from the formation of the solar system about 4.6 billion years ago. Astronomers think the Oört Cloud's icy planetesimals formed much closer to the Sun early in history, alongside the formation of the planets and asteroids. Gravitational interactions with the young gas giant planets (Jupiter, Saturn, Uranus, and Neptune) slingshotted the icy worldlets out to form the Cloud. \nIt's also possible that Oört Cloud objects came from materials in the birth nebula where the Sun and its siblings formed together, a jointly shared \"pool\" of icy objects from protoplanetary disks that lay very close together. As the newborn stars drifted apart, they dragged along the materials from other protoplanetary disks and those ultimately populated the Cloud.", "external_links": [], "published": "2016-11-13T18:44:00.000+02:00", "crawled": "2016-11-13T15:36:22.993+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 1}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 13, "shares": 13, "comments": 0}, "stumbledupon": {"shares": 0}}}