{"organizations": [], "uuid": "87223a8eca3d7caa8b09fd6ad84c6af00d48ceaf", "thread": {"site_full": "www.nytimes.com", "main_image": "https://static01.nyt.com/images/2016/11/20/opinion/sunday/20tanenhaus/20tanenhaus-facebookJumbo.jpg", "site_section": "http://www.nytimes.com/services/xml/rss/nyt/Opinion.xml", "section_title": "NYT > Opinion", "url": "http://www.nytimes.com/2016/11/20/opinion/sunday/donald-trumps-art-of-the-new-deal.html", "country": "US", "domain_rank": 98, "title": "Opinion: Donald Trump’s Art of the New Deal?", "performance_score": 0, "site": "nytimes.com", "participants_count": 1, "title_full": "Opinion: Donald Trump’s Art of the New Deal?", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T03:51:00.000+02:00", "replies_count": 0, "uuid": "87223a8eca3d7caa8b09fd6ad84c6af00d48ceaf"}, "author": "SAM TANENHAUS", "url": "http://www.nytimes.com/2016/11/20/opinion/sunday/donald-trumps-art-of-the-new-deal.html", "ord_in_thread": 0, "title": "Opinion: Donald Trump’s Art of the New Deal?", "locations": [], "entities": {"persons": [{"name": "eisenhower", "sentiment": "negative"}, {"name": "donald trump", "sentiment": "neutral"}, {"name": "chuck schumer", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "stephen k. bannon", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "rob portman", "sentiment": "none"}, {"name": "nancy pelosi", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "taft", "sentiment": "none"}, {"name": "george wallace", "sentiment": "none"}, {"name": "sam tanenhaus", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "jeff sessions", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "new deal", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "alabama", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "bretibart news", "sentiment": "none"}, {"name": "republican party", "sentiment": "none"}, {"name": "new york times book review", "sentiment": "none"}, {"name": "medicare", "sentiment": "none"}, {"name": "house", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Privacy Policy Eisenhower’s two terms bore this out. Instead of unstringing the safety net, he worked, often with congressional Democrats, and added a new layer with the bipartisan Civil Rights Act of 1957. His biggest infrastructure project, the Interstate System of highways, meshed with the booming auto economy and also with a Cold War defense strategy that called for state-of-the art evacuation routes in the event of thermonuclear attack. President-elect Trump seems caught between those visions. His views on trade, business regulations and foreign policy resemble Taft’s. But he sounds more like Eisenhower on many domestic policies. After President Obama, in a meeting with Mr. Trump, pointed out some key protections of the Affordable Care Act — for people with pre-existing medical conditions and young adults covered by their parents — Mr. Trump indicated he might moderate his position. Mr. Ryan, too, said, “We can fix what is broken in health care without breaking what is working.” The same dynamic could play out on other issues. Mr. Trump has already begun talking about building a fence instead of a wall along sections of the Mexican border. And while he has been adamant about deporting undocumented immigrants, he has narrowed the emphasis to those with criminal records — the policy Mr. Obama has pursued. Clear differences with small-government conservatives could also emerge if House Republicans tried to privatize Medicare or health care services for veterans. On infrastructure, Mr. Trump seems inclined for now to side with Democrats who want a big plan over the objections of Republican deficit hawks. One clue to how Mr. Trump might govern from the center is contained in exit polls. According to those surveys, groups about whom Mr. Trump said disparaging things — including women, Hispanics and blacks — voted against him, but less emphatically than expected. Mr. Trump’s share of the African-American and Hispanic vote was actually larger than Mitt Romney’s in 2012. Most striking was the gender gap. Hillary Clinton’s edge there, 54 to 42, was large, but not atypical. \n  One major reason: Democrats simply didn’t turn out for Mrs. Clinton in the same numbers they did for Mr. Obama. Mr. Trump talked about cultural issues like abortion, but not with the same intensity of Republicans past. Rather, his ability to tap into anger and frustration about jobs, trade and illegal immigration seemed to stir Republican and independent voters. It was easy to snicker when he asked African- American audiences what they had to lose by supporting him. (One answer may come in his court appointments.) But he recognized that those voters had doubts about him, and he urged them to take a chance. It was a rough-hewed pitch, and perhaps a cynical one. But many of those voters may have viewed it as a common-sense one, too. To dismiss the “great” America evoked by Mr. Trump as nothing but code for prejudice and exclusion overlooks the legacy of opportunity and connectedness made possible by New Deal and Great Society programs. Created by Democrats, those programs have long been opposed by conservatives. But pragmatic Republicans like Eisenhower helped preserve them. Mr. Trump drew on this memory in his victory remarks. “The forgotten men and women of our country will be forgotten no longer,” he said, promising that he would “fix our inner cities and rebuild our highways, bridges, tunnels, airports, schools, hospitals” and “rebuild our infrastructure, which will become, by the way, second to none, and we will put millions of our people to work as we rebuild it.” This is why the most important contest in the days ahead could be one within the Republican Party, as Mr. Trump’s potential “new” New Deal comes up against the free-market vision of Mr. Ryan. Little more than a year ago, Mr. Ryan supported an infrastructure plan floated by Senator Chuck Schumer, Democrat of New York, who argued that hundreds of billions of dollars could come through a one-time “repatriation” of profits from giant companies’ overseas earnings in exchange for lower tax rates. It might seem surprising that Mr. Ryan — who has also been saying that he wants to privatize Medicare — was agreeable. But he represents a flyover state, Wisconsin, that has a troubled economy. The same was true of a second Republican, Senator Rob Portman of Ohio, who also backed the bill. The bill went nowhere, in part because of election tensions. Now all three legislators will be returning to Washington, bigger players than before. Each would gain stature from a put-America-back-to work bill. The top House Democrat, Nancy Pelosi, instantly picked up on Mr. Trump’s words, saying, “We can work together to quickly pass a robust infrastructure jobs bill.” She has been joined by other congressional Democrats, who are looking for areas of agreement with Mr. Trump on this and other measures that could ease the struggles of middle- and working-class America. Populists of the past, most strikingly George Wallace, embraced the New Deal while also practicing a politics of racial division. Mr. Trump may follow a similar path, as his selection of Stephen K. Bannon, the former head of Bretibart News, as his chief strategist suggests. Mr. Trump’s choice of Senator Jeff Sessions of Alabama to be attorney general raises similar concerns. But it is a long way to January 20. A Rust Belt Republicanism that returns to an older idea of pragmatic consensus politics could be a revolution for the better. \nSam Tanenhaus is a former editor of The New York Times Book Review and the author of “The Death of Conservatism.” A version of this op-ed appears in print on November 20, 2016, on page SR6 of the New York edition with the headline: Donald Trump’s Art of the New Deal?. Today's Paper | Subscribe", "external_links": [], "published": "2016-11-20T03:51:00.000+02:00", "crawled": "2016-11-19T23:21:38.846+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}