{"organizations": [], "uuid": "8d7ad8ce1bd18ef83c92337d4d60a49c546ceaac", "thread": {"site_full": "www.chron.com", "main_image": "http://www.chron.com/img/pages/article/opengraph_default.jpg", "site_section": "", "section_title": "", "url": "http://www.chron.com/news/education/article/The-Latest-Election-polls-open-in-Wisconsin-10600438.php", "country": "US", "domain_rank": 773, "title": "The Latest: GOP looks defeat 3 state Senate Democrats - Houston Chronicle", "performance_score": 0, "site": "chron.com", "participants_count": 0, "title_full": "The Latest: GOP looks defeat 3 state Senate Democrats - Houston Chronicle", "spam_score": 0.048, "site_type": "news", "published": "2016-11-09T06:52:00.000+02:00", "replies_count": 0, "uuid": "8d7ad8ce1bd18ef83c92337d4d60a49c546ceaac"}, "author": "", "url": "http://www.chron.com/news/education/article/The-Latest-Election-polls-open-in-Wisconsin-10600438.php", "ord_in_thread": 0, "title": "The Latest: GOP looks defeat 3 state Senate Democrats - Houston Chronicle", "locations": [], "entities": {"persons": [{"name": "donald trump", "sentiment": "none"}, {"name": "nelson", "sentiment": "none"}, {"name": "dan feyen", "sentiment": "none"}, {"name": "feyen", "sentiment": "none"}, {"name": "ron johnson", "sentiment": "none"}, {"name": "shana lucas", "sentiment": "none"}, {"name": "daniel feyen", "sentiment": "none"}, {"name": "novack", "sentiment": "none"}, {"name": "magney", "sentiment": "none"}, {"name": "brown", "sentiment": "none"}, {"name": "hillary clinton", "sentiment": "none"}, {"name": "sheila harsdorf", "sentiment": "none"}, {"name": "harper", "sentiment": "none"}, {"name": "ronald reagan", "sentiment": "none"}, {"name": "rebecca zbichorski", "sentiment": "none"}, {"name": "scott mcdonnell", "sentiment": "none"}, {"name": "mike gallagher", "sentiment": "none"}, {"name": "tony harper", "sentiment": "none"}, {"name": "tom tiffany", "sentiment": "none"}, {"name": "feingold", "sentiment": "none"}, {"name": "appleton", "sentiment": "none"}, {"name": "paul ryan", "sentiment": "none"}, {"name": "ryan solen", "sentiment": "none"}, {"name": "kathy novack", "sentiment": "none"}, {"name": "russ feingold", "sentiment": "none"}, {"name": "julie lassa", "sentiment": "none"}, {"name": "gallagher", "sentiment": "none"}, {"name": "rick gudex", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "harris", "sentiment": "none"}, {"name": "robert cowles", "sentiment": "none"}, {"name": "johnson", "sentiment": "none"}, {"name": "berg", "sentiment": "none"}, {"name": "dave hansen", "sentiment": "none"}, {"name": "mark harris", "sentiment": "none"}, {"name": "zbirchorski", "sentiment": "none"}, {"name": "ryan", "sentiment": "none"}, {"name": "jennifer shilling", "sentiment": "none"}, {"name": "tom nelson", "sentiment": "none"}, {"name": "stefani berg", "sentiment": "none"}, {"name": "reid ribble", "sentiment": "none"}, {"name": "scott walker", "sentiment": "none"}, {"name": "reid magney", "sentiment": "none"}, {"name": "john boehner", "sentiment": "none"}], "locations": [{"name": "houston", "sentiment": "none"}, {"name": "madison", "sentiment": "none"}, {"name": "milwaukee", "sentiment": "none"}, {"name": "menominee", "sentiment": "none"}, {"name": "outagamie", "sentiment": "none"}, {"name": "iraq", "sentiment": "none"}, {"name": "waukesha county", "sentiment": "none"}, {"name": "lake michigan", "sentiment": "none"}, {"name": "d.c", "sentiment": "none"}, {"name": "river falls", "sentiment": "none"}, {"name": "fond du lac", "sentiment": "none"}, {"name": "winnebago county", "sentiment": "none"}, {"name": "appleton", "sentiment": "none"}, {"name": "wisconsin", "sentiment": "none"}, {"name": "winnebago and fond du lac", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "sun prairie", "sentiment": "none"}, {"name": "waupaca", "sentiment": "none"}, {"name": "oconto", "sentiment": "none"}, {"name": "calumet", "sentiment": "none"}, {"name": "green bay", "sentiment": "none"}, {"name": "mt. pleasant democrat", "sentiment": "none"}, {"name": "u.s. berg", "sentiment": "none"}, {"name": "la crosse", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "lisbon", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "marinette", "sentiment": "none"}, {"name": "janesville", "sentiment": "none"}, {"name": "outagamie county", "sentiment": "none"}], "organizations": [{"name": "gop", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "oshkosh", "sentiment": "none"}, {"name": "mcdonnell", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}, {"name": "arrowhead school district", "sentiment": "none"}, {"name": "wisconsin elections commission", "sentiment": "none"}, {"name": "house", "sentiment": "none"}, {"name": "democratic outagamie county executive", "sentiment": "none"}, {"name": "u.s. senate", "sentiment": "none"}, {"name": "uw", "sentiment": "none"}, {"name": "east high school", "sentiment": "none"}, {"name": "legislature", "sentiment": "none"}, {"name": "republican", "sentiment": "none"}, {"name": "sun prairie", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "wisconsin election commission", "sentiment": "none"}, {"name": "green bay", "sentiment": "none"}, {"name": "assembly", "sentiment": "none"}, {"name": "congressional district saw republican", "sentiment": "none"}, {"name": "stevens point", "sentiment": "none"}, {"name": "university of wisconsin-madison", "sentiment": "none"}, {"name": "wisconsin senate", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "The Latest: GOP looks defeat 3 state Senate Democrats Updated 1:05 am, Wednesday, November 9, 2016 MILWAUKEE (AP) — The Latest developments on Election Day in Wisconsin (all times local): 11:45 p.m. Republicans have not only retained control of the Wisconsin Senate , but they look like they're going to knock out three Democratic incumbents. Republican challengers were leading Democratic incumbents Julie Lassa of Stevens Point, Dave Hansen of Green Bay and Jennifer Shilling of La Crosse late Tuesday. Three GOP incumbents won their seats and a Republican won an open seat representing the Fond du Lac area to secure a Republican majority in the chamber for another two years. ___ 10:45 p.m. Russ Feingold says in the wake of his defeat that \"this could be one of the most challenging times in the history of the country.\" Feingold delivered the dour message after losing to Republican Sen. Ron Johnson in Wisconsin's U.S. Senate race. Polls had shown Feingold ahead the entire race, but Johnson closed the gap in the waning days. Feingold was trying to avenge a 2010 loss to Johnson. Feingold tells his supporters that they should \"be as restrained as you can be.\" Johnson says that he intends to concentrate on areas of agreement with Democrats as he sets off on his second term. ___ 10:40 p.m. Republicans have retained control of the Wisconsin state Senate, setting the stage for the GOP to maintain complete control of state government. The GOP entered Tuesday's election with an 18-14 advantage with one open seat. Democrats needed to win six of the eight seats in play to get to a 17-member majority. Republicans needed to win only four. GOP incumbents Robert Cowles of Green Bay, Sheila Harsdorf of River Falls, Tom Tiffany of Little Rice all won. Republican newcomer Daniel Feyen won an open seat representing the Fond du Lac area to give the GOP 17 seats. Republicans were widely expected to maintain their majority in the Assembly as well. Republicans have controlled both legislative houses and the governor's office since 2011. With Gov. Scott Walker not up for re-election until 2018, Republicans will have complete control of state government for another two years. ___ 10:30 p.m. Republican Sen. Ron Johnson tells The Associated Press he defeated Democrat Russ Feingold because \"I told the truth.\" Johnson tells AP in a telephone interview from Oshkosh that \"I think the good folks of Wisconsin recognized that. Johnson says his win shows people are concerned about the direction of the country. He says, \"They are not happy with what's happened in Washington, D.C. They see a dysfunctional system.\" Johnson says he will be working with Gov. Scott Walker and national Republican leaders on a coordinated agenda \"so we really can bring the type of change that voters have asked for now.\" Johnson is the first Republican to win election to the Senate in a presidential year since 1980. ___ 10:25 p.m. Republican U.S. Sen. Ron Johnson has won re-election, beating Democrat Russ Feingold in Wisconsin. Johnson's victory Tuesday came in a rematch of the 2010 race in which Johnson ended Feingold's 18-year run in the Senate. Democrats pegged Johnson to be vulnerable and eyed the seat as one they could pick up in their attempts to regain majority control of the Senate. They were wrong. Johnson argued that Feingold had already been fired by voters once six years ago and had done nothing to warrant returning to the Senate. Feingold tried to make an issue of Johnson supporting Donald Trump for president as he argued the former manufacturer had been an ineffective. ___ 10 p.m. Republican Mike Gallagher has defeated Democrat Tom Nelson in the race for an open congressional seat representing northeastern Wisconsin. Gallagher is a former Marine from Green Bay who served as national security adviser on Gov. Scott Walker's short-lived presidential campaign last year. Nelson, a former state legislator from Appleton, currently serves as Outagamie County executive. Gallagher will represent Wisconsin's 8th Congressional District, which includes Marinette, Brown, Kewaunee, Door, Calumet, Outagamie, Waupaca, Menominee and Oconto counties. He replaces Republican three-term incumbent Reid Ribble , who announced in January that he wouldn't seek re-election. ___ 9:35 p.m. Republican Mike Gallagher has opened a sizable lead on Democrat Tom Nelson in the race for northeastern Wisconsin's open congressional seat. According to returns tabulated by The Associated Press, Gallagher was leading Nelson by about 65 percentage points with a little less than a quarter of the expected vote counted in the 8th Congressional District. The district includes a large chunk of northeastern Wisconsin, including Green Bay, Appleton and Marinette. The district has swung between Republican and Democratic control over the last two decades. Gallagher and Nelson are vying to replace Republican incumbent Reid Ribble, who announced in January he wouldn't seek a fourth term. ___ 9:10 p.m. Republican Dan Feyen has won an open seat in the Wisconsin state Senate, dashing Democratic hopes of picking up a district they had targeted. Feyen beat Democrat Mark Harris in the 18th Senate District that includes parts of Winnebago and Fond du Lac counties. Democrats had high hopes of winning the seat after incumbent Republican Rick Gudex announced last year that he wouldn't seek re-election. Republicans passed a law this past session designed to drive Harris, the Winnebago County executive, out of the race. The law prohibits county executives from serving simultaneously in the Legislature. The measure would have forced Harris to trade his $102,834 county executive salary for a senator's $50,950 salary if he had won the race. ___ 8:45 p.m. The race for president and U.S. Senate in Wisconsin are too close to call based on early returns. Republicans Donald Trump and incumbent Sen. Ron Johnson both had narrow leads based on early returns. Democrat Russ Feingold is trying to defeat Johnson in a rematch of their 2010 race. And Democrat Hillary Clinton was so confident about her chances in Wisconsin she didn't even campaign in the state after the primary. That marked the first time since 1972 that one of the two major party candidates for president skipped the state in the general election campaign. Wisconsin has 10 electoral votes. ___ House Speaker Paul Ryan has won a ninth term in Congress. Ryan, a Janesville Republican, defeated challenger Ryan Solen , a Mt. Pleasant Democrat, in Tuesday's election. Ryan was first elected to represent southeastern Wisconsin's 1st Congressional District in 1998. He succeeded John Boehner as speaker last year. Ryan took pointed criticism from Republican presidential candidate Donald Trump last month after Ryan told House members he would no longer defend or campaign for Trump. Ryan made the pledge after a tape surfaced of Trump making predatory remarks about women in 2005. __ 8 p.m. Polls are closed in Wisconsin, but people in line can still cast their ballots. Results will begin to roll in as counties report their totals in the presidential race, the contest for U.S. Senate and a host of other races for the state Legislature and local offices. Republican Sen. Ron Johnson is running for re-election against Democrat Russ Feingold, a rematch of their 2010 race. Polls leading up to the election showed the race to be tight. ___ 7 p.m. Elections officials in Madison are giving voters at one polling place an extra hour to vote because of a fire alarm earlier in the day. City officials say the polls at East High School will remain open until 9 p.m. because of concerns that the alarm prevented some Ward 29 residents from voting. All other polling locations in Madison will close at 8 p.m., but voters who are in line at 8 p.m. will be allowed to cast their ballots. The extension is not expected to delay the reporting of election results elsewhere. ___ 5:30 p.m. Polling places ran out of ballots in part of Waukesha County in suburban Milwaukee, but officials say residents had other ways of voting and nobody was turned away. Waukesha County Clerk Kathy Novack says the shortage developed late morning in some precincts in the Town of Lisbon that have students in the Arrowhead School District. She says their best guess is that local voter interest in two ballot questions on facilities upgrades was overwhelming. New ballots were ordered around noon, and they arrived around 2:30 p.m. But Novack says nobody was denied the opportunity to vote. She says voters had the option of using a touch screen system, or filling out photocopied ballots that election judges would hand-copy later onto official ballots. The affected precincts have about 1,900 registered voters. ___ 2:45 p.m. Dane County Clerk Scott McDonnell says University of Wisconsin-Madison officials have come up with a clever way to ensure that the 14,000 students on campus from out-of-state can vote under Wisconsin's new voter ID law. McDonnell says UW-Madison's student ID cards don't comply with the law because they expire in five years, rather than two years as the law requires. So he says UW officials have set up tables at all campus polling stations where they're printing out paper voting-only IDs that let students vote. And McDonnell says they're getting heavy use. McDonnell says he thinks the two-year expiration dates were part of an effort to make it harder for students to vote. But he says the university found a \"clever way\" to manage the problem that's working out well. ___ 1:45 p.m. Stefani Berg is a 25-year-old nurse from Milwaukee who was one of many waiting until Election Day to cast her ballot. Berg says she been studying the candidates and voted for Hillary Clinton because she would be a stronger leader and is more closely aligned with her views on Supreme Court choices. Berg says Republican candidate Donald Trump \"acts a bit childish when it comes to trying to be a leader.\" She worries about how he would react to some important matters, including immigration and foreign policy and is concerned that foreign leaders may not respect him and in turn fail to respect the U.S. Berg is one of about 3 million Wisconsinites expected to vote in the general election. ____ 12:30 p.m. A Sun Prairie man is angry that he was turned away from the polls under Wisconsin's new voter ID requirements. Tony Harper says he's been a registered Wisconsin voter since 1982. But he says he wasn't allowed to vote even though he carried his Wisconsin driver's license and his U.S. passport — proof of his Wisconsin residency and U.S. citizenship. He says he moved from Madison to Sun Prairie about a year and a half ago, but his license still shows his old address. He says officials told him his auto insurance bill wasn't sufficient proof of his new address. Harper, a middle-aged white man who wouldn't disclose his political leanings, says he plans to return after work with qualifying proof. But he says it's a big inconvenience for him and suspects it will be for other voters who work day shifts. ___ 11:30 a.m. Poll workers and other observers are reporting steady voting in Tuesday's general election in Wisconsin after an early morning crunch of people, some of whom waited in long lines for a chance to cast their ballot. One of Milwaukee's busier wards on the near north side blocks from Lake Michigan had nearly 400 voters by mid-morning. Chief inspector Shana Lucas says that's more votes that some elections draw during the whole day in that ward. Lines were long before the workday at Milwaukee's municipal building in downtown Milwaukee. State elections officials expect more than 3 million people will vote in this election in Wisconsin. ____ 7:55 a.m. The culmination of a tense political season ends Tuesday at the ballot box. So, it might be tempting to snap a selfie photo with your ballot after you're done voting. In Wisconsin, that would be problematic. Wisconsin Elections Commission spokesman Reid Magney says the concern isn't so much with the photo itself, but in sharing that photo. Posting it on social media equates to showing your ballot to someone else — and that's against the law. Magney tells WUWM-FM ( http://bit.ly/2eIFUsB ) the intent of the law is to prevent people from selling their votes. A review by The Associated Press shows there are laws against voters sharing any photo of their ballot in 18 states, while six others bar photography in polling places but allow photos of mail-in ballots. ____ 7:05 a.m. Polls are open in Wisconsin where voters weary of the political rhetoric have the final say on the person they want to be the next commander in chief and the next U.S. senator from the Badger State, as well as other choices. It's the first presidential election where voters here are required to show a photo ID before receiving their ballot. Wisconsin Election Commission officials predict turnout of near 70 percent, on par with the past two presidential elections where photo IDs were not required. Democrats hope to keep a presidential winning streak dating back to 1988 alive, while Republicans try to re-elect Sen. Ron Johnson, which would make him the first Wisconsin Republican to win a Senate seat in a presidential year since 1980. ____ 6:35 a.m. The majority of Wisconsin's eligible voters will head to the polls on this Election Day. Nearly 800,000 of the expected 3 million people who are expected to vote in the general election have already cast their ballots. That includes 28-year-old Rebecca Zbichorski (sbee-HOR'-skee) who headed to the municipal building in downtown Milwaukee to cast an early vote for Donald Trump. Zbirchorski spent nearly eight years on active duty in the Marines with two deployments to Iraq. She says \"America needs a kick in the behind\" and thinks Trump is the guy to do it. Zbirchorski says she's tired of the political chaos and hopes the outcome of Tuesday's presidential election won't be challenged. The Wisconsin Elections Commission projects nearly 70 percent of the state's eligible voters are expected to cast ballots in this election. ____ 12:16 a.m. Wisconsin Democrats are hoping to keep a presidential winning streak alive and avenge a loss that sent a former longtime senator packing six years ago. Republicans hope to make Donald Trump the first GOP presidential candidate since Ronald Reagan to win in Wisconsin. They also are working to send Sen. Ron Johnson back to the Senate in his rematch against former Democratic Sen. Russ Feingold. Those two statewide races topped Wisconsin's ballot Tuesday. In northeast Wisconsin, the open 8th Congressional District saw Republican newcomer Mike Gallagher running against Democratic Outagamie County Executive Tom Nelson. The seat is open due to the retirement of Republican Rep. Reid Ribble. Republicans were expected to maintain control of the state Legislature. Latest News Video ", "external_links": [], "published": "2016-11-09T06:52:00.000+02:00", "crawled": "2016-11-10T04:37:37.447+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}