{"organizations": [], "uuid": "e34078cf01f53ae45cf7f1ec386386982681715d", "thread": {"site_full": "www.engadget.com", "main_image": "https://s.aolcdn.com/dims5/amp:350193b25c4cf87bfd1ca2bbe57d9af7e2079342/t:1200,630/q:80/?url=https%3A%2F%2Fs.aolcdn.com%2Fhss%2Fstorage%2Fmidas%2Fcacaaad8f04edda9e5c6e1e192b18c76%2F204619759%2Fgraphene-free-supercapacitor-2016-11-17-01.jpg", "site_section": "", "section_title": "", "url": "https://www.engadget.com/2016/11/22/super-capacitor-battery-30000-cycles/", "country": "US", "domain_rank": 437, "title": "New battery tech lasts for days, charges in seconds", "performance_score": 0, "site": "engadget.com", "participants_count": 0, "title_full": "New battery tech lasts for days, charges in seconds", "spam_score": 0.094, "site_type": "news", "published": "2016-11-22T18:19:00.000+02:00", "replies_count": 0, "uuid": "e34078cf01f53ae45cf7f1ec386386982681715d"}, "author": "", "url": "https://www.engadget.com/2016/11/22/super-capacitor-battery-30000-cycles/", "ord_in_thread": 0, "title": "New battery tech lasts for days, charges in seconds", "locations": [], "entities": {"persons": [{"name": "nitin choudhary", "sentiment": "none"}, {"name": "jung", "sentiment": "none"}, {"name": "yeonwoong", "sentiment": "none"}, {"name": "eric", "sentiment": "none"}, {"name": "henrik fisker", "sentiment": "none"}, {"name": "choudhary", "sentiment": "none"}], "locations": [], "organizations": [{"name": "ucla", "sentiment": "none"}, {"name": "save university of central florida  scientists", "sentiment": "none"}, {"name": "university of central florida", "sentiment": "none"}, {"name": "ucf", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "New battery tech lasts for days, charges in seconds The supercapacitor cell is just a \"proof-of-concept\" but looks promising. Save University of Central Florida \nScientists from the University of Central Florida (UCF) have created a supercapacitor battery prototype that works like new even after being recharged 30,000 times. The research could yield high-capacity, ultra-fast-charging batteries that last over 20 times longer than a conventional lithium-ion cell. \"You could charge your mobile phone in a few seconds and you wouldn't need to charge it again for over a week,\" says UCF postdoctoral associate Nitin Choudhary. \nSupercapacitors can be charged quickly because they store electricity statically on the surface of a material, rather than using chemical reactions like batteries. That requires \"two-dimensional\" material sheets with large surface areas that can hold lots of electrons. However, much of the research, including that by EV-maker Henrik Fisker and UCLA , uses graphene as the two-dimensional material. \nYeonwoong \"Eric\" Jung from UCF says it's a challenge to integrate graphene with other materials used in supercapacitors, though. That's why his team wrapped 2D metal materials (TMDs) just a few atoms thick around highly-conductive 1D nanowires, letting electrons pass quickly from the core to the shell. That yielded a fast charging material with high energy and power density that's relatively simple to produce. \"We developed a simple chemical synthesis approach so we can very nicely integrate the existing materials with the two-dimensional materials,\" Jung says. \nThe research is in early days and not ready for commercialization, but it looks promising. \"\"For small electronic devices, our materials are surpassing the conventional ones worldwide in terms of energy density, power density and cyclic stability,\" Choudhary said. \nJung calls the research \"proof-of-concept,\" and the team is now trying to patent its new process. While it could go nowhere like many other battery developments, it's worth looking at new supercapacitor research closely. If commercialized, it could allow for longer-range EVs that can be charged in minutes rather than hours, long-lasting (non-explosive) smartphones that can be charged in seconds and grid or home energy storage solutions that drastically reduce our reliance on fossil fuels. ", "external_links": [], "published": "2016-11-22T18:19:00.000+02:00", "crawled": "2016-11-22T18:28:39.628+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}