{"organizations": [], "uuid": "48c48d7902c5f89c44e3ede680c718b5c624144b", "thread": {"site_full": "entertainment.inquirer.net", "main_image": "http://entertainment.inquirer.net/files/2016/11/lotlot-janine.jpg", "site_section": "http://entertainment.inquirer.net/feed\r", "section_title": "Inquirer Entertainment", "url": "http://entertainment.inquirer.net/207110/lotlot-janine-elmo-breakup-think-deserves", "country": "US", "domain_rank": 813, "title": "Lotlot on Janine-Elmo breakup: I think she deserves more", "performance_score": 0, "site": "inquirer.net", "participants_count": 1, "title_full": "Lotlot on Janine-Elmo breakup: I think she deserves more", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T03:50:00.000+02:00", "replies_count": 0, "uuid": "48c48d7902c5f89c44e3ede680c718b5c624144b"}, "author": "lalos", "url": "http://entertainment.inquirer.net/207110/lotlot-janine-elmo-breakup-think-deserves", "ord_in_thread": 0, "title": "Lotlot on Janine-Elmo breakup: I think she deserves more", "locations": [], "entities": {"persons": [{"name": "janine gutierrez", "sentiment": "negative"}, {"name": "janine-elmo", "sentiment": "negative"}, {"name": "lotlot de leon  “", "sentiment": "neutral"}, {"name": "surreal  lotlot", "sentiment": "none"}, {"name": "lotlot de leon", "sentiment": "none"}, {"name": "lotlot", "sentiment": "none"}, {"name": "elmo magalona", "sentiment": "none"}, {"name": "janine", "sentiment": "none"}, {"name": "diego", "sentiment": "none"}, {"name": "maxine", "sentiment": "none"}, {"name": "ramon christopher", "sentiment": "none"}, {"name": "jessica", "sentiment": "none"}], "locations": [{"name": "taiwan", "sentiment": "none"}, {"name": "parañaque", "sentiment": "none"}], "organizations": [{"name": "inquirer", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Philippine Daily Inquirer / 04:50 AM November 20, 2016 Janine Gutierrez (left) and Lotlot de Leon \n“Janine is a very smart girl. She is moneyed, she has a career, and she has a college degree from a good school. She deserves to be treated well.” \nThat was actress Lotlot de Leon’s reaction when the Inquirer asked what she thought of her daughter Janine Gutierrez’s decision to call it quits with boyfriend Elmo Magalona. \nNever a woman to mince her words, Lotlot added: “I’m not saying this because she’s my daughter. If she can be treated like a princess, then that would be better.” ADVERTISEMENT \nShe said Janine has been coping with the breakup better than she expected. Lotlot’s eldest daughter recently celebrated her 27th birthday by vacationing in Taiwan. \n“I’m so proud of her. I just think that if you’re no longer treated well, or that if you are not happy anymore, then you should move on,” the mom pointed out. \nJanine’s decision \nWhile she and her daughter had discussed the breakup lengthily, Lotlot said it was just Janine who made the decision in the end. \n“She’s already of age. She can very well decide for herself,” Lotlot stressed. “I just pray that she continues to make the right ones. As a mother, we try to steer our children to the direction that we think is right for them, but sometimes they really have to be in that particular situation to learn from it. It hurts me to see her like that, but I think it needed to happen for her to learn.” \nLotlot, who also acts as Janine’s talent manager, said their ideas usually clash, “but I listen to Janine, too, because she is her own person, with her own ideas, so we explain our views.” \nExtra mile \nShe would often remind Janine that “if there is someone who would go the extra mile for her to get a particular project because it would be good for her, that would be me. In the same way that I would also turn down something that I think would not be beneficial to her.” \nLotlot added: “I’ve been in this industry for so long. I’ve learned that there are projects you have to let go of because they’re really not for you. But if you are able to prove that you’re worth other people’s time and are talented, then more offers would eventually come.” \nLotlot observed that Janine has already learned to appreciate and embrace show business as her chosen career. \n“She is doing everything now to improve not only as a person but as an actor. She spends time at the gym doing pilates and boxing—may abs na nga siya! She keeps herself busy by attending acting workshops. She is never idle,” Lotlot said. \nAcceptance \nShe recalled the time when she would tell Janine, “If you join this industry half-heartedly, or if you’re just in it for the money, you wouldn’t last long. You have to accept it and whatever comes with it—the good and the bad. Eventually, people will see that and the work that you do will reflect that.” \nLotlot has three other children with estranged husband Ramon Christopher—Maxine, Diego and Jessica. She said she felt lucky that all her kids are achievers. \n“Even if my children have different personalities, the one thing they have in common is that they all have dreams. They strive to achieve what they want for themselves, and that’s enough for me,” she declared. \nWith her kids focused on pursuing their respective dreams, Lotlot now has time to realize hers. She recently opened a restaurant in Parañaque, The South Grill. \n“I devoted my life to taking care of my family and never had the chance to do what I’ve always wanted. But now, everything seems to fall into place. I just realized that if you want to achieve something, you have to go out and get it,” she reflected. \nSurreal \nLotlot admitted to doubting herself many times—particularly on whether or not she would be able to fulfill her dream. “It took three months to build the store. Seeing the restaurant’s signage being put up was so surreal! I’ve dreamt of this many times. In the past, if I didn’t have enough money, I didn’t have the time or lacked confidence in myself that I would be able to accomplish it. One of my passions is to cook. So far, all those who have tasted my dishes liked them. I have not poisoned anyone yet,” she quipped. \nThe South Grill offers chicken, steak, lamb and Lotlot’s very own recipe of pork roast belly. It was Janine who came up with the store’s name. To raise the funds for it, Lotlot got a little help from her friends. “I asked them to partner with me and they immediately said yes, without asking what the concept was. The fact that they trusted my vision was more than enough for me. They all wanted to call it ‘Lotlot and Friends.’ I said, ‘We will not do that! No!’” \n“Lotlot and Friends” was a popular afternoon variety show in the 1980s that she hosted.", "external_links": [], "published": "2016-11-20T03:50:00.000+02:00", "crawled": "2016-11-19T23:06:16.999+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}