{"organizations": [], "uuid": "15139dac85983411667ff030c4d3420de73df58f", "thread": {"site_full": "www.chron.com", "main_image": "http://ww4.hdnux.com/photos/55/21/71/11869803/3/rawImage.jpg", "site_section": "", "section_title": "", "url": "http://www.chron.com/sports/article/Browns-coach-Jackson-emotional-after-12th-10638877.php", "country": "US", "domain_rank": 773, "title": "Browns coach Jackson emotional after 12th straight loss - Houston Chronicle", "performance_score": 0, "site": "chron.com", "participants_count": 0, "title_full": "Browns coach Jackson emotional after 12th straight loss - Houston Chronicle", "spam_score": 0.009, "site_type": "news", "published": "2016-11-28T01:18:00.000+02:00", "replies_count": 0, "uuid": "15139dac85983411667ff030c4d3420de73df58f"}, "author": "Tom Withers", "url": "http://www.chron.com/sports/article/Browns-coach-Jackson-emotional-after-12th-10638877.php", "ord_in_thread": 0, "title": "Browns coach Jackson emotional after 12th straight loss - Houston Chronicle", "locations": [], "entities": {"persons": [{"name": "josh mccown", "sentiment": "negative"}, {"name": "jackson", "sentiment": "negative"}, {"name": "hue jackson", "sentiment": "none"}, {"name": "odell beckham jr", "sentiment": "none"}, {"name": "romeo okwara", "sentiment": "none"}, {"name": "jason pierre-paul", "sentiment": "none"}, {"name": "ron schwane", "sentiment": "none"}, {"name": "eli manning", "sentiment": "none"}, {"name": "jimmy haslam", "sentiment": "none"}, {"name": "olivier vernon", "sentiment": "none"}, {"name": "terrelle pryor", "sentiment": "none"}, {"name": "david richard", "sentiment": "none"}, {"name": "mccown", "sentiment": "none"}, {"name": "dee", "sentiment": "none"}, {"name": "cody parkey", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "gallery cleveland", "sentiment": "none"}, {"name": "cleveland", "sentiment": "none"}], "organizations": [{"name": "browns", "sentiment": "negative"}, {"name": "houston chronicle close image", "sentiment": "negative"}, {"name": "new york giants", "sentiment": "negative"}, {"name": "cleveland browns", "sentiment": "negative"}, {"name": "detroit lions", "sentiment": "none"}, {"name": "ap browns", "sentiment": "none"}, {"name": "nfl", "sentiment": "none"}, {"name": "giants", "sentiment": "none"}, {"name": "ap image", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Close Image 1 of 5 Cleveland Browns quarterback Josh McCown (13) is sacked by New York Giants defensive end Jason Pierre-Paul (90) in the second half of an NFL football game, Sunday, Nov. 27, 2016, in Cleveland. Cleveland Browns quarterback Josh McCown (13) is sacked by New York Giants defensive end Jason Pierre-Paul (90) in the second half of an NFL football game, Sunday, Nov. 27, 2016, in Cleveland. Photo: Ron Schwane, AP Image 2 of 5 Cleveland Browns wide receiver Terrelle Pryor misses a pass in the first half of an NFL football game against the New York Giants, Sunday, Nov. 27, 2016, in Cleveland. Cleveland Browns wide receiver Terrelle Pryor misses a pass in the first half of an NFL football game against the New York Giants, Sunday, Nov. 27, 2016, in Cleveland. Photo: David Richard, AP Image 3 of 5 Cleveland Browns head coach Hue Jackson, right, meets with quarterback Josh McCown (13) on the sidelines in the first half of an NFL football game against the New York Giants, Sunday, Nov. 27, 2016, in Cleveland. less Cleveland Browns head coach Hue Jackson, right, meets with quarterback Josh McCown (13) on the sidelines in the first half of an NFL football game against the New York Giants, Sunday, Nov. 27, 2016, in ... more Photo: Ron Schwane, AP Image 4 of 5 Cleveland Browns quarterback Josh McCown (13) is sacked by New York Giants defensive end Jason Pierre-Paul (90) alongside defensive end Romeo Okwara (78) in the first half of an NFL football game, Sunday, Nov. 27, 2016, in Cleveland. less Cleveland Browns quarterback Josh McCown (13) is sacked by New York Giants defensive end Jason Pierre-Paul (90) alongside defensive end Romeo Okwara (78) in the first half of an NFL football game, Sunday, Nov. ... more Photo: David Richard, AP Image 5 of 5 Cleveland Browns quarterback Josh McCown (13) is sacked by New York Giants defensive end Olivier Vernon (54) in the second half of an NFL football game, Sunday, Nov. 27, 2016, in Cleveland. Cleveland Browns quarterback Josh McCown (13) is sacked by New York Giants defensive end Olivier Vernon (54) in the second half of an NFL football game, Sunday, Nov. 27, 2016, in Cleveland. Photo: Ron Schwane, AP Browns coach Jackson emotional after 12th straight loss 1 / 5 Back to Gallery CLEVELAND (AP) — Hue Jackson struggled to push out the words. A season he never fathomed reached another low point on Sunday, and as Cleveland's first-year coach wrestled to put it into perspective, Jackson paused to gather himself. He tapped the side of the podium with his right hand and pursed his lips as his eyes welled up. This hurts. \"Being 0-12 is probably the hardest thing ever,\" Jackson said after the Browns lost 27-13 to the New York Giants . Unfortunately, with four games left, it might get harder for him. Following the game, Jackson, saddled with a rookie-laden roster, met with Cleveland's \"upper management\" in his office before his news conference. Jackson insisted the discussion had nothing to do with his job status or future, and he's as committed as ever to turning Cleveland into a winner. But until that day arrives, Jackson has no choice but to keep teaching, motivating and pushing his players, who are hoping to avoid joining the 2008 Detroit Lions as the only teams to go 0-16. \"I have never been through this,\" he said. \"But I am not going to fall off a cliff or anything like that. These guys, these players, this organization, and the (ownership) group mean too much to me for me to ever feel like that. Do I ever get disappointed and frustrated? Yes, I do not want you guys to feel like I do not. I do not want you guys to think I do not get mad or sad or disappointed. I go through all of those emotions. \"At the same, I know what I signed up for. I know through our injuries and the things we have been through this season where we are and where we are trying to go. You can either beat yourself up, and I do that enough, or you can just put your head down and keep fighting and push through this. That is what we are going to do as a football team and as an organization.\" As has been the case most of this season, the Browns just didn't have enough talent — or luck — to pull out a win. They were within 20-13 in the fourth quarter before Eli Manning threw his second touchdown pass to Odell Beckham Jr. New York's defense put an exclamation point on the Giants' sixth straight win by sacking Josh McCown a few more times in the final minutes. McCown was dropped seven times as the Browns again struggled to protect their quarterback. Cleveland had two chances to score touchdowns in the first half, but had its drives stall and settled for field goals by Cody Parkey . That's been a familiar and frustrating pattern for Jackson, an offensive mastermind who just doesn't have enough weapons. If there's a shred of good news it's that the Browns have a bye next week, giving the coaching staff and players a break from the misery. Jackson said he'll devote the time off to fixing his team. \"It has been a long 12 weeks,\" he said, \"and unfortunate for the men in that room over there, we have not been able to get them a win yet. We will go back to the drawing board, and we will come back tomorrow. I know these guys will come to work, they will be ready to go and we will work through tomorrow. Then they will get out of here and we will self-scout ourselves and see where we are and go from there.\" Jackson brushed aside a question about his job security, saying he has the full support of owners Dee and Jimmy Haslam . He added they have continued to hold positive discussions about the team's struggles. \"In these times of toughness and times of crisis, you have to have good strong conversation,\" he said. \"It is healthy and it is good. That is how you do not go through these things in the future. You work through those things and you talk through them so that you can come on the other side, and they have been great with me from top to bottom. \"Hopefully, they feel the same from me to them. I don't like losing. I never have and I never will, and I have had my butt kicked up over my shoulders enough this season that I really don't need my butt kicked anymore. I have to figure out how to quit getting my butt kicked. It is just that simple.\" ___ ", "external_links": [], "published": "2016-11-28T01:18:00.000+02:00", "crawled": "2016-11-28T05:40:14.336+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}