{"organizations": [], "uuid": "74dd00e80505be739dbb23ff68570896e93faedd", "thread": {"site_full": "indianexpress.com", "main_image": "http://images.indianexpress.com/2016/11/hyderabad-high-court-480.jpg?w=480", "site_section": "", "section_title": "", "url": "http://indianexpress.com/article/india/india-news-india/top-maoist-leader-ramakrishna-is-safe-wife-tells-hyderabad-high-court-3737290/", "country": "US", "domain_rank": 598, "title": "Top Naxalite leader Ramakrishna is ‘safe’, wife tells Hyderabad High Court | The Indian Express", "performance_score": 0, "site": "indianexpress.com", "participants_count": 0, "title_full": "Top Naxalite leader Ramakrishna is ‘safe’, wife tells Hyderabad High Court | The Indian Express", "spam_score": 0.093, "site_type": "news", "published": "2016-11-04T18:51:00.000+02:00", "replies_count": 0, "uuid": "74dd00e80505be739dbb23ff68570896e93faedd"}, "author": "Pti", "url": "http://indianexpress.com/article/india/india-news-india/top-maoist-leader-ramakrishna-is-safe-wife-tells-hyderabad-high-court-3737290/", "ord_in_thread": 0, "title": "Top Naxalite leader Ramakrishna is ‘safe’, wife tells Hyderabad High Court | The Indian Express", "locations": [], "entities": {"persons": [{"name": "ramakrishna", "sentiment": "negative"}, {"name": "rahul gandhi", "sentiment": "negative"}, {"name": "k jaiswal", "sentiment": "none"}, {"name": "sirisha", "sentiment": "none"}, {"name": "nagarjuna reddy", "sentiment": "none"}, {"name": "rahul dev sharma", "sentiment": "none"}, {"name": "varavara rao", "sentiment": "none"}], "locations": [{"name": "andhra pradesh", "sentiment": "none"}, {"name": "odisha", "sentiment": "none"}, {"name": "hyderabad", "sentiment": "none"}], "organizations": [{"name": "bjp & congress", "sentiment": "negative"}, {"name": "hyderabad high court", "sentiment": "negative"}, {"name": "central committee", "sentiment": "none"}, {"name": "revolutionary writers association", "sentiment": "none"}, {"name": "andhra pradesh police", "sentiment": "none"}, {"name": "visakhapatnam rural district superintendent of police", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "OROP Suicide: BJP & Congress Engage In War Of Words Over Rahul Gandhi’s Detention \nAs the matter was not posted for today, the high court asked the petitioner to make an application through Registrar (Judicial) seeking to withdraw the petition. \nThe matter is likely to come up for listing on Monday (November 7) and the court will pass an order in view of request by the petitioner. \nIn the wake of an exchange of fire on Andhra-Odisha border on October 24 in which 24 Maoists were killed, doubts were expressed by the wife of Ramakrishna alias RK and relatives and party comrades that he might be in police custody. \nIn the habeas corpus petition, Sirisha sought directions to the Andhra Pradesh government to produce the outlaw before the court and to record his statement for appropriate action. \nAndhra Pradesh Police yesterday informed the high court that RK is not in their custody and following submission from the state police, the court had asked the petitioner, to produce before it any material with regard to him and posted the matter after two weeks. \nA division bench of justices C V Nagarjuna Reddy and M S K Jaiswal had earlier directed the Andhra Pradesh government to file counter affidavit informing the court whether RK was in police custody or not, while hearing the habeas corpus plea filed last week by Sirisha. \nResponding to the petition, Visakhapatnam Rural District Superintendent of Police Rahul Dev Sharma filed an affidavit before the court that RK, who is a member of the banned Central Committee of CPI (ML), is not in the custody of police. \nThe senior police officer further submitted that the incident of exchange of fire has occurred in the territory of Odisha state and requested the court to dismiss the petition. \nLast night, in a dramatic turn of events, a frontal organisation of the Maoists, the Revolutionary Writers Association (RWA) announced that RK was “safe”, barely hours after Sirisha alleged in the High Court of Judicature at Hyderabad that her husband was in police custody. \nRWA leader Varavara Rao called Telugu television news channels over phone and announced that RK was “safe” but did not give any details about his whereabouts or condition. \nThe late night announcement brought to an end the 10-day-old suspense and anxiety over RK’s state as there were allegations from Maoists’ frontal organisations and civil liberties groups that he might have been killed by the police in the October 24 encounter on the Andhra-Odisha border. \nSubsequently, these organisations alleged that RK was being held captive by the police and expressed apprehension that he too might be bumped off in a false encounter. Best of Express ", "external_links": [], "published": "2016-11-04T18:51:00.000+02:00", "crawled": "2016-11-04T13:51:46.165+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 32, "shares": 32, "comments": 0}, "stumbledupon": {"shares": 0}}}