{"organizations": [], "uuid": "d82a3636d99202a33fd788848c1a172dec58bdc7", "thread": {"site_full": "abcnews.go.com", "main_image": "http://a.abcnews.com/images/WNT/161031_wn_vega1_16x9_992.jpg", "site_section": "", "section_title": "", "url": "http://abcnews.go.com/WNT/video/hillary-clinton-holds-campaign-appearances-states-early-voting-43205844", "country": "US", "domain_rank": 72, "title": "Hillary Clinton Holds Campaign Appearances in States With Early Voting Video - ABC News", "performance_score": 0, "site": "go.com", "participants_count": 0, "title_full": "Hillary Clinton Holds Campaign Appearances in States With Early Voting Video - ABC News", "spam_score": 0.001, "site_type": "news", "published": "2016-10-31T07:00:00.000+02:00", "replies_count": 0, "uuid": "d82a3636d99202a33fd788848c1a172dec58bdc7"}, "author": "Abc News", "url": "http://abcnews.go.com/WNT/video/hillary-clinton-holds-campaign-appearances-states-early-voting-43205844", "ord_in_thread": 0, "title": "Hillary Clinton Holds Campaign Appearances in States With Early Voting Video - ABC News", "locations": [], "entities": {"persons": [{"name": "hillary clinton", "sentiment": "negative"}, {"name": "david", "sentiment": "none"}, {"name": "cecilia", "sentiment": "none"}, {"name": "bush", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "ross perot", "sentiment": "none"}, {"name": "perot", "sentiment": "none"}, {"name": "comey", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}, {"name": "clinton", "sentiment": "none"}, {"name": "cecilia vega", "sentiment": "none"}, {"name": "james comey", "sentiment": "none"}, {"name": "gore", "sentiment": "none"}, {"name": "biden", "sentiment": "none"}, {"name": "mccain", "sentiment": "none"}], "locations": [{"name": "cincinnati", "sentiment": "none"}, {"name": "north carolina", "sentiment": "none"}, {"name": "michigan", "sentiment": "none"}, {"name": "florida", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}, {"name": "ohio", "sentiment": "none"}], "organizations": [{"name": "abc", "sentiment": "none"}, {"name": "fbi", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "chicago cubs", "sentiment": "none"}, {"name": "nra", "sentiment": "none"}, {"name": "fbi investigators continue to analyze emails found on computer of clinton aide", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Video Transcript Transcript for Hillary Clinton Holds Campaign Appearances in States With Early Voting in the battleground of Ohio, where early voting is already under way, telling voters, quote, there is no case here. And they are now fighting to keep whatever they might have, the fire wall in some of the battlegrounds with early voters, who they know are heading to the polls right now. ABC's Cecilia Vega in Ohio. Reporter: In Ohio, where voting is already under way, tonight, Hillary Clinton trying to tackle the political firestorm engulfing her campaign. I'm sure a lot of you may be asking what this new e-mail story is about, and why in the world the FBI would decide to jump into an election with no evidence of any wrongdoing, with just days to go. That's a good question. Reporter: Clinton putting on a defiant front. And I am sure they will reach the same conclusion they did when they looked at my e-mails for the last year. There is no case here. Reporter: Clinton's team now counting on their get out the vote operation. More than 23 million votes already cast. Democrats outpacing Republicans in gaslegrobat pl grounds like Nevada and North Carolina. But in all-important Florida, it is Republicans with a slight edge in early voting. Here in Ohio, most Clinton supporters we spoke to brushed off this new chapter in the e-mail saga. If I say to you, Hillary Clinton and e-mails, you say -- I don't care -- I don't believe it -- Reporter: You can't say the word you want to say. I don't care. Reporter: Does this make you reconsider your vote at all? Not at all. Reporter: I am running against a man -- Clinton trying to focus back on her point. When the election is over, and people wake up on November 9th, we will have picked the person who will carry the responsibility for all of these weighty decisions. A man you can bait with a tweet is not a man we can trust with nuclear weapons. And Cecilia Vega joins us tonight from Cincinnati. Cecilia, you've been hearing that Hillary Clinton and the campaign will try to take this to Donald Trump in these final days, she wants to turn the focus back to trump. But even the Clinton campaign knows that it's going to be a tough task, given the new headlines about the e-mail. Reporter: They certainly do, but they're not giving up. The very last thing they want to be talking about this close to election day is these e-mails. They are bringing in other heavy hitters to try to change the subject, too. President Obama, vice president Biden will be out on the trail this week. David, you can imagine they'll be hitting Donald Trump, as well. Cecilia Vega right there in Ohio for us. Thank you. This transcript has been automatically generated and may not be 100% accurate. In a key battleground state, both Hillary Clinton and Donald Trump face an uphill battle with voters. Now Playing: Hillary Clinton and Donald Trump Take On Ohio Now Playing: Comey on Clinton Emails: By the Numbers Now Playing: FBI Inquiry Into Emails Throws Wrench Into Clinton Campaign Now Playing: Donald Trump Continues His Message of a 'Rigged' Election System Now Playing: Hillary Clinton Holds Campaign Appearances in States With Early Voting Now Playing: FBI Investigators Continue to Analyze Emails Found on Computer of Clinton Aide's Husband Now Playing: The Political Power of the 'October Surprise' Now Playing: 2016 - 8 Days: Clinton Campaign On Full Attack Mode Over Email Investigation Now Playing: Clinton Urges Supporters to 'Not Get Distracted' by FBI Email Revelation Now Playing: The Haunted History of Capitol Hill Now Playing: 2016 - 8 Days: Trump To Spend Halloween In Michigan Now Playing: 2016 - 8 Days: Trump Campaign Looks To Capitalize on Clinton Emails Now Playing: 2008 - 8 Days: Obama Pushes Unity Theme In Sprint Vs. McCain Now Playing: White House Won't 'Defend or Criticize' FBI Director James Comey Now Playing: 2000 - 8 Days: Gore Defends Himself Against NRA 'Smears' Now Playing: 1992 - 8 Days: Bush, Perot Feud Turns Personal Now Playing: 2000 - 9 Days: Gore Appeals To African-Americans, Unions Now Playing: 9 Days: McCain Campaign Denies Infighting Over Sarah Palin Now Playing: 9 Days: Bush Campaign Denies Ross Perot Sabotage Now Playing: Chicago Cubs Fans Vote for World Series and Tacos in Election Cycle Now Playing: {{itm.title}} {\"id\":43205844,\"title\":\"Hillary Clinton Holds Campaign Appearances in States With Early Voting\",\"duration\":\"2:38\",\"description\":\"The Democratic candidate is in Ohio reminding voters why she says she is more qualified than her opponent.\",\"url\":\"/WNT/video/hillary-clinton-holds-campaign-appearances-states-early-voting-43205844\",\"section\":\"WNT\",\"mediaType\":\"default\"} ", "external_links": [], "published": "2016-10-31T07:00:00.000+02:00", "crawled": "2016-11-01T07:26:04.488+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 1, "shares": 1, "comments": 0}, "stumbledupon": {"shares": 0}}}