{"organizations": [], "uuid": "151af7afa0ca41ce7a056bf28de16215c4bf6f44", "thread": {"site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/rtMhJCw.a0EySdvkDGcsGQ--/aD0zMTI7dz01NDA7c209MTthcHBpZD15dGFjaHlvbg--/http://40.media.tumblr.com/3df8e2cb6ab452a6d01a7e246bd41482/tumblr_inline_o28s53sZkh1tgknjf_540.jpg", "site_section": "https://www.yahoo.com/news/anti-discrimination-groups-denounce-trumps-appointment-of-steve-bannon-152756812.html", "section_title": "Antidiscrimination groups denounce Trump’s appointment of Steve Bannon", "url": "https://www.yahoo.com/news/heres-what-baba-vanga-predicted-for-2016-and-the-192833607.html", "country": "US", "domain_rank": 5, "title": "Here are 13 predictions that Baba Vanga made for 2016 and the future", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Here are 13 predictions that Baba Vanga made for 2016 and the future", "spam_score": 0.144, "site_type": "news", "published": "2016-11-14T02:00:00.000+02:00", "replies_count": 0, "uuid": "151af7afa0ca41ce7a056bf28de16215c4bf6f44"}, "author": "", "url": "https://www.yahoo.com/news/heres-what-baba-vanga-predicted-for-2016-and-the-192833607.html", "ord_in_thread": 0, "title": "Here are 13 predictions that Baba Vanga made for 2016 and the future", "locations": [], "entities": {"persons": [{"name": "baba", "sentiment": "negative"}, {"name": "baba vanga", "sentiment": "negative"}, {"name": "blind baba", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "vangelia pandeva dimitrova", "sentiment": "none"}, {"name": "boris iii", "sentiment": "none"}, {"name": "muslims", "sentiment": "none"}], "locations": [{"name": "vanga", "sentiment": "none"}, {"name": "balkans", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "france", "sentiment": "none"}, {"name": "us", "sentiment": "none"}, {"name": "strumica", "sentiment": "none"}, {"name": "earth", "sentiment": "none"}, {"name": "macedonia", "sentiment": "none"}, {"name": "syria", "sentiment": "none"}, {"name": "rome", "sentiment": "none"}, {"name": "europe", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "baba vanga", "sentiment": "none"}], "organizations": [{"name": "isis", "sentiment": "none"}, {"name": "islam", "sentiment": "none"}, {"name": "international monetary fund", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "She is called the Nostradamus of the Balkans, and with good reason. Baba, Vanga, the blind Bulgarian clairvoyant, who died 20 years ago, is believed to have predicted the rise of the ISIS, the fall of the twin towers, the 2004 Tsunami, and the global warming, among a host of other events. “Horror, horror! The American brethren will fall after being attacked by the steel birds.“ “The wolves will be howling in a bush and innocent blood will gush,” is, according to her followers, what she said about the fall of the twin towers. Born as Vangelia Pandeva Dimitrova, in Strumica, Macedonia, Baba Vanga, mysteriously lost her eyesight when she was 12, during a massive storm. She went missing for a few days, and it is during one of these days, that she had her first vision. Baba Vanga rose to popularity as she started to make predictions, and developed a healing touch, during the World War II. Several dignitaries visited the mystic during the years that she was active, including the Bulgarian tsar, Boris III. Before she died in 1996 from breast cancer, she had said that her gift would be passed on to a 10 year old girl, living in France, who will then take on from her. Her house has since been converted into a museum.\nHere are 13 predictions that the Blind Baba made for 2016 and beyond:\nBarack Obama will be the last president of the US: Baba Vanga had predicted that the 44 th US president would be an African American, but she had also added that he would be the last one. According to her, he would leave office at a time when the country would be in economic ruins, and there would be a huge divide between the northern and southern states – as was the case during the American Civil War.\nEurope will cease to exist: According to Baba Vanga, the continent will cease to exist by 2016, and all that would remain will be empty spaces and wasteland, nearly devoid of any form of life. She is reported to have said that chemical weapons would be used by extremists against Europe.\nMuslims will invade Europe: The blind mystic had also predicted that Muslims will invade Europe, and there will be widespread destruction by extremists, which will go on for many years, until the continent ceases to exist. She had also predicted that a Great Muslim War will begin in Syria.\nChina will become the new super power: As per her predictions, China is set to become the new superpower in 2018, bringing an end to the United States and its economy. According to her, the exploiters (the developed nations) will become the exploited (the third world). In 2011, the International Monetary Fund had also predicted that China’s economy will overtake that of the US in 2016, emerging as the new superpower.\nHunger eradication: Baba Vanga has predicted that hunger will get eradicated sometime between 2025 and 2028.\nOn to Venus: Humans will travel to Venus, according to the Baba, in search of new energy sources. They might even set up a colony there.\nRome as the capital of the Islamic caliphate: Islam will finish invading the whole of Europe by 2043, and Rome will be the capital of the new caliphate.\nIce caps melting: According to the Baba, ice caps will melt by 2045. The rate at which the ice caps are melting already due to global warming, does seem to suggest the same.\nCloning of organs: As per Baba Vanga’s predictions, body organs will be cloned in 2046, and that would be the easiest method of treatment.\nUS attacking Muslim dominated Europe: By 2066, the US will attack Muslim dominated Europe using climate change weapon, and will try to retake Rome and bring back Christianity.\nThe return of Communism: By 2076, communism will return to Europe and the rest of the world.\nUnderwater civilisations: By 2130, civilisations will learn how to live under water, with the help of aliens.\nThe death of the Earth: By 3797, everything on Earth will cease to exist. However, humans will be advanced enough to move to a new star system.", "external_links": [], "published": "2016-11-14T02:00:00.000+02:00", "crawled": "2016-11-14T19:18:47.745+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}