{"organizations": [], "uuid": "f1ad1ebfdf83ad400b0bc8ab15a56abc6e0ea362", "thread": {"site_full": "indianexpress.com", "main_image": "http://images.indianexpress.com/2016/11/turkey-child-marriage_kuma480.jpg?w=480", "site_section": "", "section_title": "", "url": "http://indianexpress.com/article/world/world-news/thousands-rally-against-turkey-child-sex-conviction-bill-4385098/", "country": "US", "domain_rank": 598, "title": "Thousands rally against Turkey child sex conviction bill | The Indian Express", "performance_score": 0, "site": "indianexpress.com", "participants_count": 0, "title_full": "Thousands rally against Turkey child sex conviction bill | The Indian Express", "spam_score": 0.061, "site_type": "news", "published": "2016-11-20T04:24:00.000+02:00", "replies_count": 0, "uuid": "f1ad1ebfdf83ad400b0bc8ab15a56abc6e0ea362"}, "author": "", "url": "http://indianexpress.com/article/world/world-news/thousands-rally-against-turkey-child-sex-conviction-bill-4385098/", "ord_in_thread": 0, "title": "Thousands rally against Turkey child sex conviction bill | The Indian Express", "locations": [], "entities": {"persons": [{"name": "yagmur", "sentiment": "none"}, {"name": "binali yildirim", "sentiment": "none"}, {"name": "erdogan", "sentiment": "none"}, {"name": "ugur", "sentiment": "none"}, {"name": "bekir bozdag", "sentiment": "none"}, {"name": "recep tayyip erdogan", "sentiment": "none"}], "locations": [{"name": "turkey", "sentiment": "none"}, {"name": "istanbul", "sentiment": "none"}, {"name": "ruya", "sentiment": "none"}, {"name": "kadikoy", "sentiment": "none"}], "organizations": [{"name": "afp", "sentiment": "none"}, {"name": "justice and development party", "sentiment": "none"}, {"name": "nato", "sentiment": "none"}, {"name": "justice", "sentiment": "none"}, {"name": "ap", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Thousands rally against Turkey child sex conviction bill Thousands rally against Turkey child sex conviction bill \"We will not shut up. We will not obey. Withdraw the bill immediately!\" the around 3,000 protesters shouted amid claps and whistles as they marched to Kadikoy square on the city's Asian side. By: AFP | Istanbul | Published:November 20, 2016 2:53 am People waved banners emblazoned with slogans such as “#Rape cannot be legitimised” and “AKP, take your hands off my body,” a reference to the ruling party of President Recep Tayyip Erdogan, which introduced the bill. (source: AP) \nThousands of people, including women and children, marched on Saturday in Istanbul against a controversial bill that would overturn men’s convictions for child sex assault if they married their victim. \n“We will not shut up. We will not obey. Withdraw the bill immediately!” the around 3,000 protesters shouted amid claps and whistles as they marched to Kadikoy square on the city’s Asian side. Others waved banners emblazoned with slogans such as “#Rape cannot be legitimised” and “AKP, take your hands off my body,” a reference to the ruling party of President Recep Tayyip Erdogan, which introduced the bill. \nWatch what else is making news: \nThe opposition, celebrities, and even an association whose deputy chairman is Erdogan’s daughter have expressed alarm over the move. But the government insists the legislation was aimed at dealing with the widespread custom of child marriages and the criticism was a crude distortion of its aim. Justice Minister Bekir Bozdag on Saturday moved to reassure opponents that the bill would not pardon rapists. \n“The bill will certainly not bring amnesty to rapists…. This is a step taken to solve a problem in some parts of our country,” he told a NATO meeting in Istanbul. After the controversy, Prime Minister Binali Yildirim late on Friday ordered his ruling Justice and Development Party (AKP) to hold talks with the opposition in parliament on the planned measures. The measures were approved in an initial parliamentary reading on Thursday and will be voted on again in a second debate in the coming days. Critics have said the government is encouraging the rape of minors. \n“We will not allow the AKP to acquit and set free rapists in this country,” one of the women protesters who gave her name as Ruya told AFP. “Women will resist and take to the streets until this law and similar other laws are withdrawn.” \nAnother protester, a middle-aged man named Ugur, was at the protest with his 14-year-old daughter. “I am concerned about my daughter’s future,” Ugur told AFP. “AKP is passing any law they want in the parliament.” The AKP enjoys a comfortable majority in the 550-seat parliament, holding 317 seats. \n“That’s the maximum we can do. To protest,” he said. If passed, the law would allow the release from prison of men guilty of assaulting a minor if the act was committed without “force, threat, or any other restriction on consent” and if the aggressor “marries the victim”. \nThe legal age of consent in Turkey is 18 but child marriage is widespread, especially in the southeast. Another protester, Yagmur, called the bill a “nonsense”, saying that it was a trap to open the way to legitimise religious weddings — common in some parts of the country. Best of Express ", "external_links": [], "published": "2016-11-20T04:24:00.000+02:00", "crawled": "2016-11-19T23:24:20.378+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}