{"organizations": [], "uuid": "ca048b1336301b62690b4b3abc857be0f769a3af", "thread": {"site_full": "sg.news.yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/6ASvFef3m5YbyASbrXW4mw--/aD0xMjk2O3c9MjAwMztzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en_us/News/ap_webfeeds/bde5a93865274ff2a41815824f0e3954.jpg", "site_section": "https://ca.news.yahoo.com/?format=rss", "section_title": "Yahoo News Singapore - Latest News & Headlines", "url": "https://sg.news.yahoo.com/top-senate-dem-serves-notice-gop-trump-priorities-170122791--election.html", "country": "US", "domain_rank": 5, "title": "Top Senate Dem serves notice to GOP, Trump on priorities", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Top Senate Dem serves notice to GOP, Trump on priorities", "spam_score": 0.0, "site_type": "news", "published": "2016-11-20T02:00:00.000+02:00", "replies_count": 0, "uuid": "ca048b1336301b62690b4b3abc857be0f769a3af"}, "author": "", "url": "https://sg.news.yahoo.com/top-senate-dem-serves-notice-gop-trump-priorities-170122791--election.html", "ord_in_thread": 0, "title": "Top Senate Dem serves notice to GOP, Trump on priorities", "locations": [], "entities": {"persons": [{"name": "chuck schumer", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "schumer", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "antonin scalia", "sentiment": "none"}, {"name": "harry reid", "sentiment": "none"}, {"name": "merrick garland", "sentiment": "none"}, {"name": "obama", "sentiment": "none"}], "locations": [{"name": "new york", "sentiment": "none"}, {"name": "washington", "sentiment": "none"}, {"name": "nevada", "sentiment": "none"}], "organizations": [{"name": "ap", "sentiment": "negative"}, {"name": "gop", "sentiment": "negative"}, {"name": "senate", "sentiment": "negative"}, {"name": "senate democratic caucus", "sentiment": "none"}, {"name": "trump", "sentiment": "none"}, {"name": "associated press", "sentiment": "none"}, {"name": "freedom caucus", "sentiment": "none"}, {"name": "congress", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "new yorker trump", "sentiment": "none"}, {"name": "supreme court", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "WASHINGTON (AP) — Democratic Sen. Chuck Schumer of New York is threatening political payback if congressional Republicans and President-elect Donald Trump try to undo President Barack Obama's major legislative achievements. \"They will rue the day\" they repeal Obama's health care law, Senate Democrats' leader-in-waiting told The Associated Press in an interview in his office on Friday. \"It's a political nightmare for them. They'll be like the dog that caught the bus.\"\nTrump, after meeting with Obama, said he'd like to keep popular pieces of the six-year-old law, including the requirement to extend coverage to people with pre-existing conditions and the provision allowing young adults to stay on their parents' health plans until age 26.\nBut Schumer said it was a non-starter to try picking off favored pieces of the Affordable Care Act.\n\"There is no way that you can keep those things without keeping the ACA,\" Schumer insisted. He added that he'd made similar points directly to Trump, but declined to share the president-elect's response.\nCongressional Republicans have tried repeatedly to repeal the law that helped some 20 million Americans gain coverage, but they've been unable to coalesce around a replacement.\nDemocrats chose Schumer this week to serve as minority leader, replacing Sen. Harry Reid of Nevada, who is retiring after five terms. In the interview, Schumer also served notice on the Dodd-Frank Wall Street reform bill that provided for tougher oversight of financial institutions and created a consumer protection bureau after the 2008 economic crisis.\n\"He should not even try to think about repealing Dodd-Frank,\" Schumer said. \"We will have enough votes to beat that back.\"\nAs leader of a 48-member Senate Democratic Caucus next year, Schumer will command enough votes to block majority Republicans from getting the 60 votes needed to proceed on most major legislation. As such, Schumer and his Democrats will be the only backstop against Trump and the GOP next year when Republicans control both chambers of Congress and the White House.\nBut the Brooklyn-born Schumer pledged to work with fellow New Yorker Trump when possible, arguing that to do otherwise would amount to a \"a dereliction of our responsibility to the millions of Americans who need work, who need protection.\"\nIndeed Schumer argued that on some issues Trump has more in common with the Democrats than Republicans, suggesting a strategy that would amount to forming alliances with Trump where possible against the wishes of conservative Republicans and GOP leaders on the Hill.\n\"Donald Trump in his campaign advocated many things or a good number of economic issues that Democrats support and Republicans have opposed,\" Schumer said, pointing to trade, spending on infrastructure, and a financial loophole benefiting wealthy Wall Street interests.\nSchumer blamed Democrats' election failures on an ineffective economic message, and adopting some of Trump's rhetoric he pledged \"a bolder, stronger, sharper-edged economic plan aimed at the middle class and those trying to be middle class, and an understanding that the system is rigged against the average person and it's gotta change, a draining of the swamp if you will.\"\nBut he also promised to fight Trump \"with everything we've got\" when the new president takes an approach opposed to Democratic values. \"We're not going to do something in name only,\" Schumer said.\nOn infrastructure, Trump has proposed a $1 trillion spending program that some conservatives are already balking at.\nSchumer said he'd told Trump: \"It'll make a lot of your hard-right people against it, the Freedom Caucus will never go for a large infrastructure bill.\"\n\"He didn't say 'no,'\" Schumer said of Trump's response.\nAnd unlike demands from conservatives, Schumer said he didn't think such an infrastructure bill would have to be fully paid for — meaning it could add to the deficit instead — a position he said he believed Trump might share.\nSchumer also signaled a fight over the Supreme Court vacancy, noting that after refusing to act for nearly a full year on Obama's nominee, Merrick Garland, for the vacancy created by the death of Justice Antonin Scalia, \"our Republican colleagues who want to move this quickly don't come before us with clean hands.\"", "external_links": [], "published": "2016-11-20T02:00:00.000+02:00", "crawled": "2016-11-20T00:15:16.395+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}