{"organizations": [], "uuid": "cae7e2a70a662609ab737c7bc0f50bf2c4463ed5", "thread": {"site_full": "edition.cnn.com", "main_image": "http://i2.cdn.turner.com/cnnnext/dam/assets/161026181707-05-houston-chinatown-super-tease.jpg", "site_section": "http://rss.cnn.com/rss/cnn_latest.rss", "section_title": "CNN.com - RSS Channel", "url": "http://edition.cnn.com/2016/11/03/foodanddrink/houston-chinatown/index.html", "country": "US", "domain_rank": 81, "title": "An Asian-Cajun blend in the Lone Star State", "performance_score": 0, "site": "cnn.com", "participants_count": 1, "title_full": "An Asian-Cajun blend in the Lone Star State - CNN.com", "spam_score": 0.0, "site_type": "news", "published": "2016-11-03T02:00:00.000+02:00", "replies_count": 0, "uuid": "cae7e2a70a662609ab737c7bc0f50bf2c4463ed5"}, "author": "John Nova Lomax, CNN", "url": "http://edition.cnn.com/2016/11/03/foodanddrink/houston-chinatown/index.html", "ord_in_thread": 0, "title": "An Asian-Cajun blend in the Lone Star State", "locations": [], "entities": {"persons": [{"name": "stri", "sentiment": "positive"}, {"name": "hank", "sentiment": "none"}, {"name": "dun huang", "sentiment": "none"}, {"name": "xiangqi", "sentiment": "none"}, {"name": "kim", "sentiment": "none"}], "locations": [{"name": "chinatown", "sentiment": "none"}, {"name": "houston", "sentiment": "none"}, {"name": "lone star state story", "sentiment": "none"}, {"name": "southwest", "sentiment": "none"}, {"name": "bayou city", "sentiment": "none"}, {"name": "beechnut street", "sentiment": "none"}, {"name": "hong kong", "sentiment": "none"}, {"name": "dun huang plaza", "sentiment": "none"}, {"name": "uyghur bistro", "sentiment": "none"}, {"name": "saigon boulevard", "sentiment": "none"}, {"name": "sichuan", "sentiment": "none"}, {"name": "westpark drive", "sentiment": "none"}, {"name": "vietnam", "sentiment": "none"}, {"name": "hong kong city", "sentiment": "none"}, {"name": "lone star state", "sentiment": "none"}, {"name": "hong kong city's crawfish cafe", "sentiment": "none"}, {"name": "san francisco", "sentiment": "none"}, {"name": "turtlewood ct.", "sentiment": "none"}, {"name": "hunan", "sentiment": "none"}, {"name": "hong kong city mall", "sentiment": "none"}, {"name": "bellaire", "sentiment": "none"}, {"name": "louisiana", "sentiment": "none"}, {"name": "great wall", "sentiment": "none"}, {"name": "asia", "sentiment": "none"}, {"name": "fondren road", "sentiment": "none"}, {"name": "china", "sentiment": "none"}, {"name": "xinjiang autonomous region", "sentiment": "none"}, {"name": "hong kong food market", "sentiment": "none"}, {"name": "mala sichuan", "sentiment": "none"}, {"name": "dun huang", "sentiment": "none"}, {"name": "bellaire boulevard", "sentiment": "none"}, {"name": "texas", "sentiment": "none"}, {"name": "hunan bistro", "sentiment": "none"}, {"name": "new york city", "sentiment": "none"}, {"name": "america", "sentiment": "none"}, {"name": "south gessner", "sentiment": "none"}, {"name": "los angeles", "sentiment": "none"}], "organizations": [{"name": "giau bar n", "sentiment": "none"}, {"name": "dun huang plaza", "sentiment": "none"}, {"name": "beltway", "sentiment": "none"}, {"name": "moshi moshi gifts", "sentiment": "none"}, {"name": "cnn", "sentiment": "none"}, {"name": "buddhist teo chew temple", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Story highlights Southwest of downtown, Houston's Chinatown features an array of Asian cultures Strip-mall complex Dun Huang Plaza offers a one-stop opportunity to sample many of them Houston, Texas (CNN) When you hear the word \"Chinatown,\" you probably think of the 19th-century buildings and steep-graded streets of San Francisco, or the steaming manhole covers of chilly New York City: compact but dense areas packed with pedestrians accessed via ornate Far Eastern gateways. \nThat is not what you will find in Houston's Chinatown, a vast, rectangular, city-within-a-city 12 miles southwest of downtown, sprawling along Bellaire Boulevard from Fondren Road on the east to Highway 6 on the west, and extending north roughly to Westpark Drive and south to Beechnut Street. Instead of converted Victorian tenements, think brand-new strip malls (and even a 1970s-style enclosed mall), postwar Levittown-style ranch houses and 1970s office parks and apartment complexes. From the air, it looks like any other automobile-friendly shopping district. But oh, what a difference when you are the ground. There is some debate as to whether \"Chinatown\" suffices to encompass the multitude of Asian cultures visitors will find within its boundaries. Yes, the street signs along Bellaire Boulevard from South Gessner to roughly Beltway 8 are posted in Mandarin characters as well as English script, but go further west and they change to Vietnamese. (The Chinese name for Bellaire translates to \"Hundreds of Profits,\" while the Vietnamese have renamed the same street Saigon Boulevard.) Read More And while those two cultures are easily the most visible in the roughly six-square-mile area, they are far from the only ones you will find. Moshi Moshi Gifts on Bellaire Boulevard stocks an array of playful products. 'Asiatown' might be more apt Case in point: Dun Huang Plaza, a four-building, two-story strip mall complex at 9889 Bellaire, just east of Beltway 8. With its long procession of cramped strip malls adjacent to but apart from one another, this Chinatown is paradoxically both dense and sprawling. Because the area is so difficult to thoroughly explore in a single day, Dun Huang is your best bet for a relatively bite-sized, one-stop experience -- a pan-Asian riot of retail, restaurants and relaxation. First, those restaurants. A visitor could easily spend several days here and not sample the same cuisine twice at lunch, dinner or as bar bites over late-night cocktails. The variety of cuisines to choose from at lunch and dinner shows why \"Asiatown\" might be a more apt name than Chinatown. At Dun Huang Plaza alone, diners can choose from Japanese, Cantonese, Taiwanese, Hunan, Hong Kong, Vietnamese, Korean and Malaysian fare. Asian bakeries offer your best option for breakfast. Six Ping (Suite D-246) is highly recommended for its pastries both sweet (Japanese cheesecake, mochi and red beans, gigantic macarons and Hello Kitty cakes) and savory (a variety of pork and sausage buns.) Most of Six Ping's offerings come in at around two dollars, so you get plenty of carbs for your money. You'd be hard-pressed to find Hunan cuisine as spicy or authentic as what's on offer at Hunan Bistro . Bold diners can sample fish heads, frog legs, chicken feet and pork bellies, while those reluctant to make the complete leap over the Great Wall can tuck into more familiar fare like whole fish, beef, lamb, tofu and chicken. Unless specified otherwise, be prepared for your mouth to be set alight with spices, and beware the numbing properties of Sichuan peppercorns, which despite the restaurant's Hunan designation, are in evidence in some dishes here. Along with its famed hot pots with names like \"Prosper at 5 a.m.\" and \"Top Notch Pot of the Outlaws,\" Sichuan peppercorns are the stock in trade of Mala Sichuan, a few blocks east at 9348 Bellaire. Dense with dining and shopping, too Those in search of even more exotic regional Chinese fare can find it at Uyghur Bistro , which offers spicy halal kebabs, noodles and lamb dishes from China's Islamic far western Xinjiang Autonomous Region (9888 Bellaire, across the street from Dun Huang Plaza). Rival Malaysian restaurants stare each other down across the Dun Huang parking lot -- the intimate Banana Leaf and the more imposing Mamak, which offers diners a window into the kitchen, where cooks toss roti dough overhead like pizza chefs. This naan-like crispy-on-the-outside, fluffy-on-the-inside roti bread is served as an appetizer to be dipped in curry sauces. (Broadly speaking, Malay cuisine is a cross between Indian, Cantonese and Indonesian.) A fried noodle dish, mee goreng, is on the menu at Mamak Malaysian restaurant. Like most Dun Huang restaurants, Mamak offers lunch specials for under $7. Here that could get you okra and shrimp in Malaysian sauce, rendang beef or Hainanese chicken, each with a mound of rice. While Houston's 2014-era ramen craze has abated somewhat, Dun Huang's Tiger Den still draws crowds to its doors each day for its 5 p.m. opening. Throngs gather to poke their chopsticks in steaming bowls of miso, tantan and tonkotsu soups, while late-night visitors to Dun Huang flock to the bar at GiAu Bar N' Bites, an occasionally raucous Vietnamese lounge/tapas bar where the \"avocado bomb\" sushi roll has garnered a serious cult following. Though famed primarily as a dining destination, Dun Huang offers a handful of prime shopping spots as well. Chinese bric-a-brac (including electric firecrackers!) is the stock in trade of LP Trading, while my tween daughter adores browsing the Japanese knick-knacks at Fit , on Dun Huang's top floor. She also loves the plush and cuddly inventory (if not the higher prices) at Moshi Moshi Gifts (9108 Bellaire). Vietnamese with a dash of Cajun Shopping -- for jewelry, apparel, religious statuary and electronics -- supplants dining as the primary function at Hong Kong City Mall (11205 Bellaire), although there are dining options there as well. Despite its name, Hong Kong City Mall is heavily Vietnamese, its food court a great place to grab a cool glass of bubble tea, a thick, sweet Vietnamese iced coffee, a crispy banh mi sandwich, a bowl of pho or a pile of Vietnamese-style boiled crawfish. One possible shopping break? A bubble tea from Kim's Teahouse. Houston has long enjoyed its close proximity to Louisiana cooking, but Vietnamese-Americans, more of whom call Houston home than anywhere in America outside of the Los Angeles area, have kicked up the Bayou City's long-popular crawfish game considerably, resulting in a dish some have crowned as Houston's signature food. Their mudbugs are boiled in a broth that uses both traditional Cajun ingredients and lemongrass and ginger, and the finished product is dipped in a spicy butter/garlic sauce. Hong Kong City's Crawfish Cafe is a prime spot to grab a pound or five, as are Crawfish & Noodles (11360 Bellaire), Cajun Kitchen (6938 Wilcrest) and Hank's Cajun Crawfish (10800 Bellaire). Hong Kong City's food court and outdoor pagodas are always the scene of many a heated game of xiangqi (Chinese chess), with rival masters nipping on cans of Budweiser and sometimes drawing crowds of nail-biting onlookers. The mall is anchored by a somewhat dingy if giant and spectacularly well-stocked Hong Kong Food Market, its produce section groaning under the weight of spiky durian fruits and an astounding array of peculiar bananas, its giant seafood section offering more variety than many a municipal aquarium. If you live in a town without a full-service Asian market, this is a great place to stock up on teas, sauces, cooking pastes and sake, not to mention sinus-clearing instant ramen and powdered Vietnamese iced coffee, two items to which I have recently become addicted. Houston's Chinatown is relatively lacking in postcard-worthy vistas, but one exception is the Vietnamese Buddhist Teo Chew Temple (10599 Turtlewood Ct.). Seen in the middle distance from Bellaire Boulevard and across sluggish Brays Bayou, its traditional appearance coupled with the steamy landscape sweeps viewers away to southeast Asia. It's open to the public, and after you drive past a typical 1970s apartment complex, its incense-redolent air, serene atmosphere and ornate shrines to both bodhisatvas and ancestors (many of the latter adorned with offerings of fruit, takeaway lunches, or mini-bottles of liquor) sweep you deeper still into the heart of Vietnam, right here in the Lone Star State.", "external_links": [], "published": "2016-11-03T02:00:00.000+02:00", "crawled": "2016-11-03T14:56:24.790+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}