{"organizations": [], "uuid": "f6c01be689b45c9fa10b0eae993319c3385deec3", "thread": {"site_full": "in.reuters.com", "main_image": "http://s4.reutersmedia.net/resources/r/?m=02&d=20161119&t=2&i=1162353708&w=&fh=545px&fw=&ll=&pl=&sq=&r=LYNXMPECAI0GU", "site_section": "", "section_title": "", "url": "http://in.reuters.com/article/uk-usa-trump-idAFKBN13E0QL", "country": "US", "domain_rank": 408, "title": "Trump meets former rival Romney, a possible contender as top diplomat | Reuters", "performance_score": 0, "site": "reuters.com", "participants_count": 0, "title_full": "Trump meets former rival Romney, a possible contender as top diplomat | Reuters", "spam_score": 0.672, "site_type": "news", "published": "2016-11-20T01:57:00.000+02:00", "replies_count": 0, "uuid": "f6c01be689b45c9fa10b0eae993319c3385deec3"}, "author": "Steve Holland", "url": "http://in.reuters.com/article/uk-usa-trump-idAFKBN13E0QL", "ord_in_thread": 0, "title": "Trump meets former rival Romney, a possible contender as top diplomat | Reuters", "locations": [], "entities": {"persons": [{"name": "romney", "sentiment": "negative"}, {"name": "ist trump", "sentiment": "negative"}, {"name": "trump", "sentiment": "negative"}, {"name": "reuters/mike segar", "sentiment": "none"}, {"name": "bob corker", "sentiment": "none"}, {"name": "barack obama", "sentiment": "none"}, {"name": "donald trump", "sentiment": "none"}, {"name": "mitt romney", "sentiment": "none"}, {"name": "steve holland", "sentiment": "none"}, {"name": "rudy giuliani", "sentiment": "none"}, {"name": "mike pence", "sentiment": "none"}, {"name": "leslie adler", "sentiment": "none"}, {"name": "john bolton", "sentiment": "none"}], "locations": [{"name": "trump national bedminster", "sentiment": "none"}, {"name": "united states", "sentiment": "none"}, {"name": "n.j.  bedminster", "sentiment": "none"}, {"name": "new york", "sentiment": "none"}, {"name": "u.s.", "sentiment": "none"}, {"name": "bedminster", "sentiment": "none"}, {"name": "massachusetts", "sentiment": "none"}, {"name": "tennessee", "sentiment": "none"}, {"name": "white house", "sentiment": "none"}, {"name": "bedminster", "sentiment": "none"}, {"name": "new jersey", "sentiment": "none"}, {"name": "n.j.", "sentiment": "none"}], "organizations": [{"name": "reuters world news", "sentiment": "negative"}, {"name": "cabinet", "sentiment": "none"}, {"name": "trump national golf club", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "World News | Sun Nov 20, 2016 | 12:27am IST Trump meets former rival Romney, a possible contender as top diplomat left right U.S. President-elect Donald Trump and Vice President-elect Mike Pence (R) greet former Massachusetts Governor Mitt Romney (L) as he arrives for their meeting at the the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 1/10 left right Former Massachusetts Governor Mitt Romney arrives to meet with U.S. President-elect Donald Trump and Vice President-elect Mike Pence at the the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 2/10 left right U.S. President-elect Donald Trump greets former Massachusetts Governor Mitt Romney (L) as he arrives for their meeting at the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 3/10 left right U.S. President-elect Donald Trump greets former Massachusetts Governor Mitt Romney (L) as he arrives for their meeting at the the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 4/10 left right U.S. President-elect Donald Trump (L) escorts former Massachusetts Governor Mitt Romney (C) and Vice President-elect Mike Pence into the main clubhouse for a meeting at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 5/10 left right U.S. President-elect Donald Trump (L) escorts former Massachusetts Governor Mitt Romney (C) and Vice President-elect Mike Pence into the main clubhouse for a meeting at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 6/10 left right Former Massachusetts Governor Mitt Romney arrives to meet with U.S. President-elect Donald Trump and Vice President-elect Mike Pence at the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 7/10 left right U.S. President-elect Donald Trump greets former Massachusetts Governor Mitt Romney as he arrives for their meeting at the the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 8/10 left right U.S. President-elect Donald Trump and Vice President-elect Mike Pence (R) stand together as they arrive at the the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 9/10 left right U.S. President-elect Donald Trump and Vice President-elect Mike Pence greet former Massachusetts Governor Mitt Romney (L) as he arrives for their meeting at the the main clubhouse at Trump National Golf Club in Bedminster, New Jersey, U.S., November 19, 2016. REUTERS/Mike Segar 10/10 By Steve Holland | BEDMINSTER, N.J. \nBEDMINSTER, N.J. President-elect Donald Trump and 2012 Republican presidential nominee Mitt Romney set aside their long-simmering rivalry on Saturday and sat down for talks that could include whether Romney should serve as Trump's secretary of state. \n\"Mr. President-elect, how are you sir?\" Romney said in greeting Trump and Vice President-elect Mike Pence on his arrival at Trump's golf resort in Bedminster, New Jersey. \nRomney was the first in a long list of people Trump was meeting on Saturday and Sunday as he seeks to fill out his Cabinet and seek advice ahead of his Jan. 20 move to the White House. \nAs a leader of the establishment Republican \"never Trump\" movement, Romney had sought in vain to derail Trump's march to the Republican presidential nomination. \nBack in March, he delivered a biting speech saying Trump would be dangerous as president, with policies that could throw the United States into a recession. \nHe had also said, \"I'm afraid that when it comes to foreign policy he is very, very not smart.\" \nFor his part, Trump had denounced Romney as a \"choke artist\" for losing the 2012 election to President Barack Obama. \nBut with Trump now the president-in-waiting, Romney's appearance at Trump National Bedminster on an unseasonably warm November day was symbolic of hard-won party unity. \nWhether it will lead to Romney joining the Trump administration is unclear. Trump has been considering former New York Mayor Rudy Giuliani, a close adviser, for secretary of state, as well as former U.S. ambassador to the United States John Bolton and U.S. Senator Bob Corker of Tennessee. \nTrump transition officials said his meeting with Romney was supposed to be a general discussion about the incoming Trump administration. \nA Romney confidant said of Romney's secretary of state prospects: \"Could it happen? I suppose. But it's unlikely.\" \nInstead, the source said the meeting gives \"the good housekeeping seal of approval to Republicans who don't know if they should help Trump or not.\" \n(Reporting by Steve Holland; Editing by Leslie Adler) Next In World News ", "external_links": [], "published": "2016-11-20T01:57:00.000+02:00", "crawled": "2016-11-19T22:28:51.748+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}