{"organizations": [], "uuid": "2aebd0419fc3dc5c70ced45a01d78c2170bc74fb", "thread": {"site_full": "www.yahoo.com", "main_image": "https://s.yimg.com/uu/api/res/1.2/xX0rVR1HUWY3gKeGLKulaw--/aD0zMDAwO3c9NDAwMDtzbT0xO2FwcGlkPXl0YWNoeW9u/http://media.zenfs.com/en-US/homerun/the_daily_meal_299/3b0cfa092289c7ab11429db27a32d7fa", "site_section": "https://ca.style.yahoo.com/rss", "section_title": "Fashion and lifestyle News - Yahoo Style Canada", "url": "https://www.yahoo.com/beauty/seattle-welcomes-nighttime-farmers-market-204714391.html", "country": "US", "domain_rank": 5, "title": "Seattle Welcomes a New Nighttime Farmers Market", "performance_score": 0, "site": "yahoo.com", "participants_count": 0, "title_full": "Seattle Welcomes a New Nighttime Farmers Market", "spam_score": 0.0, "site_type": "news", "published": "2016-11-04T03:47:00.000+02:00", "replies_count": 0, "uuid": "2aebd0419fc3dc5c70ced45a01d78c2170bc74fb"}, "author": "", "url": "https://www.yahoo.com/beauty/seattle-welcomes-nighttime-farmers-market-204714391.html", "ord_in_thread": 0, "title": "Seattle Welcomes a New Nighttime Farmers Market", "locations": [], "entities": {"persons": [{"name": "bruce", "sentiment": "none"}, {"name": "dillon", "sentiment": "none"}, {"name": "sara naftaly", "sentiment": "none"}, {"name": "matt dillon", "sentiment": "none"}], "locations": [{"name": "brussels", "sentiment": "none"}, {"name": "seattle", "sentiment": "none"}, {"name": "upper bar ferdinand", "sentiment": "none"}, {"name": "pike street", "sentiment": "none"}, {"name": "capitol hill", "sentiment": "none"}, {"name": "marmite", "sentiment": "none"}, {"name": "vashon island", "sentiment": "none"}, {"name": "london", "sentiment": "none"}], "organizations": [{"name": "seattle welcomes a new nighttime farmers market seattle welcomes a new nighttime farmers market alexis steinman pin", "sentiment": "negative"}, {"name": "chophouse row’s upper bar ferdinand", "sentiment": "none"}, {"name": "amandine bakeshop", "sentiment": "none"}, {"name": "pike place market", "sentiment": "none"}, {"name": "puget sound food hub", "sentiment": "none"}, {"name": "kurt farm shop", "sentiment": "none"}, {"name": "honor society coffee", "sentiment": "none"}]}, "highlightText": "", "language": "english", "persons": [], "text": "Seattle Welcomes a New Nighttime Farmers Market Alexis Steinman Pin it Share Seattleites have been fans of fresh-grown produce and locally raised meat long before farm-to-table became a buzzword. Case in point: Our biggest tourist attraction, Pike Place Market , has been a working farmers market since 1907. Situated in the heart of downtown, this bustling spot has nearby... More Seattleites have been fans of fresh-grown produce and locally raised meat long before farm-to-table became a buzzword. Case in point: Our biggest tourist attraction, Pike Place Market , has been a working farmers market since 1907. Situated in the heart of downtown, this bustling spot has nearby chefs and residents stocking up their larders amid crowds of camera-touting tourists. Seattle’s latest market on the block is equally urban, but in a decidedly modern way. The Night Market at Chophouse Row is nestled between historic, mixed-use buildings in Capitol Hill. Though just steps away from busy Pike Street, the market is an oasis of cosmopolitan cool. In Chophouse Row’s architecturally stunning courtyard, vendor tents are tucked beneath twinkling lights strung between glass facades, concrete beams, and brick walls. Shopping for Brussels sprouts has never been so stylish. This Wednesday-evening market is the brainchild of the James Beard Award-winning chef Matt Dillon, the owner of Chophouse Row’s Upper Bar Ferdinand . A longtime champion of the region’s farmed, foraged, and fished bounty, Dillon created this metropolitan mercantile to connect local farmers to city dwellers. One of the first vendors at the market, which just took root Nov. 2, is the Puget Sound Food Hub , a farmer-owned cooperative of regional, independent family farms. They sell seasonal produce, which currently includes a wintry rainbow of radicchio, carrots, and savoy cabbage. Dillon’s Vashon Island farm, Old Chaser Farm , provides additional produce as well as eggs. Tonnemaker Family Orchards has organic pears and apples and their addictive fruit leather on hand. Bonus for all you bread-lovers: You can buy Plane Bread’s transcendent artisanal sourdough loaves, which were previously only available at Dillon’s London Plane . Specialty coffee roaster Honor Society Coffee has whole beans as well as steaming cups of joe to fuel your shopping. They share table space with Amandine Bakeshop’s transcendent macarons and pastries. In the spirit of urban community upon which Chophouse Row was founded, each week, the market has a rotation of guest stalls showcasing design, craft, and culinary goods by the building’s retail tenants and local businesses. Be sure to save time for lingering at one of the Night Market’s epicurean neighbors. Grab a scoop of tomato jam ice cream from Kurt Farm Shop ; a glass of gamay (or a bottle to go) from Upper Bar Ferdinand; or a bite at Marmite, Bruce and Sara Naftaly’s soon-to-open French café. The Night Market at Chophouse Row, 1424 11th Avenue, runs every Wednesday from 4 to 8 p.m., rain or shine.", "external_links": [], "published": "2016-11-04T03:47:00.000+02:00", "crawled": "2016-11-04T03:53:14.479+02:00", "highlightTitle": "", "social": {"gplus": {"shares": 0}, "pinterest": {"shares": 0}, "vk": {"shares": 0}, "linkedin": {"shares": 0}, "facebook": {"likes": 0, "shares": 0, "comments": 0}, "stumbledupon": {"shares": 0}}}